{"Sports": ["Alex Ovechkin makes a young fan's day by giving him his stick", "David Foley's overhead kick against North Ferriby", "Sky have confirmed the Leicester City chairman and 4 others were in the helicopter. Terrible news.", "Leicester City owners helicopter crashes outside King power Stadium", "After passing the 5-hour, 41-minute mark, this is now the longest World Series game in history.", "Pairs figure skating is insane. Here are the gold medalists from today’s 2018 Skate Canada Championships.", "N'Keal Harry makes a ridiculous one-handed catch", "[NFL] Four Jacksonville Jaguars involved in incident at London club", "On this day 14 years ago, the Curse of the Bambino was broken", "Dodgers beat Red Sox 3-2 in 18! innings on a walk-off HR by Max Muncy", "Yaisel Puig Sends a Ball Into Orbit, Rodriguez Throws Glove into Mound in Disgust", "This is my son.", "Max Muncy Walks Off the Longest World Series Game Ever", "Simone Biles dominates at world championships despite kidney stone", "Rocket City Trash Pandas show off new baseball logos", "Moreland's Moonshot Cuts the Lead to One", "Leicester City owner's helicopter crashes", "Outrageous pass from Firmino", "This tennis tournament is using shelter dogs as ballboys", "A Beginner's Decent", "Clemson's 300 pound defensive lineman Christian Wilkins scores rushing touchdown", "Tyson Fury on Suicide &amp; Depression", "The All-Ireland Gaelic Football Championship Trophy has been stolen, and returned, while on display in New York for only the 2nd time in 38 years.", "Kid gets thrown Ovechkins stick, the amount of emotions is amazing!", "18 amazing facts from last night's marathon game.", "After the Long Foul Ball, Eovaldi Struck Out Muncy on a Backdoor Cutter; The Next AB, Muncy was Looking for Just That", "Northwestern's Bennett Skowronek makes an amazing 32 yard catch", "One of the worst calls for a crazy INT turned TD", "Ohio State fans pour in support to Purdue fan Tyler Trent, after the Buckeye loss to Purdue.", "Tony Stewart Reconsiders Return To Indy 500 After Wickens Crash", "Will Grier goes over the WVU game plan against Baylor.", "The amazing camera work capturing the L.A. Dodgers as they watch their teammate hit a walk-off HR in the 18th inning in Game 3 of the World Series", "\"That\" selfie", "The Dodgers Are One Win Away From Triggering The Super Sports Equinox In LA", "UAE Football player sobs during game and stops the play after hearing insults directed towards his deceased brother", "American basketball player gets kicked off Austrian team for brutal sucker punch - Golf Digest", "Hours after winning Game 2 of the World Series, Mookie Betts helps deliver food to the homeless outside of Boston Public Library", "NASCAR Driver's Dream Turning Into A Reality!", "Indycar Driver Robert Wickens Does 1st Slide Transfer as Paraplegic Today Following Horrific Crash at Pocono", "Complete 180 compared to some other divas", "Canadian IndyCar Series driver Wickens confirms paralysis in legs", "In The Last Round of The Last Fight of WEC: The Showtime Kick", "The Detroit Red Wings are so bad this year that Arby's has changed a long running promotion from \"Free curly fries if a player scores three goals in a game\" to \"Free curly fries if the team scores three goals in a game\"", "When coaches told Koulibaly to take 'hands-on' approach to organising the team's defence, he took their words literally.", "Hopkins with an unreal grab", "College football referee specifically says penalty is due to a player \"using profanity\"", "Erink Clark's disability, sacral agenesis, doesn't stop her from paragliding and pole dancing", "Shaun Murphy Trickshot vs Ronnie O'Sullivan", "NFL reportedly fires official after missing blatant false start in Charger-Browns game", "Lance off the glass to Lonzo for the jam | Spectrum SportsNet", "Referee tells crowd to be quiet or it will cost a home team timeout", "Curt Schilling, Red Sox hero turned far-right provocateur, not invited to join 2004 teammates at Fenway", "Houston Rockets offer Wolves four first-round draft picks for Jimmy Butler", "Lance Armstrong’s former team manager given lifetime ban from cycling", "Steph Curry hitting everything in warmups", "Brozović sliding block from a freekick [Barcelona - Inter]", "Stephen Curry scores 51 Points in 3 Quarters on 11/15 shooting for 3 pointers", "[Cricket] Virat Kohli becomes the quickest to reach 10,000 runs in ODI cricket, hits 157 not out against West Indies, India vs West Indies 2nd match (10/24/2018)", "[Cricket] Shai Hope's brilliant 123 runs not out that helped West Indies tie the match against India, India vs West Indies match 2 (10/24/2018)", "Hippity hop by Benentendi", "Sidney Crosby with insane overtime goal", "Kawhi Leonard reads the play perfectly", "BYU honors Lauren McCluskey the slain Utes track star by wearing University of Utah colors, their rival school.", "Demetrious Johnson suplexes Ray Borg straight into an armbar, breaking Anderson Silva's record for most consecutive title defenses in the UFC.", "What happened to Darius Miles? His rise and fall in the NBA, then his life after basketball.", "World Series 2018: Dodgers pitching coach rips Fenway Park's 'brutal' bullpens", "Feeling a rookies's heartbeat before his debut", "Mookie Betts steals 2nd base against Kershaw in game 1 of the World Series, so we get free tacos!", "This is goalball, a sport played by blind people", "Adidas Executive, Two Others Found Guilty in College Basketball Corruption Trial", "‘It was a spectacle’: the forgotten era of women’s bicycle racing | Books | The Guardian", "Jack Wilshire finishes off one of the greatest team goals in football history", "NHL stays with status quo as Canada pot legalization looms", "Sportsbook Owner ‘5Dimes Tony’ Found Dead in Costa Rica", "Damian Lillard of the Portland Trail Blazers entered the arena tonight as Stone Cold Steve Austin", "Interview with Dave Ryding British Slalom Skier) about his objectives for this season, as well as how to get into skiing in the United Kingdom.", "The movement on this knuckleball", "McGregor throws signature strike at Buchinger &amp; Nurmagomedov. Khabib did his homework.", "Utah Utes track athlete Lauren McCluskey shot and killed", "NFL players with brain trauma receive notice of settlements stripped to nothing", "Kareem Hunt breaks tackles and hurdles a defender", "Soccer goalkeeper hits seagull", "Broncos' QB Chad Kelly arrested for criminal trespassing", "Heavy Wipeout off Nazaré, Drone Footage of wave and aftermath", "First Russian UFC champ during a ceromy honouring him", "Baseball: Former WBC championship team skipper Hara rejoins Giants", "Alex Martin Smith wrote a book on the SEC’s Greatest Football Games and he’s with us on r/SECfootball for an AMA session at 5 ET.", "Beer guy catches hockey puck and gets scolded by usher", "Tapine re-signs with Canberra Raiders until end of 2023", "Jaguars fan sucker punches Texans fan. Knocks him out cold.", "Where did Kareem Hunt go?", "Federer's smash of the century against Andy Roddick", "The story of a corrupt approach at the 2011 World Cup", "Steven Adams still does handshake behind reporter with Nick Collison even though Collison is no longer on the team", "T.J. Lee requests a Wide Reciever then gets a train run on him", "Kevin Durant with the Golden State Warriors showing off his ball handling skills", "Justin Tucker, the Most Accurate Kicker in NFL History, Reacts to Missing a Game Tying Extra Point Attempt", "Atlanta United FC has broken the all-time MLS attendance record with an average league attendance of 53,002 in 2018", "A Special Olympics Race", "Spectacular try in amateur club rugby game in South Africa", "/r/tennis Discussion (October 28th, 2018)", "Match Thread: Stephens vs Svitolina (Final, 2018 WTA Finals)", "Saw this and thought it belonged here lol :(", "2 Top 10 wins and a 500 final, not a bad week for this guy!", "Nick Kyrgios streaming Black Ops 4", "If Jack Sock wins the Paris Masters I will shave my right eyebrow", "Dreary day? Ball machine time.", "Who wins today?", "How does this even make sense? Fabio is behind Coric in the race but is still capable of a qualification?", "Never thought this would be the cod streamer I'd watch.....", "Christian Garin today achieved his 15th consecutive win and with it his 3rd consecutive Challenger title.", "Babos and Mladenovic win the WTA Finals title", "ATP - Performance Timeline of younger players (&lt;21 years) in the Open Era", "Sloane Stephens vs Elina Svitolina !2018 FINAL WTA!", "TL;DR Recap(+GIFS) 🎾 Basel &amp; Vienna Semi-Finals - Federer Shows Up🔥, Tsitsipas And The Ballgirl😡, The Problem With A. Zverev's Forehand🔧 - The Racquet", "2018 FINAL::Sloane Stephens vs Elina Svitolina | Singapore WTA Full Match Preview", "Federer v Agassi: ATP Finals 2003 Final Highlights", "\"I’m Not a Big fan of the New Davis Cup\" says Leander Paes", "Federer pulls out his rare two-handed backhand in Basel", "Winning a GS with defeating other atleast 1 of big 3", "Need some help on my serve if you don’t mind...", "Does anyone know who is coaching Sloane Stephens at the WTA Finals in Singapore? It's not Kamau Murray.", "Stephens completes stunning Pliskova comeback, seals Singapore final spot", "Roger Federer: 'Playing 200th career-semifinal in Basel is more special'", "Gerard Pique: 'Roger Federer's legs can do only what they can do'", "WTA Finals Singapore 2018: Sloane Stephens vs Elina Svitolina final match details and live streaming update", "Svitolina just edges out Bertens into WTA final in Singapore", "Ball boys with racquets in Vienna ?", "Stephens says, \"I can finish off in the right way\"", "Andy Murray to Join Stan Wawrinka : Marseille Open", "Ons Jabeur: The Bravest WTA Player (MOSCOW FINAL)", "So I heard y’all love some dropshots! Here are a few from The Magician herself!", "/r/tennis Discussion (October 27th, 2018)", "Strolling back into the scene like...", "Does anyones know what kind of racquet this is?", "Tsitsipas being sweet and kind with a ballboy", "Medvedev playing style", "Federer getting frustrated", "Tennis and Baseball", "Well this is awkward.", "Paris draw is out", "WTA FINALS SEMIFINALS PREVIEW &amp; PREDICTIONS: Stephens vs Pliskova &amp; Svitolina vs Bertens", "Basel QF : Stefanos Tsitsipas Vs Daniil Medvedev Amazing Highlights", "Exactly four years since Andy Murray’s ballsy comeback vs Tommy Robredo to win the Valencia title, in a must-win match to strengthen his WTF qualifying bid.", "Just Monfils things! 🏃", "Hot Shot: Zverev, Helped By Tweener, Wins Epic 40-Shot Rally In Basel 2018", "How come the WTA Finals doubles isn't round-robin?", "PSA: Change your socks", "Novak djokovic Jumping on stairway", "Seriously how good is Nishikori?", "I destroyed my barricades in just a few months!", "Honoring Todd Reid who passed away today..Fed vs Reid 3R AO 2004 Rare Highlights", "TL;DR Recap 🎾 Basel &amp; Vienna QF's + Paris Masters Draw Preview - Zverev's Tweener + A 40 Shot Rally🔥, Federer Struggles, Medvedev &amp; Tsitsipas's Cold Handshake❄️ - The Racquet", "Using Wilson k factor 95, looking for new racquet", "'You have no idea how much tennis costs': Thiem's father warns parents", "ATP Masters - Paris 2018 - Prediction Competition | Tennis Warden", "ATP Next-Gen Finals to allow video review of Chair Official judgement calls", "🎾 WILL FEDERER WIN IN BASEL? - ATP World Tour Predictions", "2018 WTA Finals Singapore semi-final day: Check match preview and live streaming details", "Federer beats Simon in 3 tough sets in Swiss Indoors QFs", "Need serve advice!", "Bertens breaks through to WTA finals semis after Osaka injury", "Nishikori vs Thiem Highlights", "Former Aussie tennis prodigy found dead", "🎾 CAN NISHIKORI WIN IT ALL? - ATP World Tour Predictions", "The top four seeds have all been eliminated from the WTA Finals", "My favorite photo of this season!", "Novak Djokovic All New Fitness Excercices", "WTA Finals: Sloane Stephens beats Angelique Kerber to reach semi-finals", "Tennis vlog", "17 Wins in a Row for Fed in Basel", "How often has a player retired from an ATP/WTA Finals match?", "Just like your serve", "Tennis Players disrespect towards umpires is getting worse every year... *compilation*", "Caroline Wozniacki reveals in press @WTAFinalsSG that she was diagnosed with rheumatoid arthritis before the US Open.", "/r/tennis Discussion (October 26th, 2018)", "WTA Finals Semifinals", "Oh the suspense!", "Tennis vs other sports....One player vs Teams", "Caroline Wozniacki reveals arthritis diagnosis", "As Jurgen Melzer withdraws in Vienna and officially announces his retirement, let's remember the pinnacle of his career - Defeating Novak Djokovic in an epic 5 set match at the French Open (2010)", "Renzo Olivo takes racquet abuse to unforeseen heights", "Stan Wawrinka on Instagram: “Enjoying the lunch while thinking about my season.... oh sh#t !”", "Djokovic working out", "Please tell me a site to stream ATP matches live. Thanks in advance guys! &lt;3", "What an angle with the return from Tsitsipas", "Nishikori takes over the number 9 spot in the Race to London", "hybrid with kirschbaum pro line II", "Borna Coric is a stand-up guy.", "Fun Practice Set with a Friend - Indoor Amateur Tennis", "Amazing point - Sestini Hlavackova/Strycova vs. Klepac/Martínez Sánchez - 2018 WTA Finals Singapore Doubles", "TL;DR Recap (+GIFS) 🎾 Basel &amp; Vienna Day 4 - Federer Improves, Gulbis Is Heckled🤬, Zverev's HUGE Backhands🔥 - The Racquet", "Hey there ! Anyone got a good reliable link to watch/stream bâle tournament ? Thanks a lot, have a nice day", "New talented young gun? Alexei Popyrin vs Alexander Zverev HIGHLIGHTS BASEL 2018", "Why haven't the mods for this sub changed the avatar yet?", "Perfect save", "Todd Reid passes away - Former Wimbledon junior plagued by injury and illness.", "Virtua Tennis 4 is 20% off", "WTA Finals", "Nadal expected to play in Paris Masters next week", "Federer: \"I would be happier it I won an ATP 250 instead of reaching a Masters 1000 semifinal\"", "Shitpost Sunday Thread", "[Mod Post] We're looking for new mod(s) - apply in here", "Dropped not rested: Selectors tell MS Dhoni his T20I career is over", "This YouTube comment really nailed it", "Cricket-themed AskOuija thread", "Top 25 wicket takers after the ODI WC 2015 sorted by % innings they went wicketless", "Shaun Marsh seals Test spot with another top knock", "Last 20 innings comparison - Dhoni, Sehwag, Ganguly &amp; Gambhir", "Rangpur Riders sign AB De Villiers", "This Week IPL News:- Kings XI has traded Marcus Stoinis for Mandeep Singh with Royal Challengers Bangalore. Mike Hesson to join Kings XI Punjab as their new coach. Shikhar Dhawan could move to Delhi DareDevils in new set of revelations.", "David Warner 'removes himself' from game after sledge in Sydney grade", "Who knows, maybe BC will surpass Sachin", "The sledge that prompted Warner's walk-off", "MSK had a brainfade?", "Why do we sympathise when batsmen are careless?", "Most runs in ODIs, since Jan 1st 2016", "Spied this India fan with four sets of sunglasses on during WI innings", "Warner Vs Smith - First Grade Nov 10th", "'The authorities let it happen' - Steve Waugh on Cape Town ball-tampering scandal", "[Video] Virat Kohli's 107 vs West Indies (3rd Consecutive Century)", "The willow whisperer: The young Aussie some of the world's best cricketers call to fix their bats - ABC News", "Indian Pacers since January 2017", "I know we are very far out but how do you guys rate Australia's chances at the 2019 world cup?", "Team India on Instagram: “Just for laughs - This happened today in the Deodhar Trophy final. @ajinkyarahane felt he got a 100, @sureshraina3 said there were 3 more…”", "Batsmen who don't bowl, bowlers that can't bat", "Indian cricket team jersey for new born babies", "[Post Match Thread] Ind vs WI, Pune | 27th October, 2018", "\"MS Dhoni’s omission took place after Rohit and Kohli’s approval.”- BCCI Official", "Dhoni in IPL Vs in T20I.", "Ashley Nurse reveals the reason of his 'Babaji Ka THULLU' celebration", "My dad went to a golf day on Wednesday and was able to speak to AB de Villiers, he thinks he’s going to the World Cup", "The Windies side has become a platform for players to perform and move on - Zaheer Khan", "Sarfraz appealing behind the stump. Looks like someone set his ass on fire.", "T20I Highlights: Sri Lanka vs England 2018", "Cricket Australia reviews 'confronting', says ex-captain Taylor", "The Grade Cricketer on Twitter: Oh yeah, Game 3 of the World Series went for 8 hours? Now do that five times and sometimes there won’t even be a winner. That’s a real sport", "Match Thread: Sheffield Shield, Round 2, Day 4", "My Indian team for WC.", "Nick Compton curse Virat Kohli on twitter. This is unacceptable from someone who has played international cricket.", "ITT: Great batsmen being destroyed by fast bowling", "Classic Kumar Sangakkara cover drives", "1st One Day Game - Hong Kong vs Papua New Guinea - 2018 South China Cup - Match Thread", "Sanga's Perfect Cover drives", "PP coming in and going out", "Highlights &amp; FOW: India vs West Indies 3rd ODI", "Sachin Tendulkar taking Mumbai to a win against Haryana", "Match Thread: India vs West Indies at Maharashtra Cricket Association Stadium, Pune", "Can someone explain George Bailey's stance to me? Is he expecting the bowler to come from extra cover or legit what's the benefit of this?", "Match Thread: Sri Lanka vs England at R Premadasa Stadium, Colombo", "The willow whisperer: The young Aussie some of the world's best cricketers call to fix their bats", "Hard on Mayank to be dropped without being given an opportunity - Zaheer Khan", "Bumrah's 4-wicket haul and toes crushing yorker against the Windies", "RSA pitches and conditions", "David Warner walks off field at grade cricket game after allegedly being sledged", "With all the hype around Lloyd Pope it’s been lost that fellow teenager Cam Green currently has 22 FC wickets at an average of 13.7 in 5 matches", "PCB with a Solid response.", "Sachin Tendulkar's 81st century in first class cricket", "Sachin Tendulkar Great Strokes Before Getting Adjudged Out By Umpire Vs Pakistan At Perth In 2000", "Ishan Kishan and Ajinkya Rahane have both smashed centuries in the Deodhar trophy final for India C against India B, registering an opening partnership of 210.", "Can anyone explain why Pakistan has been so bad in ODIs in its recent history while we do pretty well in T20s and sometimes even in Tests?", "India C win the Deodhar Trophy 2018 Final vs India B", "Deodhar Trophy final showcases India's batting riches", "Indian cricket fans, are we going to get a throwback of the times when only satisfaction we got during matches was seeing Sachin got hundreds and rest of the team just got through the motions.", "Raza fist-bumps Kayes as he got out after a terrific knock.", "Does anyone else thinka Chahal was main reason behind Indias defeat in Pune ODI?", "With the current form Kohli is in, and with 2 more matches to go, do you guys think Kohli will breach the 935 mark set by Sir Viv and be the best of all time?", "Changes for the next ODI between India and West Indies", "India clinch blind cricket series against Sri Lanka", "CAN IPL ruin India's World Cup Campaign in 2019?", "The private battles of Moises Henriques - Gideon Haigh, The Australian", "Finch has been made Australias odi captain", "Indian team for the Australia tour", "Fakhar Zaman runout of Ben McDermott", "Steve Smith 105 vs India World Cup 2015 Semi-Final", "Quietly on Another Part of the Planet, Away from the Kohli Phenomena, Sean Williams Has Been on a Roll with Scores of 69, 50*,47 &amp; 129* in the Last Four Innings @ an Average of 147.5.", "Post Al Jazeera documentaries reaction.", "A good read from Sid Monga on what makes the likes of Kohli and Amla succeed in ODIs.", "[Off Topic] Rilee Rossouw now streaming on twitch.", "Pakistan has now won 10 consecutive T20 series (25 match wins in 29)", "Aaron Finch blows up after D’Arcy Short run out drama", "Highlights: Pakistan vs Australia 2nd T20 2018", "Gideon Haigh delivered this really moving speech on the importance of club sports, with a special focus on cricket clubs - It is a wonderful listen, highly recommended. Youtube transcript included in comments.", "Tactics Question: why did Maxwell open the bowling for Aus against Pak, but not bowl any more?", "Match Thread: India B vs India C at Feroz Shah Kotla, Delhi, Deodhar Trophy Final.", "Match Thread: Australia Women vs Pakistan Women at Kinrara Academy Oval, Kuala Lumpur", "Australian squad for South Africa ODIs", "Saturday Sledge Thread", "Anyone here faced someone that made you shit your pants? what was the story?", "Century Scoring Rates in ODIs: How top batsmen have outperformed their peers in century scoring", "Match Thread: JLT Sheffield Shield round 2, day 3", "Pokhara Premier league, Nepal's newest t20 league starts today.", "Match Thread: Australia vs Pakistan at Dubai International Cricket Stadium", "2018 West Pacific Cup Finals - PNG vs HK - live streams on all of CHK's social media!", "Our batting has forced India to bring back Bhuvi and Bumrah - Stuart Law", "Can we get a replay of that fakhar Zaman run out?", "Team for three T20I match series against Australia announced. Virat Kohli (C), Rohit (vc), Shikhar, KL Rahul, Shreyas Iyer, Manish, DK, Rishabh Pant (wk), Kuldeep Yadav, Yuzvendra Chahal, Washington Sundar, Krunal Pandya, Bhuvneshwar Kumar, Jasprit Bumrah, Umesh Yadav, Khaleel", "Rendezvous with Virat Kohli - No sense of entitlement after ten years of playing for India", "[VIDEO] Sean Williams 129* vs Bangladesh 3rd ODI", "Cricket, r/Cricket, and mental health", "Shakib Al Hasan making Some Questionable Outfit Choices", "Anyone got highlights from Kohli's 160 (where he ran 100 of the 160) against SA?", "The Dhoni drop, Jadhav juggle and Rohit punt", "Weekly /r/Football Discussion - What's on your mind?", "Leicester Club Helicopter Crash", "Clasico Preview", "Football Quotes of the Week", "Ronaldo rams home penetrating rocket as Empoli cry No!", "He’s getting better", "5-0 &gt; 6-2. A look back at this weekend's notable fixtures over the years", "Let’s all pray for him.", "So I made an XI of Footballers I Secretly Like (which have no affiliations with Chelsea). What's yours?", "The 100 hour War - When a football match started a war between two countries!", "Looking for EPL football team to root for, I don't want Arsenal, even Čech Is our best player in UK", "Is there any official post followup for bad referees?", "Who would you take: Prime Fernando Torres or Prime Luis Suarez", "Spurs have a sponsor?", "Tottenham close to another contract signature", "No Messi or Ronaldo fans", "The greatest players not to play a World Cup (Pt1)", "Tottenham to lose 4 in January", "And finally the 5 Greatest players never to play a World Cup (pt 4/4)", "New Keeper for spurs?", "The Greatest players never to play a World Cup (Pt3)", "Koulibaly invents a new defensive technique to stop Mbappe", "Media hype", "The greatest players not to play a World Cup (Pt 2)", "1 billion?", "Could spurs lose their magic manager?", "Chelsea 3 vs 1 Bate", "England climb to No5 in the Fifa World rankings following Nations League victory over Spain", "Whatever happened to England’s likely lads of ‘93?", "Champions League review: Mo Salah reaches half-century as Liverpool win comfortably", "Dark horses for champions league?", "Jose Mourinho ‘makes his Romelu Lukaku decision’ before Everton", "Dortmund are on fire..", "Infantino asks for vote on new tournaments despite opposition", "Irish Football Team Bohemian FC Celebrate Link To Bob Marley", "Real Madrid approach Conte", "Manchester City reached their peak against Shakhtar", "VIDEO: Several CSKA Moscow Fans Injured By Collapsed Escalator Ahead of Roma Clash", "PSG - NAPOLI", "Share football match predictions today", "Arsenal plays Football the right way.", "MAN UNITED", "Help me to stop pain(goalie)", "England’s weekly winners and losers", "Supporting Man. City", "Marquinhos: Barca and Real can only dream about Neymar", "Any good browser football simulators?", "Arsenal 3-1 Leicester: Mesut Ozil stars in Arsenal's 10th win in succession", "Ronaldo CR7 Teammates 11.", "Still Got it! The 10 Oldest Goalscorers in the History of the Premier League", "Juventus for the first time lost points in Serie A", "Ronaldo 1st to hit 400 goals in Europe's top 5 leagues", "Who do you all support?", "Match Thread: Philadelphia Union vs New York Red Bulls [Major League Soccer]", "Mourinho: I’d be glad to see Hazard in Manchester United", "Ter stegen is the worlds best goalkeeper", "Mourinho reminds Chelsea fans how many goals Spurs put past United", "Who are/were your favorite players outside of Europe and America?", "FIFA Women’s World Cup 2019: Ticket Packages Now On Sale", "Football and depression", "Messi's passing with Argentina", "Manchester United full-back Luke Shaw signs contract extension", "Best coach in the world right now?", "Neymar all smiles after ‘reaching agreement with PSG to let him join Barcelona for £193m’", "\"History of football |all about soccer to foot ball Documents\"", "Experience with Goalinn.com? To trust or not.", "UEFA National Team Power Rankings", "Best currently available datasets?", "Can Chelsea pull off a giant January striker signing? 💰", "A friend of mine has just ditched his job in the UK to help kick-off some grass roots football in India", "Help: What do you know about Goalinn.com?", "Spanish football elite facing up to new realities - Back Page Football", "Germany NEEDS Özil", "Saudi prince Manchester United takeover closer than ever as Premier League POWERLESS to stop Mohammad Bin Salman buying Red Devils", "Gibraltar must be so happy right now", "Guardiola's Barcelona weaknesses", "Finland greatest achievement in football", "We must destroy the bookies !!!", "Cesc Fabregas gets his SECOND Guinness World Record!", "France vs Germany 2-1 - Highlights &amp; Goals - UEFA Nations League - 2018 🔥🔥🔥", "Sorry to ask...", "Brazil vs Argentina 1-0 - Highlights &amp; Goals - International Friendlies - 2018 🔥🔥🔥", "Spain vs England 2-3 - Highlights &amp; Goals - UEFA Nations League - 2018", "Clinical, refreshing and full of potential: One great night in Seville for England", "The thriller in Sevilla", "7 Football Clubs Who Could Offer Usain Bolt a Contract", "Romelu Lukaku drops massive hint he is ready to quit Man United to move to Juventus", "What U21 player(s) do you recommend watching?", "The most hated referee in Brazil", "As a football athlete, I have always faced a problem with keeping my shin guard in place. Seems comming the solution", "Gibraltar Wins First Competitive Match in Its History", "Germany have only won one competitive match since October 2017. Goals - Highlights", "Does anyone care about international football?", "Harry Kane insists he is not burnt out!", "Who is the best club in all times", "Where does real madrid 2014 2018 rank amgonst football best sides?if not frist the where and who is the best side by your opninon ?", "Is real madrid 2014 2018 best team of all time if not why", "Croatia 0-0 England", "Netherland vs Germany - Highlights &amp; Goals - UEFA Nations League - 2018", "Rules", "Female Workout Routine For Booty and Stomach Toning", "Need a gym partner like this LOL .in Africa btw", "Need a gym partner", "One like = One day of eating right and exercising", "150 kg dead lift..😰", "Jump Rope vs Treadmill", "Market research - Workout Supplements", "Need some more cuts!! Can't seem to get the bullhorns and more cut around my midsection. Been cutting carbs, cardio, etc. I'm 46 so.......", "14 yr old needing routine for tennis", "Have you guys tried these leggings!?", "Workout suggestion for someone that has a healing left hand and a left ankle that hasn’t gone through physio", "Looking for a program", "Explosive workout calisthenics ... Awaken the beast inside", "Neck and double chin!", "Workout guide trade!", "How should I start with weights?", "What's the best time of day to work out?", "Any tips on avoiding bruising from hip thrusters? I used a foam pad that wrapped around the bar, but this is the second time it’s slipped and caused hip bruising. Someone help!", "This is Jump Rope Fundamentals For Beginners", "Feedback on Gym Anxiety! Help!", "Need headphone advice. Wires or no wires?", "Products to take?", "31 y/o wanting to continue my growth seeking advice on workout program!", "I made \"The App for the Gym\" and I'd love feedback! Feel free to leave comments below or PM me - I'd love to hear any suggestions for features or your thoughts in general. Thanks!", "Plank variations", "Biceps and Shoulders/Triceps and Chest/Lats and Traps. Looking to split Lats and Traps", "Right side bigger than left... what can I do?", "[New] Awesome New Workout Apparel Website!", "How long does it take to lose 30kg", "‘Triangle man boobs problem’ HELP", "where to start ...", "Looking for ideas", "Weight Plate routine", "Help with workout plan", "I have no idea where to start.", "Should I even start working out", "My Work Out Plan Until New Year!", "THE FITNESS IDEA - Official Trailer", "Working out morning and evening?", "How to Gain Weight In a Healthy Way", "Punching bag for postpartum workout", "[Workout/Vlog] Pull day with Daniel", "Tai-Chi, Biking and Strength Training are Necessary for an Aging Body", "Hadrien Darmon", "I need help with cravings and snaking", "Posture for Singers: Medium High Chest Posture Exercise", "Fixing shoulder pain from a physical therapists point of view", "Little Motivation!!!", "15 year old", "Weight loss and bulking? Help please", "Aloe vera juice and weight gain", "Looking for a coach", "EPIC CHEST DAY TRAINING!!!- Road to Pro", "DEADLIEST WARRIOR WORKOUT ! MOTIVATION", "Fitgirlmels guide, SBBBguide, or gracefituk guides 2/3", "Sore inner elbow (whats the name for this area?)", "If you're looking for a 20 -25 minutes Full Body Workout routine.. only using Bodyweight .. then check this out", "HOME WORKOUT ABS for all levels - The most complete fat burning exercises.", "Need help with meal plan/workout", "That dude just tried to punch me.", "anyone have a good shredding meal plan?", "🌟Our Weight Loss Journey🌟 EPISODE #6", "Help please", "I’m a newbie and I need help!", "10 - minute jump rope workout", "Macronutrient breakdown question", "6 PACK ABS in 30 DAYS", "Workout routine for skinny 17 year old male?", "Help On Workout Routine", "Core workout ideas?", "WOD: Clean + Bar Pullover + Box Jump|Crossfit", "Is this gynecomastia or fat? I've been working out for the past years to get slimmer.", "Balancing cycling, TRX, and kettlebell without overtraining", "BE STRONG! 💪", "Workout program for muscle mass: Hypertrophy Specific Training (HST) Routine", "Question about pushups", "Hypertrophy block", "Is working out on 2 hours of sleep is beneficial?", "Protein style burger @ In-N-Out! ( save those carbs)", "Looking into Cross Training can improve Your Workout", "Working out and pain", "at home lifting guides?", "Workout and fitness story and tips", "How do you get rid of chest fat FAST?", "Is this a good workout? Im trying to build tricep endurance", "Routine Workout While Aging might be More Crucial Than You Know!", "My Weekly Schedule", "Do any of you wear over-the-ear headphones while working out?", "Started gymming but goddamn this hands pain..", "My biceps hurt really bad and it’s not regular soreness. Does anyone have an idea as to why?", "The Greatest Time to Exercise", "Have to start calisthenics somewhere 😅", "Decent routine?", "Stimulating Healthy Food Practices in Children", "Power Hypertrophy Adaptive Training (PHAT) Routine", "Fast And Effective Cardio Workout Challenge 100 Jump Burpees A Day", "Functional training", "Am I wasting my time?", "A quick question", "Kinda an odd question: Recommendations on what I can wear under my sweat pants to stop my junk from waving around when I run, kick, etc?", "Merchandise &amp; Memorabilia [2018-10-27]", "Daily Discussion [2018-10-28]", "BBC confirm that Vichai Srivaddhanaprabha was in the helicopter when it came down", "BREAKING: The Leicester City helicopter just crashed in the club car park...no other news", "Sky News on Twitter: BREAKING: Leicester City owner Vichai Srivaddhanaprabha was on board the the helicopter which crashed outside the stadium. The owner's daughter, two pilots and an unidentified fifth person were also on board.", "Empoli 1-2 Juventus - Ronaldo 70'", "Gary Lineker: \"That was the most difficult @BBCMOTD I’ve ever hosted. Thoughts are with everyone at Leicester City. A terrible tragedy. Heartbreaking.\"", "Diego Costa has now gone without a goal for 17 consecutive league games", "Vichai Srivaddhanaprabha is the man who allowed Leicester to dream... and gave hope to every other club that anything is possible", "SKY SPORTS: Srivaddhanaprabha confirmed on the aircraft, also on board was his daughter and two pilots.", "Leicester City owner's helicopter crashes outside King Power Stadium", "Iago Aspas' daughter was born yesterday. He slept at the hospital overnight. Scored a hat trick today at Balaidos.", "Leicester City helicopter crash: 'I have seen staff in tears' - eyewitness reports", "In the process of tweeting a selfie to celebrate his debut as club captain, Paulo Dybala reveals Allegri's tactics for the Empoli match", "Watford 2-0 Huddersfield: Deufoleu", "Juventus look to sign Man City talent Phil Foden on a free transfer.", "[NSFW] Amartey horrific left leg injury", "Liverpool [3]-1 Cardiff - Shaqiri 84'", "Sky Sources: @LCFC vice-chairman Aiyawatt Srivaddhanaprabha and Director of Football Jon Rudkin were not on board helicopter at time of crash.", "Liverpool [4]-1 Cardiff - Sadio Mané 87'", "Danny Welbeck has scored more goals than Romelu Lukaku this season, despite Lukaku playing over 800 minutes more.", "Elderly Brighton fan dies at Premier League match", "Kasper Schmeichel drops Michail Antonio with a risky nutmeg", "According to Nice Matin, Claude Puel wasn't inside the helicopter that crashed last night", "Valverde: \"The Clasico existed before Messi and Ronaldo. There were pigs' heads flying, there was tension. The Clasico is always the Clasico\".", "Glenn Hoddle \"responding well\" after heart attack", "Pep Guardiola on Cristiano Ronaldo: ”With or without Ronaldo, Real Madrid are a top team, but they’ve lost a lot, 50 or 60 goals.He’s an incredible player, not only for his goals but also his assists at important moments. He’s irreplaceable.”", "The last day of the MLS season is tomorrow, and here's what the teams are playing for.", "Watford 1-0 Huddersfield - Roberto Pereyra 10'", "Jose Mourinho takes latest swipe at Manchester United hierarchy over lack of transfer activity: “I think that’s a fantastic answer and a fantastic statement. So they [Juventus] won seven in a row, but they bought Cristiano and Bonucci and Can and Cancelo, so they always want more and more and more.\"", "Liverpool 2-0 Cardiff - Mane 66'", "Liverpool 1-0 Cardiff - Salah 10'", "Celta Vigo 2-0 Eibar - Iago Aspas lob 36'", "The women's game between Leicester City and Manchester United due to be played today has been postponed due to the helicopter crash.", "Arsenal head of football Raul Sanllehi says club will no longer allow key players' contracts to enter final year", "Iniesta: 'I miss my teammates and the fans in Camp Nou' | interview with La Vanguardia", "Dortmund 1-0 Hertha - Jadon Sancho 27'", "Gini Wijnaldum completed more than twice as many passes (69) as the whole Cardiff team (34) in the first half. One player completed no passes, three others one.", "AC Milan have called up Andrea Conti for the game vs Sampdoria. This comes after almost 14 months on the sidelines and 2 ACL surgeries.", "Dortmund [2]-1 Hertha - Jadon Sancho 61'", "Leeds United [1]-1 Nottingham Forest: Roofe", "Empoli 1-[1] Juventus - Cristiano Ronaldo penalty 54' (+ call)", "Atlético Madrid 2-0 Real Sociedad - Filipe Luis 61'", "Helsingborgs IF have been promoted back to Allsvenskan!", "Amazing banner(s) at De Graafschap - Excelsior yesterday [x-post /r/eredivisie]", "Fans are laying flowers outside the King Power Stadium this morning after the Leicester City owner's helicopter crashed yesterday evening. 🦊🙏", "Arturo Vidal: With VAR, Real Madrid would have two less Champions leagues.", "Mark Noble Red Card Vs Leicester 38'", "Juventus have won 28 points in their opening 10 Serie A games this season (W9 D1 L0) - their joint-best start to season after 10 games (also in 2012-13). Including Champions League it's their best start ever.", "Jorge Jesus gets taken down by player, does a back roll, slaps the player's head and fails to slap his butt", "Jadon Sancho has now been directly involved in 10 goals in the Bundesliga this season, more than any other Dortmund player.", "Leeds will hold a minute’s applause on the 64th minute against Nottingham Forest for Edna Newton who was the clubs oldest and longest standing supporter, she was a season ticket holder for 64 consecutive years.", "Liverpool with a goal for every 205 passes, Cardiff with a goal for every 205 passes. An entertaining draw at Anfield.", "Leicester [1]-1 West Ham- Ndidi 89'", "Glenn Hoddle taken to hospital 'seriously ill' today, on his 61st birthday", "Alexandre Pato's brilliant hat-trick vs Guangzhou R&amp;F", "Fallon d'Floor nominee: Josh Murphy (Cardiff City)", "Mainz 0-1 Bayern - Leon Goretzka 39'", "Alan McInally on Wilifried Zaha needing protection from officials: \"If you were the manager of any team in the world and you were playing Barcelona would you target Messi? I don't once remember him giving it 'I need protection'. Do me a favour. Seriously, do me a favour.\"", "Gattuso: \"I'm not dead and I won't give up. I want to see 23 rabid dogs against Sampdoria, I want to see 23 Cutrone's on the pitch. For these guys I would go through hell, not just put my hand on fire.\"", "How is this possible? Brazilian teams always win their group and then either win the Libertadores or don't, while Argentinian teams go through hell and high water in the group stage before destroying everyone in the knockout rounds.", "Fabregas on if he would go back to Arsenal: \"Of course, #Arsenal will always be in my heart &amp; I will never forget them so why not return? You never know\"", "Peñarol wins the 2018 Uruguayan Clausura", "FC Groningen goalkeeper Sergio Padt has played 9990 consecutive minutes in the Eredivisie. He is expected to break the 10000 minutes milestone tonight against PSV", "Cristiano Ronaldo before el Clasico: \"I have a lot of respect for Barcelona, but Real Madrid is in my heart. So I hope Madrid is happy in today's match\"", "Brighton 1-0 Wolves: Glenn Murray", "Post Match Thread: Liverpool 4-1 Cardiff", "26 - Liverpool have won 26 points in their opening 10 Premier League games this season (W8 D2 L0) - their joint-best start to a Premier League season after 10 games (also 26 in 2008-09). Threat.", "Celta Vigo 1-0 Eibar - Iago Aspas 5'", "Ajax-Feyenoord Promovideo - The Match That Taught Me Everything, starring Donny van de Beek", "Mainz 1-[2] Bayern - Thiago Alcantara 62'", "Post-Match Thread: Belenenses SAD 2-0 SL Benfica [Primeira Liga]", "Chindia Târgovişte [2]-0 Sportul Snagov (Amazing rabona assist in Romanian 2nd league)", "Post-Match Thread: Empoli 1 - 2 Juventus", "Dortmund 2-[2] Hertha - Salomon Kalou penalty 90'+1'", "Empoli 1-0 Juventus - Caputo 28'", "PSV Eindhoven have won all their opening 10 Eredivisie games this season - their best start to season after 10 games ever (38:4 goal difference). PSV was one goal away from equaling Ajax Eredivisie record (30pts, 38:3).", "Nice gesture from RC Lens players, wearing \"Supporters, not criminals\" shirts during their pre-match warm up, in solidarity with their supporters. Lens fans have been banned from traveling to Le Havre.", "Liverpool 2-[1] Cardiff - Callum Paterson 77'", "Angers 0-2 Lyon - Memphis Depay 87'", "Groningen 1-[2] PSV - Denzel Dumfries 86'", "Valencia have now drawn 8 out of their first 10 games this season", "Dortmund 1-[1] Hertha - Salomon Kalou 41'", "Glenn Murray has now scored 100 goals for Brighton", "VAR disallows Western Sydney Wanderers Goal + Wanderers coach sees red", "Jose meets the Wild Boars ❤🙏 It’s a pleasure to welcome the young Thai footballers who were rescued from a cave earlier this year. #MUFC", "Remember the beer Matteo Politano catched in PSV-Inter? UEFA has just fined PSV €15.000 for it.", "Glenn Hoddle: Ex-England manager 'responding well' after being taken seriously ill", "Celta Vigo 4-0 Eibar - Iago Aspas 82' (Hat-trick)", "Atlético Madrid 1-0 Real Sociedad - Diego Godin 45'", "Cristian Ferreira BANGER 56 ' - River Plate 1-0 Aldosivi - Superliga Argentina", "De Graafschap player Furdjel Narsingh gets called to do post match interviews whilst he was showering and does them with a towel on.", "Rui Patrício didn't receive €5M signing bonus so Sporting could be paid for his transfer to Wolves", "Mohamed Salah (1 goal &amp; 2 assists v Cardiff) now has 50 PL goal involvements since joining @LFC in July 2017, 12 more than any other player in that time. Salah has 37 goals &amp; 13 assists. Next comes Harry Kane with 38 involvements (35/3)", "Leicester 0-1 West Ham - Fabian Balbuena 30'", "Wolves' run of naming an unchanged starting XI is over as Adama Traore replaces Diogo Jota for their game against Brighton", "Mark Bosnich rants about state of VAR in A-League", "Post-Match thread: Leicester 1-1 West Ham", "Bautheac absolutely pantsed Doyle (Brisbane Roar vs Wellington Phoenix, A-League)", "Sunderland [2] - 0 Southend - Chris Maguire absolute worldie", "Union SG [3]-2 Tubize - acrobatic finish by Tau 94'"], "Entertainment": ["Dale from Seether and Jeff from STP. Ask us anything.", "I am Draco Rosa, my new album, Monte Sagrado, is out tomorrow. Ask me anything.", "50 Cent reportedly buys 200 front-row tickets to a Ja Rule gig 'so they can be empty'", "Dio - Holy Diver [Heavy Metal]", "A Tribe Called Quest - Electric Relaxation [Hip-Hop]", "Danny Flam - Vihi Noam [World Cornet &amp; Trombone]", "The Cure - A Forest * first ever TV performance Dec 79 [PoP]", "Gojira - The axe [Metal]", "Glenn Miller - Moonlight Serenade [Jazz]", "[PSA] If you still BUY your music (vinyl, CD or tape), you really need to start stopping by the thrift stores in your area", "Crossfade - Cold [Rock]", "The Cure - In Between Days [Alternative rock] (1985)", "The Marcus King Band - Rita Is Gone [Blues]", "Fountains of Wayne - Stacy's Mom [Alt Rock]", "Judas Priest - You've Got Another Thing Coming [Metal]", "America - Ventura Highway [Folk Rock/Soft Rock]", "GUITARIST TODD YOUTH (DANZIG, MURPHY’S LAW) DIES AT 47", "White Town - Your Woman [Trip Hop]", "Bruce Springsteen - Thunder Road [Rock 'n' Roll]", "Ol' Dirty Bastard - Shimmy Shimmy Ya [Rap]", "Blue Öyster Cult - Burnin' For You [Rock]", "Ray Lamontagne - Crazy (Gnarls Barkley Cover) [Folk rock, Folk Blues]", "Sabaton - Coat of Arms [Power Metal] For Oxi day, when the Greeks refused the Fascist ultimatum in WWII; 78 years ago today.", "Geto Boys - Mind Playing Tricks On Me [Rap]", "Blockhead - The Music Scene [Instrumental hip hop]", "Eminem - Disses Everything [Rap/Parody]", "GZA feat. RZA - Liquid Swords [rap]", "悲伤 yvngsen - xx [Sad/Chill Beat]", "Thom Yorke - Suspirium [soundtrack] (live for BBC 6music) 2018", "Cyndago - Blonde Boyz [Comedy]", "Gojira - Backbone [Progressive Metal] (2005)", "Gang Starr - Mass Appeal [Hip-Hop]", "Spotify problems", "Erkin Koray - Bir Eylül Akşamı (1966) [Anatolian Rock]", "Philip Quast - \"Stars\" from \"Les Misérables\" [Musical Theatre]", "DJ Honda ft Mos Def - Travellin Man [Hip-Hop]", "I Don't Know How But They Found Me - Do It All The Time [Synth-pop]", "That Nordic Rock Band", "Brand New EP- 'Falling' (instrumental)", "Les Claypool's Duo De Twang - 'Wynonna's Big Brown Beaver' [Alternative] Live On Soundcheck", "Gojira - Explosia [Metal]", "What keyboard should I buy?", "Peter, Paul and Mary - Leavin' On A Jetplane [folk pop]", "Phish - Down with Disease [Rock]", "The Stone Poneys ft. Linda Ronstadt - Different Drum [Folk Rock]", "Tom Winter - Another Story [Acoustic Fingerstyle]", "Kurt Elling - American Tune [Jazz] (Paul Simon cover)", "The Association - Windy [Sunshine Pop]", "Lisa Hannigan - Fall [Indie Folk]", "Charles Mingus - Fables of Faubus [Jazz]", "Meet Anwen Deng: The Pianist Accepted To Julliard When She Was 6-years-old", "Tsutomu Narita - New World Order [Game Sountrack]", "YUMB - George Michael [ Jazz / Progressive ]", "Hilltop Hoods - The Hard Road Restrung [Hip-Hop]", "Did the song “Black and Yellow” by Wiz Khalifa sample this song?", "k4t0 - powerline [phonk]", "Ray LaMontagne - Trouble (Live Acoustic) [Folk rock, Folk Blues]", "Rare Fangs - Magna Carta [Lofi/HipHop]", "Lamb of God - Engage the Fear Machine [Metal]", "Is there a way to transfer all iTunes music library to a different music service?", "How to choose the right Music Producer for your Project", "Nat King Cole - Mona Lisa [Jazz]", "Carrieland - Climbing Out the Window [Psychedelic / R&amp;B]", "Sovereign - End of Me [rock]", "Ray Lamontagne - Jolene [Folk rock, Folk Blues] (2004)", "Loyle Carner - Ottolenghi Ft. Jordan Rakei [Hip Hop]", "Bob Marley &amp; The Wailers - Concrete Jungle [Reggae]", "Kraftwerk - Numbers ComputerWorld [synthpop, electro]", "Isaac Tschampl - 3 Power Chords and a Hi-hat [Instrumental Electro Rock?]", "Brandon Scott - Ain't Too Old - ft. Skippy Z [Rap] Halloween rap parody", "Nox Arcana - Evening Snowfall [neoclassical dark wave]", "Dave Van Ronk - Green, Green Rocky Road [Folk]", "Levon - Give Up Your Heart [California Country-Rock]", "Teenage 00's", "Zack Brooks - Adult In A Sense [Alt. Rock/Lofi-HipHop] Recorded over the course of 3 years, this album blends Lo-fidelity sonics with alt. rock instrumentation", "Best Beatles album?", "Diarrhea Planet - Ghost with a Boner [Alternative/Indie]", "Gunship - When You Grow Up, Your Heart Dies [Synthwave]", "Crowded House - Don't Dream It's Over [New Wave]", "Wilco - Jesus, etc. [Alt-Country]", "To all that like music", "Active Child - You Are All I See [Experimental, Ambient] A profound beauty that speaks for itself", "Streetlight Manifesto + BOTAR - We Will Fall Together [Orchestral Ska Punk]", "Various Artist - Broken Hearted Love Songs Vol .1 [Soul/R&amp;B]", "Louane - Je Vole (cover of Michel Sardou) [French Pop]", "Guilhem Desq - Omen [Classical/Rock]", "Bananarama - Cruel Summer [Alternative]", "Black Tusk - The Crash [Stoner Metal / Thrash Punk]", "Nujabes - Sea of Cloud. [Trip Hop]", "Friday Night - Waiting For You [POP]", "Mahavishnu Orchestra - You Know, You Know [Fusion Jazz]", "Karter Krueger - Men In Black [Hip-Hop]", "Sekiin'd feat. Lovell Bullock - Lé Boi [Rap]", "Eyehategod - Robitussin and Rejection [Sludge Metal]", "Christina Aguilera - Your Body (Clean Version) [Pop]", "Dusty Springfield - Spooky [Blue-eyed-soul] |Groovy song just in time for spooktober", "EURINGER - Sailor in a Life Boat [Synth-pop]", "Beenie Man - Our Grung [Dancehall]", "Thomas Mackay - ? [Electro House]", "Fatboy Slim - Praise You [Big Beat] w/ music video ft. a young Spike Jonze", "Gojira - Pray [Progressive Metal]", "Chris Cornell - Nothing Compares 2 U [Rock]", "Official Discussion: Mid90s [SPOILERS]", "Official Discussion: Johnny English Strikes Again [SPOILERS]", "Poster for Special Re-Release of John Carpenter's 'Escape From New York'", "Old promo poster for Pulp Fiction. I can’t find much information about this poster but uncle claims it was misprint. “The big mans wife” never held a gun in the movie. Anyways it’s the true treasure for a movie fan and thought this community would get a kick out of it.", "Why the hell havent I seen \"Dogma\" before?", "After mixed reviews, multiple rewrites, and hesitant actors, 'Beetlejuice' conquered its strangeness to become a cult classic", "Deep learning A.I. replaces actors faces with Nic Cage’s in famous movie scenes", "20 Years Ago, Guy Ritchie Ruled UK Cinema With British-Crime Classics 'Lock, Stock and Two Smoking Barrels' And 'Snatch'", "A Face of War (1968) inspired Francis Ford Coppola to make Apocalypse Now. It also is generally considered to be one of the greatest Vietnam War documentaries ever made. I’m begging Reddit for help in legally finding a higher quality version than this. I can’t even find a single alternative.", "25 years later, 'A Nightmare Before Christmas' director Henry Selick still regrets cutting a Tim Burton joke from the film. He also reveals he started shooting without a script", "The Shutting Down of FilmStruck and the False Promise of Streaming Classics", "Close Encounters of the 3rd Kind was the Saturday Night Movie on PBS tonight", "Mud (2012) is just fantastic!", "hollywood told brando to F off when he wanted to make a movie about Native American genocide", "Lucasfilm confirms the Boba Fett Star Wars movie is 100% dead", "Stephen King's Pet Sematary", "Did Roger Ebert predict the title of Terminator 3: Rise of the Machines in his 1994 review of Timecop?", "Upgrade", "Favorite instrumental track(s) from this year?", "\"Reverse\" - Awesome short film about a man who attempts to exit an underground car park, only something doesn’t want him to.", "First trailer for Ophelia, starring Daisy Ridley", "Has anyone seen Mulholland Dr.? If so can I get an explanation/ analysis of what it meant?", "Upset about Filmstruck closing down? Here is the contact info for some Warner PR Execs", "What movie ending perfectly fits the film before it.", "Yes! I finally found a Comedy Fantasy Animation Horror Sci Fi Thriller Action Drama Mystery TV Show!", "The Making Of “The Exorcist (1973)”: Rare Behind-the-Scenes Photos From Making Of Iconic Horror Movie", "Can we please talk about Charlie Cox?", "The Magnificent Ambersons by Orson Welles - cutting continuity of the original 132 min cut, reconstruction and soundtrack in one place - and more", "Something about the movie Brick which just really stuck with me [Spoilers]", "The Gay Nightmare", "13 sins - Plot Summary", "Idris Elba, Tilda Swinton to Star in George Miller's Epic Love Story 'Three Thousand Years of Longing'", "A Horror Movie", "Me, Earl and the dying girl interpretation.", "the smile you received on set was equivalent to your salary", "Teaser trailer for the Indonesian sci-fi action film 'Foxtrot Six'", "What is this movie?", "Are there any movies where the ending seems ambiguous, but actually isn't?", "Lady Gaga's Friend In \"A Star Is Born\" - Uncanny Resemblance to Cult-Classic Actor", "Johnny Depp to Play War Photographer W. Eugene Smith in 'Minamata'", "A second viewing of \"Coherence\" has just blown my mind, and then subsequent reading has blown my mind even further [Spoilers after a certain point in my post, clearly marked]", "Netflix lost $39 million sacking Kevin Spacey and scrapping his last movie 'Gore'", "From American Werewolf, to Braindead, Evil Dead II and Gremlins, horror comedies use juxtaposition to create contradictory responses.", "The original 13 Ghost (1960)", "Dogman | Movie Review &amp; Analysis (Italy's official oscar submission for best foreign language)", "Now That The Hype Is Over, Let's Discuss Black Panther...", "A better way Universal could have kick started the Dark Universe with the Mummy (2017)", "A Bit About Love (2018) 18+| Psychological Horror Short Film | Немного о Любви ( Ужасы)", "[serious] Updates on The Man Who Killed Don Quixote?", "Foreign movie night: Errementari", "Anybody know of any good screen test footage for released films? Or, pitch reels?", "Ophelia - British Film Festival 2018 Trailer (Daisy Ridley)", "Review: Air Strike (2018) - Latest in the \"Bruce Willis Phones In His Performance\" Mega-series", "Review: The Guilty - \"... so taut you almost forget to breathe\"", "Behind the scenes of Martyrs (2008)", "Movie Suggestion!", "What are the smartest decisions made by characters in film?", "Katherine Langford Joins ‘Avengers 4’", "Can we talk about Anomalisa?", "Evolution Of Michael Myers 1978-2018 (Animated)", "John Carpenter - Director’s Cut", "Tokyo Fest Celebrates Godzilla's 64th Birthday, With No Retirement in Sight", "The Library of Congress Lets You Stream Hundreds of Free Films", "Just before his death, Roger Ebert loved and gave the film 'At Any Price' starring Dennis Quaid &amp; Zac Efron 4/4. Stating it was Quaid's and Efron's best performance of a lifetime. At the end of his review, Roger called out an ignorant British critic for not understanding the film at all.", "Homage to Blade Runner (Video OC / Music: Vangelis)", "Mark Kermode reviews Hunter Killer.", "The Unofficial Discussion for Beautiful Boy (cuz no one else is doing it)", "Demolition Man is a brilliant political satire that explains American politics in a nutshell [Spoilers]", "What other movies have a one sided \"Boss\" fight like this?", "FilmStruck Movie Streaming Service to Shut Down November 29th", "Horror Timelines - Paranormal Activity", "[OC] We've reached 100 super-hero movies. A complete list of critical and fan reception of the genre so far.", "New Poster for Critically-Acclaimed Drama ‘The Favourite’ - Starring Emma Stone, Rachel Weisz, and Olivia Colman - Directed by Yorgos Lanthimos ('The Lobster', 'Killing Of A Sacred Deer', 'Dogtooth')", "Lessons from a Newcomer: John Krasinski", "What are some films in the last decade that weren't well received but you believe will become cult classics in the future?", "VCR Alert: Classic Muppet Movies on TV (2017/joke)", "Halloween II from 1981 is better than the new one that just came out", "Pom Klementieff Joins Adam Sandler In A24’s ‘Uncut Gems’", "Good movies to watch", "What should I know before seeing the new Halloween?", "10 movies and games, animated in the style of Sonic the Hedgehog!", "What movie is this from? This picture is from a TCM commercial that aired in March of 2016 but I have been unsuccessful in finding what film they took this clip from.", "I Made a Promo Cut of the Best Movies", "Help finding a female movie character with the name “doctor” in her title", "Movies you wouldn't think Celebrities would like", "The Three-Body Problem by Cixin Liu", "In his film \"What's Up Doc?\", Peter Bogdanovich parodied famed snobby film critic John Simon with his character, Hugh Simon.", "The Aftermath Official Trailer HD (2019)", "The Night Comes For Us, Apostle, and the Thin Line Between Action and Horror", "I finally decided to use those \"digital copy\" inserts included in blurays and it blew my mind on how easy they worked", "Mrs Doubtfire child stars and Pierce Brosnan share sweet reunion", "Poster for Special Re-Release of John Carpenter's 'They Live'", "Movies that went to theaters and you don't know why", "Curious about a twist of information that may have occurred in Sicario involving Matt with Alejandro in Day of the Soldado (Spoilers)", "Michael Myers Isn’t the Scariest Thing About Halloween 2018", "First Poster - Action/Thriller 'Cold Pursuit' | Liam Neeson, Laura Dern, Emmy Rossum, Tom Bateman", "BEST 80s HORROR MOVIE TRAILERS (1986 - 1989)", "Some alternatives to FilmStruck", "Russia movie lost?", "If I had to choose just one movie to watch tonight for Halloween Weekend, what would it be?", "Not a Shawn Mendes fan, but in his latest music video, he recreated a bunch of shots from one of my favourite films: Lost in Translation (2003)", "Excitement Level For Next Year's Fonzo?", "HBO is now requiring an \"intimacy coordinator\" on the set of it's shows to oversee sex scenes", "The Simpsons dropping Apu altogether \"to avoid the controversy\"", "This is huge: \"Apple to take a bite out of Netflix and Amazon by making its content free for device owners\"", "The Irwin family continues Steve’s ‘Crocodile Hunter’ legacy with new Animal Planet show", "Demi Lovato Is 90 Days Sober, Her Mother Says", "Robert De Niro Speaks Out After Pipe Bomb Scare: 'People Must Vote'", "When GQ met Anthony Joshua and JJ", "Johnny Depp 'dropped' from Pirates of the Caribbean franchise amid rumours of new film", "6ix9ine Avoids Prison Time in 2015 Child Sex Case", "Tekashi 6ix9ine Sentenced to 4 Years Probation.", "Jerry Seinfeld on Louis C.K., Roseanne and Tense Times in Comedy", "Suspected letter bomb sent to actor Robert De Niro", "\"The stories behind hip-hop’s most iconic images\".", "Taylor Swift Donates $15,500 to 19-Year-Old Fan Whose Mother Fell Into a Coma", "Megyn Kelly TODAY will not return, NBC News announces", "Stop Whatever You're Doing and Feast Your Eyes on Tilda Swinton's Music Video Starring ONLY Dogs", "NBC News cancels Megyn Kelly's show", "Paramount's delayed 'Heathers' reboot puts worst foot forward", "Sinead O'Connor renounces Catholicism and converts to Islam", "NBC News Declares War on Megyn Kelly", "“She Wants to Come Back”: Megyn Kelly Eyes Returning to Fox (But, still burned by their breakup, Fox doesn’t appear to want to take her back.)", "Emma Stone: The Favourite star’s ‘organs shifted’", "Google Covered Up Sexual-Misconduct Claims Against Three Top Execs", "Steve McQueen: 'TV had its moment [...] but it's just bad now.' [Interview]", "Molly Shannon joins Marlon Wayans in Netflix's 'Sextuplets' movie", "Steve McQueen Says Current Era Of Peak TV Is \"Just Bad\": \"There's So Much Money And So Little Ideas\"", "‘Legacies’ Premiere Recap: Hope Seeks Revenge Years After Klaus’ Death", "The Verve frontman Richard Ashcroft climbs over sofa, accidentally hits head during interview", "Watch Chrissy Teigen and Ellen's EP Go Through a Haunted House and Nearly Crap Themselves", "Maluma and Prince Royce Give Steamy Performance at 2018 Latin AMAs", "Megyn Kelly Says “I’m Sorry” On Air For Blackface Defense", "ICE-T ARRESTED FOR EVADING BRIDGE TOLL In Brand New Sports Car", "Leonardo DiCaprio and Martin Scorsese’s next movie has been confirmed", "Prosecutors want to use a Ryan Gosling movie as evidence in Robert Durst's murder trial", "Daddy Yankee Honors Breast Cancer Survivors at 2018 Latin AMA's", "Tom Arnold’s Assault Case Against Mark Burnett Dropped By L.A. City Attorney", "Ariana Grande reveals 'the absolute love of my life'", "Google Doodle celebrates Bambi creator Tyrus Wong's 108th birth anniversary", "#MeToo and the era of asshole white guy protagonists", "7 TOP Brands and Famous People Involved in Racial Scandals: Megyn Kelly Blackface Comments + 6 More", "‘Bohemian Rhapsody’ Plays Dirty Pool With Freddie Mercury’s Legacy", "Jennifer Garner Reportedly Dating Burger Chain CEO John Miller", "Rapper Jon James McMurray Dies After Airplane Stunt Goes Horribly Wrong", "Making The 'Vacation' Movies Was No Vacation", "XXXTentacion Admitted to Domestic Abuse in Secret Tape", "Your Google Play movies are being upgraded to 4K for free", "Sarah Silverman Says Louis C.K. Masturbated in Front of Her With Her Consent", "\" 'Judge Jerry': Jerry Springer Daytime Courtroom Show in the Works at NBCUniversal\".", "Kendall Jenner blasted over ‘afro’ hairstyle as Vogue responds to ‘cultural appropriation’ claims", "Writers Guild Launches ‘No Writing Left Behind’ Campaign", "Disney Talking ‘Pirates Of The Caribbean’ Reboot With ‘Deadpool’ Scribes Rhett Reese &amp; Paul Wernick", "Rock Legend David Crosby Shuts Down 'Hack' Ted Nugent's Hall-Of-Fame Whining", "'Friday the 13th' Reboot in the Works From LeBron James, Vertigo Entertainment", "Guillermo del Toro Directing ‘Pinocchio’ for Netflix", "Curb Your Enthusiasm Season 10 Has Started Production", "Julia Louis-Dreyfus accepts the Twain Prize: ‘Anybody would be lucky to be part of a night like this honoring someone like me’", "Hitchhiker surprised with unbelievable ride from Chris Hemsworth", "Netflix Plans to Raise $2 Billion in New Debt to Fund Content Spending", "Comic Amy Schumer backs Kaepernick, says she won't do Super Bowl ads", "Netflix will raise $2 billion to pay for more original content", "Charlie Bucket is an orphan", "‘Halloween’ carves a $77.5 million opening weekend, highest ever for horror movie with female lead", "Johnny Depp Partners with Cryptocurrency Platform", "Here's The Real Reason Why Marvel And Netflix Cancelled Luke Cage", "Selma Blair reveals that she's been diagnosed with multiple sclerosis", "George Lopez Says He's Now Trump's Kind of Guy After Hooters Incident", "'You feel like you're drowning': Why YouTube content creators are burning out", "Rihanna turns down Super Bowl halftime spot in support of Colin Kaepernick", "Netflix Cancels ‘Luke Cage’", "Jet Li turned down the Matrix sequels because he didn't want his moves to be taken by machines", "Prediction - Donald Glover will one day have one or more Oscars on his mantle", "Cosby has taken on the role of \"life coach\" to his fellow inmates while in prison, as he has reportedly been giving them advice about their respective situations", "Do We Really Need A TV Series About Batman's Butler?", "Turner Shuts Down Super Deluxe, Citing Duplication With Other WarnerMedia Units", "Netflix's 'Stay Here' Is a Cringe-Worthy Airbnb Renovation Show", "CBS’ Joe Ianniello Looks To Strengthen The Company, And Perhaps His Chances Of Making CEO Job Permanent With High-Profile Hires", "The actor who voiced Big Bird and Oscar the Grouch for nearly 50 years is saying goodbye to \"Sesame Street.\"", "After 50 Years On 'Sesame Street,' The Voice Of Big Bird And Oscar Is Retiring", "David Nevins has been named CBS’ new chief creative officer, with broad oversight of programming across CBS Television Studios, the CBS Television Network’s entertainment division, Showtime and programming for CBS All Access.", "Maisie Williams describes her last scene in Game of Thrones", "Moviepass Parent company under investigation for Fraud", "VIDEO: Comedian George Lopez Confronts Trump Supporter At Hooters", "Time for women to sexualise men says TV star Rae", "ABC moves forward with NYPD Blue sequel series about Sipowicz's son", "The Making (and Unmaking) of Paul’s Boutique", "Nicole Kidman says that being married to Tom Cruise was ‘protection’ from sexual harassment", "X-Men star Fan Bingbing seen for first time since disappearance amid tax investigation", "'Grimm' Spinoff in the Works at NBC", "Ugandan President Asked Kim Kardashian What Her Job Is During Africa Trip with Kanye West: Source", "Original Big Bird, Caroll Spinney, Leaves ‘Sesame Street’ After Nearly 50 Years", "Richard Branson honored with star on Hollywood Walk of Fame", "Disturbed singer David Draiman just realized that his chin piercings look a little silly", "First lady's office calls out T.I. for 'disgusting' video depicting Melania Trump", "'The Conners' reveals fate of matriarch Roseanne; Barr tweets response", "Lady Gaga Confirms Engagement to Christian Carino", "Netflix Is Responsible For 15% Of Global Internet Traffic", "Anna Burns Wins the Man Booker Prize for ‘Milkman’", "Tara Reid removed from flight before takeoff", "Melania spokeswoman calls for boycott of T.I. over video", "Louis CK addresses allegations on stage: “I lost $35 million in an hour”", "Comedy Film Starring Samwell Tarly Actor From Game of Thrones | ROGER", "Dystopian Short Film | Lifeline", "10 Hot Celebrities Who Grew Up Ugly", "Equalizer 2 Review: Is Denzel Washington really a Superhero?", "10+ Celebrity Wax Figures That are Unbearably Weird", "Winston Duke Repping Nigeria, Chima Anyaso And Other News", "Instagram TV (IGTV) Is Good News For All Video Content Creators", "Keanu Reeves &amp;#8211; Secretly transforming lives of cancer patients", "Top 7 En Güzel Hollywood Yıldızları - Top 7 Most Beautiful Hollywood Act...", "Jim Carrey on Bhagavad Gita", "BURNING THE AIRWAVES FROM EAST TO WEST: SEAN “HOLLYWOOD” HAMILTON", "8 Celebrities Who Went To Jail", "x Robert Wagner Opens up About His Wife Natalie Wood’s Death — \"I Blame Myself\" (EXCLUSIVE)", "Is Sylvester Stallone dead?", "Rose McGowan's Ex-Manager Dies by Suicide—and Her Family Slams McGowan and Harvey Weinstein", "Kardashian Babies See Adorable Pics Of Chicago", "I hate You, I love You - lyrics Video Song - Bindass Entertainment", "Harley Quinn and Joker scenes from Suicide Squad 2016 1080p BluRay", "Brad Goreski marries is longtime partner Gary Janetti", "Jurassic World - Fallen Kingdom Official Trailer Released", "WWE SUPERSTARS DANCING ON INDIAN SONG (FUNNY EDIT)", "Marvel Studios Avengers Infinity War Official Trailer in urdu", "CONGRATULATIONS TO ALEX FROM ALPHADESTINY! MY HOLLYWOOD TRANSFORMATION S...", "Indian gossip", "X-Men: Apocalypse Actor &amp; Actress With Family - Family Photos of X-Men: ...", "MOHANLAL'S HOLLYWOOD MOVIE", "While not as prevalent, men are also harassed &amp; made to feel powerless, Especially within #Hollywood. #harrassment", "Which Celebrities Born And Died In Bollywood On 21st September", "The New Miley :)", "Hollywood’s pay gap: is the film industry becoming more equal?", "Michael Phelps is about to race an actual great white shark", "Dunkrik Movie Review/Rating and Box office Collection Report - QuintDaily", "#Girls trip", "Rakhi Sawant Interview 2017", "Adventure full movies Great Fantasy", "Five Hollywood Celebrities Who Own Private Jets. | Bhai-Bhai", "Daily Fitness Routine of Baywatch Actor Zac Efron.", "HIGHEST EARNING HOLLYWOOD MOVIES", "Direct Download Hollywood Action Mp4 Full Tv SHow", "Logan full movie HD live on​ YouTube", "Miley Cyrus New Video For Malibu (Total Love)", "Is the New 'Wonder Woman' Trailer Enough to Make You Remember There's a New 'Wonder Woman' Movie?", "Sony makes Idris Elba and Matthew McConaughey fight just to release the Dark Tower trailer", "Kesha dresses down in a distressed T-shirt for workout", "Game of Thrones Season 7: Official Teaser #2: Sigils", "'Last Man on Earth' Imagines a Future Without Trump", "Logan Official Trailer 1 (2017) - Hugh Jackman Movie", "Keira Knightly One of the Richest Hollywood Actresses", "Alec Baldwin gets only paid $1,400, so little for his amazing Trump impression", "Brad Pitt is still Britney Spears' celebrity crush", "Famous Hollywood heroes - then n now", "Angelina Jolie has blocked Brad Pitt's number", "4 Expensive Things To Expect From The Brangelina Divorce", "Jason Bourne watch online movie", "HAPPY BIRTHDAY ARNOLD", "You won't believe how fat these 10 celebrities got!", "The Perfect Match Watch online free", "Watch online free The Angry Birds Movie", "Watch online Hollywood film Warcraft 2016", "Marauders 2016 Online Free Full Movie", "Independence Day Resurgence 2016 Watch Online Free", "The Shallows 2016 Watch online free", "Watch Online Free The Legend of Tarzan (2016)", "BANE Dark Knight Rises Leather Coat now available in our online store Eagleoutfits", "Element 2016 Film Online Free", "A Bigger Splash Online Free Full Movie", "Terrordactyl 2016 Online Free Full Movie", "Demolition Watch online free full movie", "Everybody Wants Some Watch Online Free", "Sumner Redstone Visits Paramount Lot Amid Viacom Legal Battle", "Watch online bollywood film Tamasha | HD Watch Free", "Met Gala: Beyoncé, Rihanna, &amp; More — The Sexiest &amp; Barest Looks Of All Time", "No Bad Blood Despite Comparison; Bradley Cooper Commends Jennifer Lawrence Gender Wage Gap Essay", "Victorias Secret Fashion Demonstrate 2014Bollywood", "Beth Behrs", "Kirsten Dunst", "Anna Kendrick", "Olivia Taylor Dudley", "Demi Lovato", "Kat Dennings and Beth Behrs", "Ariel Winter (dressed as Pamela Anderson)", "Natalie Dormer", "Morena Baccarin", "Bryce Dallas Howard", "Jamie Chung", "Lauren Cohan", "Alysha Grace Marko", "Selena Gomez", "Alison Brie", "Victoria Justice", "Cara Delevingne", "Elizabeth Olsen", "Chloe Moretz", "Emilia Clarke", "Margot Robbie", "Deborah Ann Woll", "Salma Hayek &amp; Susan Sarandon", "Rosario Dawson is amazing", "Kristen Bell", "Olivia Munn", "Miley Cyrus", "Jordyn Jones", "Emily Bett Rickards", "Rachel Riley", "Neha Sharma", "Isla Fisher unveiling", "Britney Spears", "Alexandra Daddario", "Alex Morgan Looking Great During the World Series", "Jessica Alba", "One more Jamie Chung", "Barbara Palvin front and back (Sports Illustrated)", "Anya Taylor-Joy", "Mackenzie Rosman", "Mila Kunis", "Missy Peregrym", "Felicity Jones", "Cara Delevingne and Selena Gomez", "Vanessa Hudgens", "Jamie Chung has been killing it", "Katherine McNamara", "Alicia Silverstone", "Pamela Anderson, 1989", "Ludivine Sagnier", "Kiernan Shipka. Looks a lot like Emma Watson", "Kaley Cuoco", "Bridget Regan", "Caity Lotz", "Ellie Goulding new IG", "Alexis Ren", "Virginia Gardner", "Brooklyn Decker", "Charlize Theron", "Ariel Winter", "Yvonne Strahovski", "Sophie Turner", "Camila Cabello", "Kate Upton wet t-shirt", "Kiernan Shipka (Sabrina) [NSFW]", "Emma Watson", "Alicia Vikander unveiling NSFW", "Ariana Grande", "Shailene Woodley NSFW", "Kate Beckinsale", "Emma Roberts", "Halsey", "Shannon Elizabeth", "Jessica Biel", "Kendall Jenner", "Ana De Armas", "Courtney Thorne Smith", "Jaime King Pokies", "Julie Benz", "Kalki Koechlin", "Katie Cassidy", "Christina Hendricks", "Eleanor Tomlinson topless in Colette (LQ cam, stabilized)", "In celebration of 100,000 subscribers, here are over 100 collages of your favorite celebs!", "Mexican actress Alejandra Guilmant", "Shailene Woodley", "Rihanna", "Kate Upton bouncy", "Madonna (1979) [NSFW]", "Àstrid Bergès-Frisbey", "Jaimie Alexander", "Hayley Atwell", "Emma Stone", "Hilary Duff", "Hailey Baldwin’s", "Jennifer Lawrence", "Scarlett Johansson", "Kate Mara", "josephine skriver waterslide", "Mandy Moore", "Demi Lovato on Halloween", "Lily Rose Depp", "Serinda Swan", "Blake Lively", "Emily Ratajkowski", "Ana de Armas", "Reese Witherspoon", "Katy Perry", "Jennifer Love Hewitt", "Nicki Minaj - Showing off her huge rack on Instagram", "Katy Perry flaunting her curves", "Tessa Thompson", "Taylor Swift", "Jojo Levesque", "Olga Kurylenko", "Rosie Huntington Whitely", "Kate Upton", "Aimee Teegarden", "Chloe Grace Moretz", "Ashley Benson", "Jaime King", "Jessica Parker Kennedy", "Who’s got the better booty, Rihanna or Gigi Hadid?", "Felicia Day", "Jennifer Lopez", "Aubrey Plaza", "Ashley Johnson", "Tori Kelly", "Alexandra Daddario pokies and ass", "alexandra daddario teasing", "Sarah Hyland"], "Technology": ["Sunday Rant/Rage (Oct 28 2018) - Your weekly complaint thread!", "[MrMobile] ASUS ROG Phone: Overkill Is Underrated", "Samsung’s Good Lock Offers the Coolest Smartphone Features &amp; Customization Nobody Talks About", "Copyright Office rules in favor of your right to repair your own phone", "The Burgeoning Android Empire: How Android Got So Big", "who's got the oldest daily driver?", "Over a thousand queue up for Huawei Mate 20 series launch in Singapore", "\"What is the [future] of smartphones after 2020? Ummm, it might be like this\"", "Mate 20 Pro - Battery Life Test", "Samsung Keyboard update with floating mode", "Nokia 7.1 review - Not your father's phone", "Isn't the HTC U12 Life the phone that /r/Android is looking for?", "Nokia 7 Plus Night sight vs HDR+ Vs Nokia cam samples", "October 2018 Android Distribution: 21.5% on Oreo, 28.2% on Nougat, Pie still (!) not here", "Google Camera with Night Sight works on Nokia 7 Plus &amp; 8", "Snapchat loses 2M more users in Q3 as shares sink to new low | TechCrunch", "Google camera port for Honor 9 lite", "Saturday APPreciation (Oct 27 2018) - Your weekly app recommendation/request thread!", "Google might be planning to remove &amp; replace Android voice unlock on all devices", "You'd think they'd at least support this absolute unit of a notch...in their own app", "Pixel 2 night sight", "Getting Youtube Ads in Google Now/Feed/Discover YT videos even though I am a Youtube Premium subber.", "Google pixel 3 night sight at universal studios horror night", "Are You Gamer Enough for the Razer Phone 2?", "Pixel 3 Night Sight vs iPhone XS Camera Comparison - This Isn't Even Fair", "Night Light gradual fade", "You can unlock the Google Pixel and Pixel 2 with your voice, but not the Pixel 3", "[Deal Alert] [US Only] Unlocked Black LG G7 is $550 at Best Buy", "OnePlus 6T dbrand skins are live, page uses press images of the device", "Huawei P20 Pro Maintains No. 1 Ranking in DxOMark Camera Score, Unbeaten By Apple iPhone XS Max", "Huawei’s new AI speaker sure looks familiar", "Samsung Still Seems Confused on Its Foldable Phone, But It’ll Run Special Android – Droid Life", "Zenfone 6 REAL Prototypes - Hands On Video &amp;amp; Pics leaked from Asus!", "LG will continue to sell phones despite major financial loss", "Download your favorite device's Stock Wallpapers (Album link in comments)", "Snapchat needs to fully roll out its new Android app to save itself - The Verge", "For the ones who missed it: The Galaxy S10+ (SM-G9750) will be equipped with a 4000mAh battery! We've also received some information about the POSSIBLE screen to body ratio: 93.4%. For more infos check out our article @AllAboutSamsung https://t.co/YdsVKngmh7", "Moto fans disappointed in the lack of a Z3 Force this year should check out the Razer Phone 2 now that it's Verizon certified", "Xiaomi Mi Mix 3 camera samples", "LPT: Download WhatsApp apk directly from their site for unsupported devices", "Mi Mix 3 Unboxing: Comes with what!?", "Huawei didn't announce Mate 20 Pro's DXOMark Score because it was too high", "Inside Samsung's Bid to Challenge Apple With 5G, Folding Phones", "Can we talk about how adding Stickers in WhatsApp redirects you to the store with the search text \"whatsapp sticker\" and how this leads to \"fake apps\"?", "[MKBHD] Reddit coming in clutch: This pink line (called VLD, Vertical Line Defect) is common in OLEDs, and typically shows up after a drop impacting the fragile bottom of the phone. Turns out about a week before this line showed up, I had a small pocket-slip drop (maybe a foot).", "Pixel 3 XL Review: Google's 3-peat [Android Police]", "Night Shot on a Full Moon Hike (Pixel 2)", "What software features from previous Android versions do you miss?", "The 'slap Nova Launcher on top' argument is flawed [opinion]", "Xiaomi Mi 8 and Mi Mix 2S to get camera uprgades, taking performance closer to Mix 3", "Anker announces Nebula Capsule II projector, running Android TV", "How Google Protected Andy Rubin, the ‘Father of Android’", "[MrMobile] Google Pixel 3 Review: Tough Call", "12GB of RAM on the Samsung Galaxy S10? Not so fast", "The Verge - Google’s Night Sight for Pixel phones will amaze you", "Google Camera Port Compatibility Spreadsheet", "5G Samsung Galaxy S10 Model To Sport 12GB RAM: Leak", "Nokia starts manufacturing 5G network in India plant", "Huawei mate 20 pro review: \"A top-tier phone for a top-tier price\"", "Testing Night shot on a Pixel 2 in near pitch black", "Google Phone 25 preps dark theme that syncs w/ Contacts, sharing blocked numbers [APK Insight]", "Google Photos Live Albums are limited to 10,000 photos, won't add more after that", "Anyone else seen auto playing videos in their Google app news feed? First time this morning.", "Google may be launching a subscription service called \"Play Pass\"", "OnLeaks: \"According to my sources, Black, Grey, Blue, Red, Green and Yellow have been locked as final #GalaxyS10 color options...\" [iPhone XR effect?]", "Discontinuing support for Android Nearby Notifications", "Phone manufacturers outright lying about screen-to-body ratio", "WhatsApp adds support for stickers", "Going to miss Google Inbox? Inboxit lets you share content to your email!", "Samsung Galaxy Note9 Software Update - October 1, 2019 Security Patch", "Why Google Is Willing to Pay Apple $12 Billion Per Year", "Initial XZ3 and Ear Duo impression plus AMAA (Ask Me Almost Anything).", "Pixel 3 smoothness", "Xiaomi Mi Mix 3 announced: Slider design, four cameras, no notch", "Samsung sues its own brand ambassador for using an iPhone X on TV", "AGM X3 - a rugged phone with SD845 and 8GB RAM", "What anticipated phone wound up being the biggest disappointment or flop in the history of Android phones?", "Razer Phone 2 - Can Razer Survive a Razor? | JerryRigEverything test", "would you care about an android device, not a phone but more like a mini tablet, entirely dedicated to gaming?", "PSA: Games are attempting to get weekly subscriptions from users on startup", "Xiaomi Mi MIX 3: Excellent all-rounder - DxOMark", "Xiaomi Mi Mix 3 Unboxing + Hands-On: The Slider Is Back", "3rd Party Ad Company Caught Doing Fraud On Google Play Store That Affected 125 Apps", "Apk are starting to become more common", "Facebook, Google Hit With Lawsuits for 'Secret' Location Tracking", "Google mandates two years of security updates for popular phones in new Android contract - The Verge", "Phone innovation seems largely dead.", "Watchmaker Orient wants Galaxy smartwatch sales banned", "Night Shot on og pixel", "Pine64 is Working on a Linux Smartphone Running KDE Plasma", "Honor 8x Review: Style Meets Substance", "[MKBHD] I’m not about to make an entire video, but RIP this Pixel 3 XL. My screen just got this permanent pink line of dead pixels down the middle out of nowhere. Wtf", "I really hope that Google keeps opening up the Assistant to third-party services", "Xiaomi Mi Mix 3 - Teardown", "Panorama with the Pixel 3 camera apk is phenomenal!", "What should I buy Thursday (Oct 25 2018) - Your weekly device inquiry thread!", "Google is censoring Pixel 3 bug search results", "OnePlus 6T full specs leak days ahead of the announcement", "Apple: the second-best tech company in the world", "\"Today is a dark day for Android flagship phones: iPhone XR wipes the floor with Galaxy Note 9 in benchmarks.\" - does it matter?", "Samsung fined $5.7 million for slowing down phones through updates", "Daily Tech Support Thread [October 27]", "Wallpaper Wednesday [October 24]", "Anyone else disappointed the “smallest” phone Apple makes is now had a 5.8” screen?", "[Self Promotion Saturday] I just released version 1.3 of my Reddit app Apollo! The main focus of the update is (finally) notifications! Bunch of other goodies as well, details inside!", "24 hours with the XR, I really miss 3D Touch.", "You just won a USD $10,000 Apple Store Gift Card, what will you get and and why?", "It looks like we'll be able to enable a Portrait mode for non-people on iPhone XR", "I used my iPhone XR for the past day. Here’s my thoughts on it.", "Waking by tap-to-wake and then holding should unlock via FaceID without having to swipe up.", "Wife got XR yesterday. Thoughts from using the X for a year.", "how many stores have you visited?", "Share your Apple Watch Complications Layout.", "Sharing Running List of Apps that supports Siri Shortcuts", "Sources say Apple did not invite Bloomberg to its fall product event as retribution for its story about an alleged China hack", "TIL you can add another person to FaceID now", "Has anyone found an iPad note taking app that neatens up handwriting?", "I had a look at the XR range at Apple today!", "Apple's iPad Pro might get a redesign inspired by the old, boxier iPhone 5", "I have a new app out! Me and my roommate had a movie list in the Notes app, and when we were done watching one we would rate it with emojis. Well an easier way to rate things is with stars! So I made an app that you can rate things in like movies, restaurants, etc.", "What’s the dumbest info you’ve been given by AppleCare?", "Anyone else dealing with blurry text on certain apps with the XR?", "Apple Maps public transit travel now available in Switzerland, indoor maps at Zurich airport", "Change settings new finder Window in Mojave", "Apple care plus info on the apple support webpage is missing now", "What is this camera app?", "Apple Watch series 4 on Amazon", "Are iPad Pro Education Prices really only $20 off?", "Is it true that two factor authentication can't be turned off?", "TIL Using FaceID with Apple Pay, you can authenticate first before bringing the phone in front the terminal.", "I wish the Airpod Case had a battery indicator similar to how MacBooks used to", "Apple Maps on Apple Watch", "Stainless Steel vs Aluminum Apple Watch", "AppStore doesn’t show in-App purchases list anymore", "Is Apple Care helpful", "Apple Music is consistently deleting music from my playlists, rearranging the order of the music in my playlists, and adding back songs I take out. iPhone 6s", "Pixel 3 Night Sight vs iPhone XS Camera Comparison", "Why is eSIM not a software upgrade?", "Preview.app of Mojave can't display all unicode characters", "Watch the CNN interview with Tim Cook at Apple Brussels", "iPhone X user switching to XR. A few thoughts.", "I released my first iOS App to the App Store. Word of The Hour is a free app that shares one English vocabulary word every hour with its French, German, Italian, Spanish, and Hindi translation. We help users stay committed to language learning. Any feedback is welcomed! (Self-promotion Saturday)", "How to change week start day to Monday in apple health app", "My iPhone 8 is about a year old and the paint on the underside of the rear is starting to tear. Is this normal?", "The iPad Pro and Apple Pencil have completely made me paper free at work!", "Could Haptic touch replicate 3D touch with software?", "iOS treats the XR like a Plus/Max class device.", "Perspective | Five myths about Apple", "Why am I seeing green bars on all my HEIC photos when viewing, and strange patterns when opening HEIC photos in Photoshop...", "PaintCode's Ultimate Guide To iPhone Resolutions, updated for XS, XS Max, and XR", "Random Freezing/Locking Up on iPhone?", "My First Tricky But Amazing Apple Experience", "Macbook air - Why does every tech reviewer dismiss it as a bad choice?", "I propose that Apple move into the fashion industry, producing a line of women's clothing with pockets that are large enough to hold their new phones.", "Where to find high quality wallpaper for iPhone XS Max?", "Macbook Pro 2011 shutting down around 20% battery", "iFixit iPhone XR teardown", "IOS vs Windows", "Apple needs a \"Playing Near You\" feature.", "From a customer the other day: \"And you thought YOU needed a new battery!\" (See photo)", "Using the AT&amp;T Next program through the Apple Store App (with in store pick up today)...will there be a huge line to wait in?", "The new dark mode has made my MacBook 10x more appealing", "Is anyone else blown away by the screen on the Xr?", "“Steve Jobs would never do that!”", "Anybody else have the issue where the coating on the on your black Apple Watch Sport band rubs off?", "If I cancel Apple Music and rejoin in the future, will my songs still be saved or will I have to go add them all back again?", "What Apple might announce at its October 30 “special event” in Brooklyn", "Mac stopped working with 60hz monitor.", "Tracking down missing device.", "[iBooks] iPhone User Guide for iOS 12.1", "iPhone Xr issue", "Quick-thinking Apple intern uses Apple Watch as logging tool during in-flight emergency", "Is Apple going to release an update to fix the really aggressive skin smoothing on the XS and XS Max?", "Pictures of my red XR", "Apps Exposed investigated scam apps on the App Store", "Shout Out to Persistent Notifications on IOS", "I think my iTunes encryption password has just failed me...", "App store does not recognize apple ID when updating from lion to el cap?", "The aluminum frame on the XR feels a lot better than the steel frame on the XS", "Thinking on getting a iPad mini and wondering should I get the last gen or wait till the new gen?", "Apple Watch and fall detection credited with saving man in Sweden with acute back pain", "Attention iPhone X Users in iOS 12", "Guys, those of you who have iPhone, iPad, and MacBook: what do you use the iPad for?", "iPhone Xs Stolen", "Do you think we will see a feature like Night Sight on iPhone?", "Looking for good horror Mac games to play this halloween weekend? These are the best", "Latest iPod touch instead of an iPhone: good idea?", "A quick reminder to use two-factor authentication!", "[BEWARE] Apple ID scams", "Anyone have cool wallpapers for the iPhone Xr?", "Apple Pay Belgium coming soon", "Watch out (and inform your less tech-savvy family members) for phishing attacks on your AppleID.", "Apple News can you please add a “remove” or “inappropriate “ button", "Screen strengthen of the XS Max?", "iPhone 7 advice", "Adding Applecare to an Iphone bought overseas", "iCloud email hacked, any easy way to change or ditch it?", "Apple seems to have completely blocked police password cracking tool in iOS 12", "The current Apple logo in this subreddit needs to be permanent", "Are there any weather apps that have the correct temperature showing as an icon on the app image without having to open the app to check the temp?", "Switching from Andriod", "What Apple product do you prefer to watch movies on?", "New Mac Mini", "/r/Tech now has it's own Discord server!", "[Ted Talk Video] How we need to remake the internet, by Jaron Lanier", "Cult of Mac: iPhone XR boasts bigger battery than Apple’s flagship phone.", "Here's How Orlando Is Using Amazon's Facial Recognition Technology", "Elon Musk revealed that he's approved the Model Y SUV prototype for production — but it's not the upcoming Tesla vehicle he's most excited about", "PowerColor Radeon RX 590 outed as AMD's next graphics card", "Xiaomi Mi Mix 3 packs up to 10GB of RAM and a stunning 93% screen-to-body ratio", "Tesla improves regenerative braking on Model 3 through over-the-air software update", "Someone Is Impersonating Me, and Twitter Doesn’t Care", "Copyright Office Ruling Issues Sweeping Right to Repair Reforms", "Facebook secret software reveals 8.7m child abuse images on its platform", "\"Dear female founders, where are you hiding?\" an article about Female Startup Founders", "How on earth has phone technology remained the same for so long? I can still use rotary dial phones from the 50s with zero issues.", "'Twisted' fibre optic light breakthrough could make internet 100 times faster. Researchers say they have developed tiny readers that can detect information in light spirals", "AR Porn: Naughty America Releases Augmented Reality Android App. CEO touting the app as a way for consumers to make their own adult videos at home.", "YouTube CEO urges YouTube creators to protest European copyright law", "Whom should self-driving cars protect in an accident?", "Google Is Making It Easier to Control Your Search History and Privacy | Digital Trends", "Amazon cloud technology lags Oracle database: Larry Ellison", "Tech question I cant find an answer to.", "Apple and Samsung fined over slow phones", "Announcing Camelot, a Python Library to Extract Tabular Data from PDFs - Opensource", "Finnish Blood Testing Startup Is Going Beyond The Theranos Dream", "Oracle acquires DataFox, a developer of ‘predictive intelligence as a service’ across millions of company records", "Bloomberg: The Dirt on Clean Electric Cars. New research shows some drivers might spew out less CO2 with a diesel engine.", "ASUS Z390 Motherboards Automatically Push Software into Your Windows Installation", "More and more teens are going to Instagram over its main rival Snapchat: Study", "The latest Xprize winner harvests drinking water from the air", "Qualcomm cuts 5G millimeter wave antenna size by 25% ahead of 2019 debut", "US self-driving school bus test halted", "Free Thoughts: Emerging Tech (with Matthew Feeney)", "Amazon-funded startup debuts augmented reality smart glasses. The glasses have a custom version of Alexa to call you an Uber, browse headlines, or control your smart home devices.", "Seattle startup vets take on Google with Helm, a new $499 personal email server", "The Future of the Cloud Depends on Magnetic Tape", "GitHub.com freezes up as techies race to fix dead data storage gear", "1000s of Swedes Getting Microchipped", "Qualcomm Introduces New Chipsets for 60-Gigahertz Wi-Fi", "Intel kills off the 10nm process", "Google apologizes for YouTube TV outage, offers free week of credit", "Will Compression Be Machine Learning’s Killer App?", "Google’s secret kite project is on the verge of launching", "This CEO is paying 600,000 strangers to help him build human-powered AI that's 'whole orders of magnitude better than '", "Dubbed \"NewSpace\", an increasing number of entrepreneurs are joining in the race to create cheap, commercialised space travel.", "Hi-tech glasses offer alternative to bifocals", "Is Magic Leap's Virtual Assistant Too Lifelike? It smiles, makes eye contact and even yawns, making the interactions even more convincing", "Who here would pay for \"Tech Support For The Technically Inclined?\"", "Macy's Inc. partnered with an Ohio company on what they are calling the largest VR rollout. Customers can use a VR helmet to browse &amp; see a much larger assortment of furniture. They also have an AR app allowing customers to use their smartphones to see what furniture looks like in their homes.", "190 universities just launched 600 free online courses. Here’s the full list.", "Sites like ThinkGeek to get updates on quirky tech products?", "Virgin CEO Richard Branson announces ‘Virgin Fest’, a multi-experiential music festival centered on innovation and new technology", "DJI's Phantom 4 gets a dorky haircut and a real job", "A guide for protecting data privacy in schools", "A robot named Pepper presented evidence about AI to a British Parliament committee. Pepper spoke to the Members of Parliament about the future of AI in caregiving for the elderly.", "If the phones first have come out with retractable camera then the notch would be a great solution", "Google Pixel 3 and 3 XL review: the best camera gets a better phone", "Insurer Anthem will pay record $16M for massive data breach", "Huawei's latest phone is bigger than an iPad mini", "Huawei’s Porsche phone is back and still unnecessarily expensive", "Mouse Underlaying: New keylogger technique", "Google will stop bundling its apps on Android phones in response to EU fine", "Microsoft just confirmed that there will be no native Linux client for Microsoft Teams", "Thoughts on Modular phones?", "Court approves Elon Musk’s securities fraud settlement with the SEC", "Analogue’s Mega Sg is a sleek, high-end Sega Genesis", "Boston Dynamics 'parkour' robot took more than 20 attempts to nail it", "Prosthetic Skin to Sense Wind, Rain, and Ants. A new tactile sensor could enable people with prostheses to feel subtle touch. The sensor converts pressure from touch to electric signals that, theoretically, could be perceived by the brain.", "“Do Not Track” the Privacy Tool Used by Millions of People, Doesn’t Do Anything - A good summary of the history of \"Do Not Track\".", "Driverless taxis launched in Dubai. It is equipped with cameras and sensors that fully view traffic and road conditions, control the vehicle and avoid collision.", "Did Uber Steal Google’s Intellectual Property?", "This speculative SpaceX timeline reveals roughly when, where, and how Elon Musk plans to colonize Mars", "Tesla aims for new neural net computer in production in 6 months, results in 500-2000% increase in ops/sec, says Elon Musk", "TSA lays out plans to use facial recognition for domestic flights", "So Google is now claiming: \"no one (including Google) can access your data\"", "Government Wants to Identify Criminals From Their Skin Cells", "Amazon announces developers can start selling what it calls \"consumables,\" or premium content contained within skills.", "Check out the terrifying robot snake built by Kyoto University scientists", "These students are on a quest to build the perfect robot horse!", "How Helsinki Arrived at the Future of Urban Travel First", "Will the company behind the Bloodhound 1,000 mph rocket car shut down?", "SpaceX’s next step towards airplane-like Falcon 9 reusability expected in 2018", "Stephen Hawking’s Last Paper Is Now Online", "Blockchain for Dummies", "What are brands or retailers doing to create an INTERACTIVE immersive retail experience?", "Internet Relay Chat turns 30—and we remember how it changed our lives", "At 10 trillion frames per second, this camera captures light in slow motion", "Newest Android Pie update is running on less than 0.1% of Android phones 😬", "9to5Mac: iPhone XS Max battery life crushed by Samsung Note 9 Galaxy in test.", "Pro-privacy search engine DuckDuckGo hits 30M daily searches, up 50% in a year", "Microsoft's upcoming HoloLens may have leaked", "CNET: Samsung says its foldable phone will be a tablet you can put in your pocket.", "Instagram prototypes handing your location history to Facebook: \"GPS coordinates collected even when you're not using the app\" (xpost r/UnfolloMe)", "Is it just me, or are phone manufacturers taking the multiple camera thing too far?", "EU Internet Censorship Will Censor the Whole World's Internet", "Amazon scraps secret AI recruiting tool that showed bias against women", "Facebook launches 'Came Out' life event feature to celebrate National Coming Out Day", "The Verge: Samsung hopes these four cameras will save its mid-range phone lineup.", "Three Tech Trends Helping Driverless Cars | Automobile Magazine", "Uber Freight’s app for truck drivers is getting an upgrade", "How Reddit's r/funny mods weed out meme-slinging Russian trolls", "Dealmaster: Buy a Google Pixel 3, get $800 off a second in credits.", "MarketWatch: Apple streaming-TV service to be free for device users: report.", "Firefox, Chrome and the Future of Trustworthy Extensions", "This drawing.", "This week in Usability &amp; Productivity, part 42 – Adventures in Linux and KDE", "I made a Chinese Handwriting IME where you can utilize your laptop's touchpad.", "Can't we just get along and work together like this homemade render farm?", "Quick Benchmarks Of Mozilla Firefox With WebRender Beta vs. Chrome", "Laniakea is a software suite to manage Debian derivatives", "was BorgBackup designed for system backups or just personal data backups?", "[rant] USB devices shouldn't be named /dev/sdX", "GNEWSENCE for desktop use?", "How to save customizations when reinstalling linux", "Systemd is bad parsing and should feel bad", "What distros does Linus Torvalds use?", "\"Awesome FLOSS Mobile\" - An awesome list documenting FLOSS projects for mobile devices. Everything from Linux/Android Apps and OS's to Hardware Projects and Android Phones.", "Richard Stallman: Talking to the Mailman. An interview by Rob Lucas", "Canonical Releases Statistics Showing Adoption of Snap Packages", "Rediscovered this sealed gem hidden away at my parents house", "LibreSignage v0.2.0 released (x-post r/selfhosted)", "I have a 2018 Razer Blade 15 Laptop and my internet is horribly slow.", "In Full Sail | Solus", "Bored...", "Ratio of your data that only exists in backups (not on \"live\" systems)", "How has Linux improved over the years?", "Question about terminal command - I'm happy to pay $5 to the first person who helps me successfully", "The D in Systemd stands for 'Dammmmit!' A nasty DHCPv6 packet can pwn a vulnerable Linux box", "Some Linux Commands \"Cheat-sheet\"", "Install Google Chrome(Stable Version) on Linux Ubuntu Unity 18.04.1 LTS", "Randomly generated sudoers files in the file system with the name q?", "Trivial Bug in X.Org Gives Root Permission on Linux and BSD Systems", "Remux MKV to MP4 with AAC on Ubuntu", "systemd-swap : dynamically manage zswap, zram, and swap files", "Brazilian voting machine runs.... guess what?", "Distribution Release: PrimTux 4", "Can I install Gentoo inside Arch with my /boot partition in the Arch partition", "Trying to dual boot on my Macbook; boots to black screen", "[RANT] Really wish Linux can repair NTFS drive partition and defrag them", "This two-year-old X.org give-me-root hole is so trivial to exploit, you can fit it in a single tweet", "Pittsburgh shooter Robert Bowers's LinuxQuestions.org account.", "Will Morrocan computers know the correct time tomorrow ?", "Whats so special with MATE desktop environment", "[Note] Learning KVM - implement your own Linux kernel", "Found this above a trash can at my University", "Wholly cow, the communitheme on Ubuntu 18.04 is Awesome!", "How many of y'all are running linux on a Mac?", "Anyone mostly work primarily with Linux, but primarily as a VM under windows?", "Can't switch distributions", "The Next Chapter: From the Endpoint to the Cloud - QubesOS", "How Linux allows TCP introspection The inner workings of bind and listen on Linux.", "How effective is dwm on a widescreen monitor?", "A Beginner's Guide to the Linux Command Line", "With great power comes great responsability.", "Does Linux Documentation suck?", "Ditching Windows: 2 Weeks with Ubuntu Linux on the Dell XPS 13", "Sway – i3-compatible Wayland compositor reaches 1.0-beta.1", "X.Org security advisory: Privilege escalation and file overwrite in X.Org X server 1.19 and later", "How to Create a Discord Bot on Arch Linux", "Headless file manager?", "An overview of the Vulkan graphics API (2017 talk by one of the authors from Red Hat)", "Microsoft OIN membership brings something tangible: subpixel font rendering now okay for Fedora.", "Anyone using Clear Linux?", "Transfer to Linux", "Cool! How to achieve S0ix states in Linux", "On the vagaries of init systems", "Linux seems really intolerant of bad RAM", "Now that some Microsoft software is open source has anybody of you contributed?", "Which distro(s) would you consider the hardest to master?", "Free Professional AWK, Grep, and Sed Tutorials", "Just found an abandoned gem of a distro.", "Linus Torvalds Discusses His Return To Linux Development", "8-Way Linux Distribution Benchmarks On The Intel Core i9 9900K - One Distro Wins 67% Of The Time", "SQLite: Code Of Ethics", "ELI5 MongoDB changes its License. Is Linux able to do the same thing legally?", "Leave linux for a while", "Outcome of maintainers summit discussion ...take a peek ..", "Cool Stuff: Online Linux Virtual Desktop for Learning Coding!", "Opinion: Ubuntu needs a separate rolling release distro", "KDE Bugsquad – Konsole Bug Day on October 30th, 2018", "Qt adopting Code of Conduct", "Which calculator do you use?", "The penguin comic found its home!", "CrossPlatformPowerShell - A collection of PowerShell functions that work on Windows Powershell 5.1 and PowerShell Core (Windows, Linux, and MacOS)", "Linux \"/\" root. Good to have on hands", "\"Ok, so what *is* this Wayland thing, anyway?\" (Discusses the Wayland protocol and Mir as a Wayland server implementation)", "Why was arch initially not as popular as it is lately?", "How to be an effective and professional member of the Samba user and development Community", "FontBase Is A Beautiful Font Manager For Designers With Mac, Linux And Windows Support", "Linus Torvalds interview with Swapnil Bhartiya", "Ultimate Plumber is a tool for writing Linux pipes with instant live preview", "The final straw - Moving my GF to Linux", "After getting frustrated trying to bind a custom keyboard shortcut to switch workspaces in Xubuntu I hacked together these weird scripts. Just bind a custom combo to call the scipts to move left and right in your workspaces!", "Introduction to the ELF Format (Part VI) : More Relocation tricks - r_addend execution (Part 3)", "Firefox 63.0 Release Notes", "Ubuntu 18.10 &amp; Flavours, elementary, PeerTube 1.0, Ubuntu Studio Interview, Pop!_OS, Ubuntu Touch, Sway 1.0 Beta, Turtl, LibSSH Vulnerability, Microsoft Joins OIN, and much more! | This Week in Linux 41", "Announcing Gluster 5", "Is there implementations of ecosystem ?", "Great job Dell", "Qt 5.9.7 Released", "Weekly /r/Gadgets Advice Superthread!", "/r/Gadgets VicTsing Bluetooth Speaker Winners!", "Apple reportedly announcing iPad Pro with USB-C, MacBook Air successor, and new Mac Mini next week", "New copyright exemptions let you legally repair your phone or jailbreak voice assistants", "Samsung and Google working together on dream foldable phone", "Alexa now lets you control Fire TV apps with your voice", "Garmin Vivosmart 4 review: An affordable band for easy fitness, SpO2 data", "Intel partners with Streamlabs on mini PCs built for Twitch", "[Desktops / Laptops] Lenovo Legion C730 Cube review", "Apple is preparing to kill the notch", "Dreem wants to win the fight against bad sleep with cognitive behavioral therapy programs", "Google working on clothes that can tap on your shoulder to notify you", "Smart ski helmet has walkie-talkie function and hard fall detection with automatic SOS call", "[Desktops / Laptops] HP Envy x2 review", "Apple and Samsung fined in Italy for slowing down their phones", "Xiaomi Mi Mix 3 rivals latest $1000 flagships for a stupidly low $475", "Mui is an interactive wooden panel that can control your smart home", "DRM for chargers? Google Pixel 3 locks fast Qi charging to its own $79 stand", "[Wearables] Mobvoi TicWatch C2 hands-on review", "Dell tries to make durable laptops more modern with updated Latitude rugged line", "Official Honor Magic 2 photos show notch-killing slider and psychedelic gradients", "Samsung announces breakthrough display technology to kill the notch and make screens truly bezel-free", "The Pixel 3 removes the ability to unlock your phone with your voice", "Nintendo is bringing Labo to schools across North America this year", "North Focals smart glasses hands-on preview", "Apple reportedly targeting 2019 for iPad Mini update and AirPower launch", "Leaked OnePlus 6T specs confirm bigger battery", "Oculus is ending movie rentals and purchases for the Rift", "iPhone XR review: No 2X zoom but there is nearly 12-hour battery life", "Samsung teases a reveal for its foldable, dual-screen smartphone", "Verizon temporarily unlocks all Pixel 3 phones after complaints", "Someone hacked a SNES to run Slack", "A.I. Vacuum Storage System Tells You When Leftovers Are Going Bad | Digital Trends", "Apple unveils repair pricing for iPhone XR, screen fix costs $199", "Google Home Hub review: the best digital photo frame", "Huawei Mate 20, Mate 20 Pro, and MAte 20 X: Everything You Need to Know | Digital Trends", "NYPD Pulls Thousands of Its Body Cams After One of Them Exploded", "Samsung HMD Odyssey+ Promises Clearer, More Comfortable Displays", "[Wearables] Garmin Vivosmart 4 review", "Nintendo Switch Joy-Con controllers are $25 off at Newegg", "[Computer peripherals] Samsung CHG90 Ultrawide gaming monitor review", "The Evolution of the Smartphone Notch: From Bezels to All Screen", "Simple and small, the Google Home Hub is your low-key smart screen", "Razer Phone 2 review: A 120-Hz display makes a big difference in gaming", "Electric scooters are inspiring lazy people to get creative", "Roku Premiere review: the cheapest way to 4K", "Google app suite costs as much as $40 per phone under new EU Android deal", "Magic Leap One Teardown", "Amazon Fire Kids Edition tablets are up to $40 off", "This business card-sized Japanese phone bucks the giant-phone trend", "Asus ZenBook 13 UX331UA is one of the few budget laptops with a quality display", "Intel Core i9-9900K 9th Gen Review", "Facebook TV Box with Camera Sounds Like a Privacy Nightmare", "Square launches Terminal, an all-in-one device for card and mobile payments", "[Mobile phones] Huawei Mate 20 X hands-on review", "[Home &amp; Garden] Philips Hue Lightstrip Outdoor review", "YTOM Review: YTOM Wireless Earbuds Take Music Listening to Next Level", "FYI: Drone maker DJI's 'Get it on Google Play' website button definitely does not get the app from Google Play...", "New iPad Pro 2018: All the rumors on specs, price, Apple Pencil and Oct. 30 debut", "Tiny companion phone released in Japan", "Microsoft Surface Pro 6 Teardown", "[Mobile phones] Porsche Design Huawei Mate 20 RS hands-on review", "You can now pre-order the iPhone XR", "[Desktops / Laptops] Samsung Galaxy Book 2 hands-on review", "Samsung launches Snapdragon 850-powered Windows 2-in-1", "These gloves make virtual objects tangible", "Red Hydrogen One specs leaked: 12.3-MP cams capture 4056 x 3040-pixel video", "Samsung doubles down on phone size race, may enlarge Galaxy S10 and Note 10 displays", "Sony HX99 Fits 28x Zoom Into a Camera as Light as a Smartphone", "New Thin, Light VR Gloves Provide Haptic Feedback | Digital Trends", "The new Kindle Paperwhite is finally waterproof", "JLab's Sweatproof Headphones Are Perfect For Earbud-Hating Gym Rats", "Pixel 3 XL Hands-On Review: The New Camera Phone King Has Arrived", "The new Palm is a tiny phone to keep you away from your phone", "Huawei Mate 20 Pro hands-on: a camera and spec monster - The Verge", "Tiny Palm smartphone baffles gadget fans", "Microsoft Surface Pro 6 review", "Pixel Buds translation feature comes to all Google Assistant headphones", "Casio adds modern tech to the classic G-Shock watch", "The Pyua is the proper way to enshrine and play classic Nintendo games", "GP3: The Best Camera gets a Better Phone", "/r/Gadgets VicTsing Bluetooth Speaker Giveaway!", "Why the Pixel Matters", "Google Pixel 3 Review: This Is How AI Is Done Right", "[Mobile phones] Palm (2018) hands-on review", "Microsoft reveals pink Surface laptop 2 exclusively for China", "Fitbit Charge 3 review: Peppering a fitness tracker with smartwatch powers", "The Huawei Mate 20 Pro will have a monster 4200mAh battery that charges to 70% in just 30 mins", "[Desktops / Laptops] Lenovo ThinkPad X1 Extreme review", "Samsung says its foldable phone is also a tablet that fits in your pocket", "Huawei Mate 20 Pro may bring in-screen fingerprint scanner and high screen resolution", "Samsung announces an LTE version of the Chromebook", "Amazon Echo Dot (3rd gen) review: better looks, better sound, same price", "Apple will sell a clear case for the iPhone XR", "The Igloohome Smart Padlock protects your stuff with PIN codes, Bluetooth keys", "[Computer peripherals] Panasonic RP-HD605N headphones review", "Leaked pictures of Galaxy A9 reveal Samsung really did stick four cameras on the back", "Hands-on Review - Samsung 8K QLED TV | Digital Trends", "The Razer Phone 2 is poised to be the gaming phone to beat", "Shelling Out: The Origins of Money - Essay by Nick Szabo", "Daily Discussion, October 28, 2018", "Amigos in Mexico city accept Bitcoin for cervesa!!", "Waking up and seeing the price STILL at $6400", "Bitcoin's plans for the future", "Bitcoin is not just money. It’s the invention of an Internet-native digital scarcity. And with that breakthrough, software will eat the financial world.", "Day 13...", "London Based BrewDog Bar Launches Bitcoin Cashless Payment", "Meet coco, my lightning partner at today’s LightningHackdayNYC", "Why Satoshi Nakamoto deserved a Nobel Prize", "What will quantum resistant private key and seeds look like in the near future? Is it just a larger amount of seed words and/or a longer private key?", "Net Neutrality Killer Ajit Pai Casts an Eye over Regulating Blockchain", "Bitcoin is helping in Venezuela in more than one way, Pasta for everyone! Thanks /r/Bitcoin", "More Than 11.7 Million Australians Can Buy Bitcoin Thanks to Australia’s Post Office", "Orvieto Italy", "Chinese Merchants Are Legally Able to Accept Bitcoin &amp; Cryptocurrency", "Bitcoin Farm Remembers", "Can I buy btc from otc in person?", "the longer the price stays around this level the better of we'll be (OPINION)", "How to choose A Bitcoin Wallet", "Getting Started with Bisq", "Wasn't Mycelium supposed to implement Segwit this month?", "How do I get a crypto wallet?", "How to sue Localbitcoins.com from the USA.", "Bitcoin has been consolidating on its longest streak of 2018 and other observations", "What Could Possibly Go Wrong? Crypto Miner Offers Junk Loan With 12% Coupon", "Cryptocurrency Market Update Oct 28th 2018 - Stocks Crash &amp; Bitcoin Builds", "Forget about the ETF moment. Mass adoption problem in USA and Canada.", "Stay Ahead Of Cryptojackers With This Simple Guide", "China’s Merchants are Legally Allowed to Accept Bitcoin and Crypto", "Been paying Bitpay invoices with minimal transaction fee to let them know that UTXO sucks ass. Today there is still no SegWit support from their side but they want me to drop replace-by-fee!", "One asset is shockingly stable during the market sell-off this week — bitcoin", "How to create wallet", "The #LightningHackdayNYC just started. If you couldn't make it to New York City in person to learn more about the Lightning Network, here's the livestream (link update).", "Bitcoin and Crypto: Legally Acceptable For Merchant Payments in China", "All of the Dilbert Comics on Blockchain, Bitcoin, or Cryptocurrency - Dilbert Blog", "Trying to send btc and was wondering if you needed to verify ID on Blockchain in order to do so.", "Bitcoin purchases possible directly from Czech bank", "Adoption is not here yet.", "CySEC Audits Brokers, Another Bitcoin ETF Brewing: Best of the Week", "We're trying our Wasabi, the privacy Coinjoin wallet. But need 4 more participants to start the cycle. Download it and try it out with us now!", "Why There is still Much Hope for Another Superb Bitcoin Price Rally", "What would a Bitcoin standard look like? — Saifedean Ammous (rus sub)", "Bitcoin's white paper solving the double-spend problem in the digital world makes near real-time commerce possible across the entire planet.", "\b 50 Amazing Facts About Bitcoin That Will Blow Your Mind", "BTC adoption question", "Bitcoin has been stable today. Literally.", "#LightningHackDay Live stream from NEW YORK, Building the #Bitcoin Lightning network", "Crypto is Not a Big Threat But if Needed, We Will Support it says VISA CEO", "Cryptocurrency can Gain from Fractional Reserve Banking - MasterCard Patent", "Students are Paying in Bitcoin to Study Blockchain in Paris", "The most harmful scammers are not the obvious ones like CSW. While painful and unfair, society can tolerate idiots getting duped because those idiots weren't going to contribute much of anything useful anyway. It's smart people getting duped that's the problem.", "All this fussing over Bitcoin not raising in price.. Isn't that what we all should want?", "Forget Those Bitcoin-ATMs, in Osaka You Can Buy BTC from Capsule Stations for ¥300", "The story of Wei Dai (one of the few people referenced by Satoshi in his white paper) and his ingenious idea behind b-money. The first decentralized digital currency. Pretty much a blueprint for Bitcoin. From 1998. (Oh, and he came up with Proof-of-Stake as well)", "Stuck in a time loop. Need advice.", "In the last 7 days, Bitcoin was actually stabler than the entire stock market", "Brazil: More than 800 events on Bitcoin and blockchain in 2018 - Livecoins", "Does anyone have an extra ticket to today’s lightning hack day in NYC?", "\b Waking up and seeing the price STILL at $6400", "VISA CEO on crypto: \"We want to be in the middle of every payment flow in the world\". Good luck, LOL. Bitcoin exists to eliminate middlemen.", "Planting Bitcoin — \"Season: the 2008 financial crisis\"", "Anyone has any Bitcoin Pumpkin Carving Stencils I can download?", "Why and how cryptocurrencies will shape the next generation of finance", "Letter from the present", "Is the world really waiting for a global decentralized money?", "Wasabi Wallet - Reclaim your privacy", "I &lt;3 bitcoin - spotted in Toronto", "Little help to understand a couple things", "Regulations Roundup: SEC Considers Crypto Fund Criteria, South Korea Warns Investors – TheBlockCrypto", "Developers help. PayPal substitute? Will it work in my country.", "Bitcoin Network Status Update Saturday, October 27, 2018", "Chinese Are Legally Allowed To Use and Transfer Bitcoin (BTC) - Zerocrypted", "Maybe the market is telling us BTC is more of a store of value but...", "The irony: Communist China says that it's not illegal to hold and store bitcoins while Democratic India is arresting entrepreneurs dealing in Bitcoins", "IRS Advisory Committee Requests Clearer Guidance for Crypto Tax Code", "Wonderful day at the UN with Galia Benartzi and CZ_Binance", "We need Crypto Avatar", "How Will You Cope if They Did this to Bitcoin in Your Country", "Market Analyst: Not a Bad Time to Enter Bitcoin, Although We’re “Still in a Bear Market”", "Mastercard Issues Patent to artifically increase bitcoins supply to 210 million Bitcoin's via derivates markets. Wall Street is beggining to create a fractional reserve system for Bitcoin - A system Bitcoin was meant to destroy.", "What functions are missing in existing block explorers?", "Achieving 1 Million Bitcoin Transactions per Second", "I invested during the fomo period when bitcoin was about 8k then more at 11k is it game over for ppl like me?", "The death of the cypherpunk dream - BTC 1,000,0000", "Thinking of asking to get paid in Bitcoin at my new job, what am I not considering?", "Is the recent \"stability\" of BTC prices on global markets is the \"Powers\" exerting total control?", "quinsolo.com is giving away bitcoin magnets for the 10th anniversary! More info in comments.", "Any legit bitcoin cloud mining?", "Daily Discussion, October 27, 2018", "When Ogrr.com became Kraken", "How to receive BTC and deposit into bank account", "Mastering Bitcoin 2nd Edition is now licensed CC-BY-SA, fully open for derivatives, translations and commercial re-use.", "Will the next BTC bullrun crash quickly again because of BTC's inevitably higher fees and congested transactions?", "Help with a pending transaction", "Need some help with Bitcoin Core", "What if the volatility of Bitcoin is controlled by whales?", "Mastercard Files Patent for Bitcoin Transactions on Credit Cards", "Peer-to-Peer Bitcoin Exchange Hodl Hodl Implements Multisignature Contracts", "Recessions are when billionaires are made. With a national debt of nearly $22 trillion and over 10 years of an artificially expanded economy through \"quantitative easing\", you tell me what comes next.", "Lightning Network has gone from 0 to 12,500 open channels in 9 months.", "Does this mean I have a loose heat sink? Or am I good to run? I hope it's good. First antminer iver ordered and I've been waiting weeks to run it -_-"], "Health": ["Japanese scientists isolated 17 metabolites from an endangered tropical plant species, including a novel compound that showed growth inhibitory effects against human tumor cell lines (including breast, leukemia, melanoma, ovary, prostate). 90% of rainforest plants have still not been investigated.", "Is more better? Exercise and longevity found to follow a linear relationship, rather than a U-shaped one, as was previously hypothesized.", "Air pollution is the ‘new tobacco’, warns WHO head: Simple act of breathing is killing 7 million people a year and harming billions more, but ‘a smog of complacency pervades the planet’, says Dr Tedros Adhanom", "There’s meth around that looks like Halloween candy, police warn parents", "THC is the most commonly detected intoxicant in US drivers, with around 13% of drivers testing positive for marijuana use, compared to 8% for alcohol. However, cannabis use remains detectable for much longer than alcohol, and also for long after the driver is no longer impaired.", "Are supplements safe and do they work? The story of a man who ended up needing a liver transplant after taking green tea capsules has brought the topic of dietary supplements back into the news.", "After 10 years in a wheelchair, man with multiple sclerosis receives stem cell treatment, regains ability to walk and dances in viral videos", "First novel proposed mechanism of action to treat the flu in nearly 20 years, and the only single-dose oral medicine approved by FDA to treat the flu", "People warned that cosmetic contact lenses could lead to vision loss", "AIs trained to help with sepsis treatment, fracture diagnosis", "Filthy flights: The dirtiest surface on an airplane may surprise you", "New 'Trojan horse' antibiotic promising", "Immune system fights cancer: How one boy beat leukemia with new treatment", "Exposure to nature improves well-being by expanding space perception and reducing impulsivity, finds a new study (n = 609).", "Omega-3 DHA in Phospholipid Form May Bypass Faulty Brain Transport in Alzheimer's Disease", "Sexual Harassment Remains Commonplace in Medicine - According to a survey conducted by researchers at Queen’s University in Toronto, Canada, 75% of female physicians reported patient harassment.", "CDC says polio-like disease is puzzling. These doctors disagree", "Recording of mother's voice more effective than smoke alarm, study finds. Sleeping children three times more likely to wake to voice recording than to loud beeping, research finds.", "FDA approves new, fast-acting flu pill", "People lost faith in the flu vaccine last season", "Psychedelic psilocybin therapy for depression granted Breakthrough Therapy status by FDA", "While useful in treatment of Parkinson's, deep brain stimulation found to be ineffective for treating early-onset Alzheimer's.", "You can cut your cancer risk by eating organic, a new study says", "A new large cohort epidemiology paper in JAMA Internal Medicine by French government scientists reports a 25% decrease in overall cancer risk from relatively high levels of organic food consumption, compared to little or no consumption--reduction in pesticide dietary exposure the key factor", "Families battling dementia suffer stress. Here's how they can cope, avoid family strife", "Brain-eating amoebae, which are almost always deadly, killed by silver nanoparticles coated with anti-seizure drugs while sparing human cells, finds a new study.", "Study: those who ate more organic produce, dairy, meat and other products had 25 percent fewer cancer diagnoses over all", "Could A Ban On Spanking And Other Corporal Punishments For Kids Affect Rates Of Teen Violence?", "People with healthy gums found to be 20% more likely to bring high blood pressure under control than those with gum disease.", "Kerosene and castor oil — home cures were once universal health care", "Why 4 a.m. Is the Most Productive Hour - WSJ", "Taller people have a greater risk of cancer because they are bigger and so have more cells in their bodies in which dangerous mutations can occur, new research has suggested, with a 13% increased risk for women for every additional 10cm, and an 11% predicted increase in men for every 10cm.", "Studies indicate that age-related memory loss may be slowed by up to 75% when older people promptly treating hearing loss and up to 50% by addressing vision loss.", "Change your bad mood to good having some foods which functions in proper way. The happy diet helps you move out from stress feeling and feel good. Happiness plays crucial role in everyday life. Stay happy and wealthier by Looking at the below foods to boost bad moods of every kind.", "This type of weather could increase your heart attack risk, study says", "Candida and Fake Illnesses – Science-Based Medicine", "'Spectacular' diabetes treatment could end daily insulin injections", "Johns Hopkins researchers calling for magic mushrooms as medicine", "Stress might lead to memory loss and brain shrinkage, study says", "Hundreds of health crowdfunding campaigns are for sham treatments - Millions of crowdfunded dollars are going to unsafe or ineffective therapies.", "Your Poop Is Probably Full of Plastic", "37 People in Europe Have Died of Measles This Year", "Study: Pre-existing condition protection in limbo for 102 million in U.S.", "Weight-Loss Supplements Contain Dangerous Stimulants Years After Being Prohibited", "Shoes: the truth about what we track into our homes", "Epileptic boy, seven, whose plight triggered the Government's medicinal cannabis review now attends school every day and can even ride a bike thanks to taking the oil", "Toxins found in fracking fluids and wastewater, study shows", "Knocking On Doors To Get Opioid Overdose Survivors Into Treatment", "Desperate &amp; duped? GoFundMe means big bucks for dubious care", "Monsanto liable for cancer-causing Roundup weed killer, judge rules - A US judge has denied Monsanto a new trial after finding the agrochemical company liable for its cancer-causing product.", "Microplastics in Seafood: Human Poop Reveals How Bad the Problem Has Become - Research shows that out of eight individuals from the UK, Austria, Finland, Italy, the Netherlands, Poland, Russia, and Japan, every single one had traces of microplastics in their stool.", "Recall hits millions of pounds of food from Walmart, Whole Foods, Kroger and more", "You can cut your cancer risk by eating organic, a new study says. \"Those who ate the most organic food were 25% less likely to develop cancer. Specifically, they were 73% less likely to develop non-Hodgkin lymphoma and 21% less likely to develop post-menopausal breast cancer.\"", "Drugs for Depression May Increase Dementia Risk", "6 children dead, 12 ill in adenovirus outbreak at New Jersey nursing/rehabilitation facility", "Can’t sleep? Perhaps you’re overtired - We’re used to seeing toddlers who can’t switch off at bedtime. But some experts think that our ‘always on’ lifestyles mean that many adults have the same problem", "Miscarrying at Work: The Physical Toll of Pregnancy Discrimination. Women in strenuous jobs lost their pregnancies after employers denied their requests for light duty, even ignoring doctors’ notes, an investigation by The New York Times has found.", "The Chief Public Health Officer’s Report on the State of Public Health in Canada 2018: Preventing Problematic Substance Use in Youth", "'Dr Love' egg-freezing clinic targets young women and single Asians", "Dopamine — the neurotransmitter responsible for reinforcement, motivation and learning — tied to the process of updating our beliefs about the world.", "Study suggests that people nap for 25 minutes or less, or sleep for a full cycle of 90 minutes, in order to avoid 'sleep inertia.'", "Here’s why occasional fasting can help you live longer", "The places where too many are fat and too many are thin", "Our ancestors didn’t suffer from hay fever and food allergies were extremely rare even a few decades ago. Science shows that it’s the distance from, and lack of exposure to, natural environments that is driving the allergy epidemic in modern life.", "Trump administration loosens restrictions on health reimbursement arrangements", "As Billions In Tax Dollars Flow To Private Medicaid Plans, Who’s Minding The Store? Are insurance companies — now receiving hundreds of billions in public money — earning their Medicaid checks? More than 2/3s of Medicaid recipients are enrolled in such programs", "Immunotherapy scores a first win against some breast cancers", "Report: Women Everywhere Don't Know Enough About Ovarian Cancer", "Arizona cancels vaccine program after backlash from parents who don't vaccinate", "Mad cow disease detected at farm in Britain for first time in three years - Telegraph", "42 percent of new cancer patients lose their life savings", "23andMe CEO Anne Wojcicki says ‘one of our biggest competitors’ is fake science on sites like Goop - Wojcicki on Gwyneth Paltrow: “Some of the things that she promotes don’t actually have the scientific validity that my team would be able to stand behind.”", "Expansive New Study Says Not Exercising Is Worse for Your Health Than Smoking", "Smithfield employee accused of urinating on production line", "Ebola outbreak in Congo is not yet international emergency", "Researchers are recruiting 10,000 volunteers to discover the earliest warning signs of cancer, other killers.", "Turpentine, the Fountain of Youth According to Dr. Jennifer Daniels", "Not exercising worse for your health than smoking, diabetes and heart disease", "What Does It Mean if You Fall Asleep Instantly Every Night", "Researchers question whether success of Australian HIV trial was due to prophylaxis drug or outreach within gay and bisexual community groups.", "Researchers from India and France have restored memory in mice with Alzheimer’s disease", "Brain study accidentally finds a link between Alzheimer's disease and herpes virus", "Mystery disease infects 100+ in US", "Science says fluoride in water is good for kids. So why are these towns banning it?", "Youngest children in the classroom are more likely to be diagnosed with ADHD, suggesting that some teachers are mistaking the immaturity of the youngest children in their class for ADHD and labeling normal development as pathology, finds new research with 14 million children from various countries.", "FTC Stops Deceptive Health Claims by a Stem Cell Therapy Clinic", "Arkansas's work requirement drops another 4100 from Medicaid in October", "Safe Abortions by Mail Now Ship to the U.S.", "Three-drug combination improves life for cystic fibrosis patients", "Man eats squirrel brains, gets brain disorder and dies. #kentucky", "Pathogens may evade immune response with metal-free enzyme", "Doctors in Milan successfully treat spina bifida in unborn baby", "For-profit nursing facilities found more likely to be diagnosed with more clinical signs of neglect. These facilities were consistently inferior to not-for-profit nursing homes across multiple staffing, capacity and deficiency measures.", "Entering deep sleep and then waking up before completing the normal sleep cycle can result in a phenomenon known as sleep inertia, which is associated with reduced cognitive performance linked to reduced connectivity between brain networks, finds new brain scan research in NeuroImage.", "A blue pill is stopping HIV, world-first study shows - Progress against AIDS over the past 15 years has inspired a commitment by U.N. member states to end the epidemic by 2030.", "Salmonella: CDC says raw chicken to blame for outbreak in 29 states", "Free e-book. Eating Right for a healthier life", "Time to act: air pollution is damaging our brains as well as our lungs", "Study: Childbirth most dangerous for black women", "r/Fitness MVP Program - New Additions!", "Daily Simple Questions Thread - October 28, 2018", "7 month fitness and diet progress. Finally feeling confident with myself.", "Could you theoretically run the same program forever if you are happy with your current level of strength?", "Review of Jon Andersen's Deep Water Beginner Program", "What is a basic level of fitness?", "Gym Story Saturday", "Gaining weight..", "Victory Sunday", "What are your tips and tricks on how to evolve your new exercise plan into your new lifestyle.", "531 accesories progression?", "Can I do curls with a chair instead of dumbbells?", "Alcohol and gains", "Alternating caloric intake for on vs off days while cutting?", "What exercise to best stop excessive sweating", "Is TUT (time under tension) effective?", "Have I done permanent damage to my body through obesity?", "Routine Critique (5/3/1 based)", "Question about Target Heart Rate", "The alpha Destiny programs", "When I do squats, my left leg is much more flexible than my right, and I end up feeling like I pull a muscle in my left leg", "Getting back into it", "What is your goal in fitness and health? And how is the progress going?", "Metabolic stress - is it better to evenly spread workouts for muscle groups over the week?", "I'm obese and I want to do something about it before it goes too far.", "Looking for a strength training plan", "OHP weak compared to other compounds", "Best ways to breath when running?", "Need help to regain Fitness.", "Hey guys need some advice !", "What upper body training/program can I implement for 1-2 days a week?", "Is there any significant benefit of a 7 degree smith machine over a standard smith machine?", "Full body single day routine", "earning a solid 15 bucks a week what food should i buy to gain some weight (australia)", "Having trouble cutting in college", "New job emptying containers", "I couldn’t finish my workout today, would It be ok to finish it tomorrow?", "Skinny guy", "Best bicep routine additions to gzclp. Getting gains everywhere but biceps.", "PPL vs Chest/Triceps, Back/Biceps, Shoulders/Legs", "Training delts two days in a row", "Cardio difficulty", "Not feeling tired after my workout", "Ko8 Suspension Trainer, a seemingly unknown product", "Lifters, how much cardio do you do?", "Bench Press With Or Without Arch", "High reps only to reduce fatigue, focus on aesthetics and be time efficient?", "Daily Simple Questions Thread - October 27, 2018", "Intermittent fasting yes or no?", "Stronglifts 5x5 for a cut?", "Cant lift as easily as i could a week ago.", "Lifting and running before eating in the morning a bad idea?", "Advice from friend sounds sketchy to me (18M)", "what should i do forearms with?", "Looking for a 5 day beginner weightlifting program (16M)", "Cutting and choosing a program help. (With pics)", "What is the worst case scenario if I don't get enough protein a day while cutting weight?", "Is there anything I can do to fix a fully overdeveloped asymmetrical right side of the body?", "Machine only beginner workout", "Is 5 x 5 and 4 x 6 results in similar gains?", "3-Suns Adaptive TDEE Spreadsheet", "Beginner : Full body seems too long and not efficient", "Intense volume vs extensive rest period?", "Upper body workout a few hours before soccer game?", "Does cardio lower your bmr?", "Which lift is best for widening the shoulders?", "I want to get muscular but I’m afraid of gaining weight.", "Hip hinge", "Don't wanna workout anymore after 5 mins for like 1-2 months", "Physique Phriday", "Is diary a good source of protien", "Returning to the Gym after 10 years...", "Will lat pulldowns help me do pull ups?", "I think i need some cardio but which", "Out of shape 31 year old starting a 30 minute exercise routine I really like. Is it okay to do it twice a day or is that asking to injure myself?", "Do you lean into dips (lean forward)", "Fitness beyond \"heavy\" lifting. How do you continue to improve without progressively ramping up weight?", "Self-Promotion Saturday", "Is there any way to modify the \"back extension\" exercise so that it will stop working my hamstrings so much?", "Options for Protein inclusion", "Question about fat gain when extremely underweight?", "Have you ever experienced \"false weight labels\" at the gym?", "Exercises to help with bouldering", "Quick question about plateauing on Phrak's Greyskull LP Variant Chin ups", "Supplements for intense training schedule?", "Skinny 27 y/o M looking to bulk up, brand new to fitness, did the research, just had a few questions.", "Please recommend a program to me", "Daily Simple Questions Thread - October 26, 2018", "Always hungry on my first bulk", "Slightly overweight, 2 weeks into lifting. Should I just lose weight first, then start again?", "Lifting for Cardio?", "Dancing workouts?", "Why can I dumbbell OHP more than I can bench?", "Whey protein", "How long will it take to get back lost muscle? And what's the best way to gain weight?", "All round Fitness and Health", "Macros and Fiber Subtraction", "Fact check: glutamine (Examine.com)", "RPE Style Training and Recovery", "I rarely see jacked dudes at the gym performing the Big 3. Why?", "Unexpected positive changes after beginning to workout?", "squat and feet at 45 degrees", "HealthyFood Self-Promotion Safe Zone October, 2018 - Tell us the latest news about your Healthy Food related site/blog/video/works in this post", "HealthyFood Monthly Raw Recipes Roundup October, 2018", "What are some foods that are commonly thought of as ‘healthy’ but really aren’t all that good for you?", "Favorite Healthy Dessert", "Avocado oil?", "Organic Bison, Halibut, Broccoli, Mixed Veggies, Jasmine Rice, and half an onion", "Eating dessert everyday", "What is your opinion on eating lean red meat daily combined with an active lifestyle and limited refined sugar?", "Breaking the fast! PS that’s cauli-mash in the right. Followed this up with a bowl of grains and 2 bone-in chicken thighs.", "A healthy alternative to chips.", "Quinoa/Couscous/Almonds/Avocado/Flax/Green Lentils/Spinach (*lightly* sautéed)/Basil/Tomato/Carrots/Onion/Mushrooms/Spices", "Changing my unhealthy eating lifestyle!", "Preparation chicken soup with fresh and dried mashroums, leek, onion, carrots, celery and parsley", "If I gave you a list of food, could you suggest a meal or recipe?", "Vegan rice noodles with homemade coconut cream and homemade hot sauce.", "Grilled chicken, fig goat cheese, cherry tomato, apple, and blueberry salad w/honey mustard vinaigrette (703 cal)", "Suggestions for quick healthy foods for someone with no time to cook or meal prep.", "Guys it’s 12:30am and I just ordered general tsaos chicken and fried rice on an impulse bc I’m hungry. Now the food is on the way and I regret ordering it. I spent $20 on food I don’t need and that will only take away from the progress I’ve been making.", "Neck pain despite neck pillow?", "Strawberry coconut greek yogurt, cashews, &amp; apple slices (350 cals) 😛 nice little afternoon meal", "Kale, chickpea and Parmesan stew. From Jack Bishop’s “A Year in a Vegetarian Kitchen.”", "Cauliflower cheese grill, topped w/ poached egg &amp; sesame seeds w/ roasted veg on the side", "Packing quick &amp; easy breakfast for work ;)", "Need help with easy healthy portable breakfasts for winter", "Is the risk for diabetes that high with white rice? Family history has high risk of diabetes.", "Vegetable Stir-Fry", "What's the \"best\" balanced diet?", "Acne diet!!", "This week's yogurt batch (instant pot, strained 3 hours)", "I need help, I’m out of control", "Chocolate?", "How many calories should you eat in a day?", "A horrible quality photo a food I forgot to take a photo of before I started eating it. Salmon burger patty with mixed spinach, broccoli, and carrots on the side. Yum!", "I need major help.. I have a terrible diet that I want to change, but I realized I don't even remotely know where to begin.", "Lunches for the week! Baked potato and sweet potato, beets, tomatoes, cucumbers, roasted garlic, pine nuts, mixed beans and carrots!", "Pesto kohlrabi noodles", "Salad of broccoli, tomatoes, picklrd cauliflower, bell mushrooms, red and green bell peppers, sliced almonds, and baby carrots topped with nutritional yeast", "Coconut Porridge with Chopped Spinach and Banana", "Moroccan spiced baked chicken breast, lightly charred asparagus and sambal.", "HealthyFood Item of the Week. Post recipes or information related to - Romaine Lettuce", "Grilled corn chowder", "Red lentil daal - makes 6 servings", "Lunch today! Clementines, strawberries, deli sliced salami, yogurt with no added sugars.", "Pretty Ugly: chicken apple sausage, roast Brussels sprouts, home fermented red cabbage and beet sauerkraut, homemade mustard.", "Low or no sugar baking", "Study of Rural New York State Homes Finds Pesticides in Every Sample Tested", "How to eat healthy?", "Cauliflower n’ cheese w/ chicken hotdogs", "Would you consider this ice cream \"healthy\"?", "I need help figuring out measurements for grapes.", "Green Vegetables with Shaved Beef Striploin", "Any of you guys like the KFC grilled chicken?", "StarKist admits fixing tuna prices, faces $100 million collusion fine", "NYC health department calls on food and beverage makers to cut sugar", "Fire up some chicken with Turkish spices and coconut oil. Poured in a whole jar of kimchi, and a few handfuls of kale and vegetable stock. Let simmer for a while and it was delicious!", "Ginger vs Turmeric vs Ginseng", "Beer Can Chicken (aka- also Dr. Pepper Chicken)", "EPA Abuses Emergency Pesticide Exemptions, Greenlights Unsafe Pesticide Use", "Is this healthy? Chick filla.", "Teriyaki Beef Skewers on a rice and spinach bed (Under 500 Calories)", "What's a good fruit/veg to introduce myself to?", "Apple chicken salad over baby arugula with homemade vinaigrette 😋", "Quick question... are green supplements any good and if so can you guys reccomend some good products?", "Organic, Gluten-Free, Sugar-Free, Grain-Free Cookies", "4 oz of 99% fat free ground turkey + 1 oz red lentil rotini pasta = 220 calorie meal with 33.5 grams of protein. Flavored with ~ 1/4 cup of traditional Prego sauce which only adds ~30 more calories!", "Lunch meat from the Deli vs. pre-packaged lunch meat", "Great 7 day meal plan?", "I am looking for some new recipes", "Looking for a healthier BBQ sauce!", "HealthyFood Vegetarian or Vegan Recipes You Enjoy - October, 2018", "Which are better for me: salted almonds or unsalted cashews?", "Help! Share your recipes with me", "Healthy Snack Ideas for Picky Husband", "Smoothie recipes.", "One of my favorite fall meals: Acorn squash stuffed with ground turkey, mushrooms, carrots, apple, and panko. Roasted brussels and potatoes on the side.", "Vegan Ginger cinnamon rolls with apple filling", "Miso Mushroom Pho", "HealthyFood Item of the Week. Post recipes or information related to - Raspberries", "Messy... but whole wheat toast, hummus, tomato, smoked salmon, egg, and seaweed! My favorite breakfast!", "Meal prep: Balsamic Moderna chicken, seared zucchini, spinach and ricotta tortellini, fresh greens salad with cilantro lime dressing. Plum and soft Swiss for breakfast", "My breakfast today", "Low calorie topping to pancake", "Whole wheat english muffin with scallion, tomatoes, and hummus; fresh cherries; raw nuts and dried fruit.", "Less harmful alternative to soda", "Doing Diabetes Awareness presentations at various institutions are always a good time, especially when they serve us some awesome snacks! 😁👍 #healthysnacks", "Steamed broccoli with baked kale end rice topped off with a homemade teriyaki pork belly", "Does blending salad mixes (raw spinach, kale, rocket etc) in water alter the nutrition?", "Vegan Maitaki Mushrooms layered over Baby Sweet Peppers, Resting on Sauteed Spinach cooked in Full Spectrum Hemp Avocado Oil", "Chickpeas with veggies.", "Poached eggs, roasted asparagus, various other veggies and quinoa", "Major stomach pain from avocado and quinoa.", "Ginger chicken with mushrooms and purple cauliflower.", "Is my snack healthy?", "Healthy foods for losing weight?", "What is the best overall diet for weight loss + health, wellness and nutrition. Aiming either way to do low carb and sugar. Paleo, Keri, Whole 30, South Beach, Atkins etc....", "Looking for vegan recipe developer!", "Roasted veggies and garbanzo beans over quinoa", "I love sprinkling nutritional yeast on a lot of what I eat. It adds more protein and vitamins while also adding more flavor 😍", "Veggie quesadilla. The wrap is 80 calories. I eat this for dinner every day", "Starchy Carbs make me full, protein and fat don't...", "Quick lunch ideas", "HealthyFood Ketogenic Recipes You Enjoy - October, 2018", "Welcome to /r/Nutrition - Here are the subbreddit rules, suggestions, and helpful links for mid-2018", "The /r/Nutrition Personal Nutrition Discussion Post (October 22, 2018) - All personal circumstance questions and evals pretaining to what you eat or might eat must use this post", "In your opinion, what is the least biased, most comprehensive source for learning about nutrition?", "Why do processed/presliced chicken/hams etc seem to have less calories/protein/fat than the values given for skinless chicken breast?", "Why do you eat healthy?", "Best nutrition instagrams?", "Health effects of caffeine on a non-responder?", "Zevia Hydration", "Naturally Occuring Trans Fat?", "Is it possible to overheat canned beans and if so, will they lose nutrient value?", "How bad is burnt bread for you?", "Which is worse, saturated fat or cholesterol?", "How to measure leafy greens?", "Cholesterol Question", "Is Arsenic in mineral complex drinks healthy?", "Marinated chicken calories?", "Correctly calculating cooked food nutritional info", "What kind of dietary fat raises or decreases IGF1?", "Can some explain how this white rice has 17g fiber per 100g??", "What are the latest offerings on wheat and soy-free plant protein products?", "Where to get zinc?", "What is the volume of your intestines?", "How do these tortillas only contain 50 calories?", "Science Friday: News in Nutrition (October 26, 2018) For discussion on the latest news and research in nutrition science", "How much fluid/water can you theoretically store by eating (an unlimited amount of) carbs?", "Which fruits it is ok to swallow the seeds?", "Will consuming antioxidants in natural form from healthy foods reduce inflammation and general damage from alcohol consumption later the same day? Recommendations on foods, if so?", "Does tuna has mercury on it ?", "The influence of food processing on metabolic response", "Keto - Changes in the gut microbiota are required for the anti-seizure", "What is the most efficient way to take L-Lysine to block L-Arginine absorption?", "if you drank a lot of booze all day and ate a healthy bean salad at the end of the day would you still get health benefits from it?", "Why does the difference in carbohydrates vs. protein/fat matter if you're still in a caloric deficit?", "Is there a difference between eating isolated sugar with fiber, than eating foods which contains both sugar and fiber?", "Get rid of excess salt from the body", "If I thoroughly rinse canned black beans will it get rid of most of the sodium?", "Is drinking soy milk bad for men?", "Effect of LCHF [keto] diet on LDL cholesterol and gene expression in normal-weight, young adults: A randomized controlled study [Retterstol et al., 2018]", "Calories in turkey steak per gram?", "Who do we trust about nutrition knowledge?", "Question about serving sizes and canned beans", "What is the issue with grains? Really?", "Caffeine Chocolate", "What food defy the “eat Whole Foods” rule", "Is it true you need to let chopped raw Garlic cloves sit for 10-15 minutes before eating them, so the enzymatic reaction for formation of sulfides happens (Alliin -&gt; Allicin)? Doesn't it happen instantly, within seconds?", "Front/advertising labeling requirements?", "What are some foods rich in healthy fats and vitamins but low in carbs and protein?", "Why does proteins/fibers make you feel satiated ?", "How to get your daily potassium intake?", "Best foods to balance out Cholesterol?", "How much influence does gut health have on bereavement?", "What happens to fat soluble vitamins if you're very lean?", "Just a question", "magnesium vs calcium in absorption", "How come only some of the vitamin C gets destroyed when heated, and not all of it?", "Fish oil taste question? Oxidation?", "Greens Powder", "Recommended books or Research articles discussing affects of estrogenic foods", "Are carbs and protein good for a sedentary lifestyle? What diet plan can work for them?", "Food fortification", "So about salt?", "Any clear list on what actually stimulates bile production?", "Question about Celery in Soup", "Are pharmacies looking for nutritionists?", "Kefir vs Kombucha", "Is too much tea (specifically Lipton Cold Brew) dangerous?", "GMO Peer reviewed journals", "Should you introduce milk in a healthy diet?", "Question about Herbalife", "What are the effects of eating unhealthy food on top of getting adequate micro-nutrients?", "How do you find the best nutritionist?", "Chew or swallow garlic?", "Is there anything in gluten-free oats that is not in normal oats?", "Protein classification ideas", "Whey protein - MyProtein or BulkPowder ...?", "Any decent app for counting calories alongside all nutritional information", "What fills you up?", "Green tea: does it count toward hydration for the day?", "Can ramen noodles have this little calories ?", "Good and bad proteins?", "Looking for common sources of vitamins a/e?", "CLA 1250 - Has anyone tried?", "What foods should powerlifters/spinters avoid?", "Looking for cheap sources of omega 3, 6 and 9 fats", "Zero Bars by Biotech - views?", "This frozen pizza has 6g of trans fat", "Does Cumin lower testosterone?", "What are some staples , besides the popular , go include daily in a healthy diet?", "Is butter on potatoes more healthy, less healthy, or no different than eating potatoes without butter?", "Why is there not a r/frugalnutrition?", "Is it possible to 'work off' saturated fat?", "How to best make sure daily intake requirements met?", "Nutritional value of raw cannabis?", "Best time of the day to take vitamin D supplements ?", "Keto – how long do you manage to stay on it?", "best meal/time of day to take magnesium supplement", "Why is pizza bad for you?", "Why is breakfast the most important meal of the day?", "Are the nutritional benefits of natto worth forcing myself to gag it down?", "Limits/benefits of acidic or alkaline food and drink?", "How much sugar a day is optimal how much is too much and whats too little and why? Thanks!", "Adderall &amp; Nutrient Depletion", "[Daily Directory] Find your quests for the day here! - Sunday, 28 October 2018", "[Challenge] Super Mario Fall 2018 Challenge - Week 2", "After once thinking I would be obese for the rest of my life, my BMI hit 24 today", "“I’m not into big girls.”", "I think I helped my 4-year-old learn to moderate Halloween candy", "Lost 115lbs since April (this year) 475 to 360lbs, still going. Struggling to keep up this same weight loss rate.", "Progress Pic :) 19 months", "Not ready because you are poor/stressed/undisciplined? Won't give up X? Diets that \"don't work\"? Read this.", "I got my period back.", "Apparently people notice when you're constantly declining free food at the office.", "I Am Now A \"Normal\" BMI For Literally the First Time in My Life", "Sick of being sick(33F)", "Why am I always, always ALWAYS hungry???", "Do you have issues with people lecturing you?", "30 Day Accountability Challenge - November Sign Ups", "I’m so conflicted on how to feel about my wife’s supportiveness. Or lack of. How should I approach this?", "(SV) First Time under 300lbs in Years", "Some thoughts on health, appearance, society, and the definition of obesity...", "On eating...", "On My Way (400lbs in August, Target weight 220)", "Day 1? Starting your weight loss journey on Sunday, 28 October 2018? Start here!", "Left leg amputee - looking to lose weight to help with prosthesis.", "Daily Q&amp;A Post for Sunday, 28 October 2018 - No question too small!", "30 Day Accountability Challenge - Day 27", "24-Hour Pledge - Sunday, 28 October 2018 - The Plan for Today!", "The Beginning", "First time post (I'm pretty sure?), excited about progress!", "I could use some words of encouragement now. Or let this be a tale for others in my similar situation.", "I’m 395 lbs and deathly afraid to lose weight.", "SV/NSV Feats of the Day - Sunday, 28 October 2018: Today, I conquered!", "Thoughts on my diet?", "What can I do to improve? Motivated to lose weight.", "[Challenge] European Accountability Challenge: October 28th", "Food scale with memory?", "Struggling with a family visit", "[Meta] Can we require people to post their EXACT diet in \"Why I can't lose weight?\" posts", "Losing it &amp; staying big", "Losing weight - diet v exercise", "I lost 10 kilos in 1 month during a fitness challenge - now planning to do high intense gym train for 1 month any better ideas?", "Due to stress I’ve gained 20 pounds of fat over the past year, and feel trapped", "Lots of health problems. Desperately need to lose weight. Advice?", "Had my first reward day yesterday since starting my diet 6 months ago and apparently gained 4 pounds because of it :(", "What to do to get back on the wagon?", "I did a thing today", "Pumpkin carving happy hour", "This is what rock bottom looks like.", "My tale of how I lost 100 lbs and it became addicting. Be careful.", "What do you find to be the best way to measure your own progress (besides just how you feel)?", "How do I help my mother lose weight?", "Feelings as a binge trigger", "Halfway to my goal weight! F/22/4’11” [165.2&gt;144.0=21.2] 2 months", "Rate my fat loss plan", "getting started", "Day 1? Starting your weight loss journey on Saturday, 27 October 2018? Start here!", "Losing weight while disabled - need advice.", "New gym member", "Where do I begin?", "Need some motivation and workout ideas", "Daily Q&amp;A Post for Saturday, 27 October 2018 - No question too small!", "Hit a weight loss plateau.", "Being a people pleaser has ruled my life.", "SV/NSV Feats of the Day - Saturday, 27 October 2018: Today, I conquered!", "I survived cancer, but now I’m just fat", "I officially lost 20lbs!!", "18M Need help", "Back for my heart", "[Challenge] European Accountability Challenge: October 27th", "My weight loss brief, hope it will help anyone. Originally wrote it as a reply to someone, decided to post it here.", "Lost and struggling....", "Lost almost 60lbs but no one to share it with!!", "Scared myself healthwise because of weight loss (19M/5'10)", "**199**", "Small Victory - I went unrecognized", "I didn’t think it was possible, but I’m close to my goal weight!", "I have a real problem", "Tips for dealing with last bit of body fat?", "Struggling with maintenance - feeling obsessed with counting calories and struggling with binging", "No more excuses", "80 pounds lost!", "I lost 20kgs in 5 months - face gains pics", "24-Hour Pledge - Saturday, 27 October 2018 - The Plan for Today!", "74 pounds down over 5 months - how I changed my life.", "Eating my favorite foods everyday and losing weight", "Friends tell me.. \"One bad day wont hurt!\" everyday!!", "[Daily Directory] Find your quests for the day here! - Saturday, 27 October 2018", "I know this is a dumb question ...", "Not sure how", "30 Day Accountability Challenge - Day 26", "How should I go about changing my lifestyle?", "The moment you realized \"wow, this might actually work\"?", "First time posting, halfway there", "Is sugar as addictive as drugs?", "I don’t know how to eat like a “normal” person.", "Struggling to have balance", "Weight Loss and Appetite?", "Day 1? Starting your weight loss journey on Friday, 26 October 2018? Start here!", "Losing weight, and my 10,000 thoughts", "Easy losing a year ago, why is it so hard now?", "sugar: It's not cravings, it's withdrawal.", "I'm losing motivation :-(", "How do I stay motivated?", "Scared to start - there are so many variables and I don't know how to deal with them.", "Public Health Schooling and Jobs Advice Megathread", "SadBreath's Guide to the Public Health Job Market", "[News] Ebola kills 164 in DR Congo", "[ADVICE] Online Public Health Programs", "[advice] what are biostatistic jobs like?", "[Advice] Multiple Logistic Regression", "[News] Iraq: Basra water pollution risks triggering disease outbreaks (/r/MiddleEast)", "[Discussion] Coxph: pvalue is 1 for all treatments", "[NEWS] The Chief Public Health Officer’s Report on the State of Public Health in Canada 2018: Preventing Problematic Substance Use in Youth", "[Discussion] Public Health Researchers, what do you think of combining science and technology to prevent diseases?", "[ADVICE] Should I pick up an outside SAS course or transfer programs?", "[News] 'Dark day': Congo rebels kill 2 health agents fighting Ebola (/r/Congo)", "[Advice] Engaging Physicians", "[ADVICE] What are some desirable skills to have as an Epidemiologist that puts you ahead of the curb?", "[DISCUSSION] I'm deployed as a public health professional in response to Hurricane Michael. AMA", "[Research] The association between acute flaccid myelitis (AFM) and Enterovirus D68 (EV-D68)", "[Advice] Can anyone give me insight on becoming an EHS (environmental health specialist) in California?", "[Advice] PhD in Public Health", "[News] Emergency Committee concludes that the Ebola outbreak in DRC should not be considered a Public Health Emergency of International Concern", "[Advice] Voluntary opportunities abroad for 3-4 weeks for a health analyst?", "[Advice] Applying to MPH in Canada, am I a good candidate?", "[Discussion] What could Public Health Professionals do in Outer Space?", "[Advice] BS in Biology but want to get into a career in Industrial Hygeine.", "[Advice] Bexsero &amp; travel", "[CAREER DEVELOPMENT] Infection Prevention Internship for MPH Students?", "[Advice] Finally have an interview request! Social and Behavioral Research Coordinator.", "[News] DRC identifies 'second wave' of Ebola in east (/r/Congo)", "[Career Development] Grant-Writing", "[Advice] Would a management minor be helpful/useful?", "[Advice] Brainstorm", "[Advice] What work should I be looking for to beef up my profile/gain experience before my master's?", "[news] Rate of new Ebola cases has doubled since September", "[news] The US Is Sending Its Addiction Problem Over The Border", "[News] Opinion | We cannot let e-cigarettes become an on-ramp for teenage addiction", "[Advice] better to do work or MPH after bachelors?", "[Advice] SOPHAS Letters of Recommendation", "[Advice] Finding a job with an MPH and limited experience", "[Advice] First steps to starting a health/education clinic?", "[ADVICE] i would like your opinion", "[ADVICE] Is helping adults to learn how to read in my local library a good thing to include in my MPH grad application?", "[ADVICE] Career in Public Health &amp; National Security in Canada - Prospects, is it realistic?", "[Advice] Environmental Health", "Pursuing an MPH [Advice]", "[Advice] MPH prospects Canada", "[Career Development] MPH in Epidemiology Job Prospects?", "[Advice] Questions", "[Advice]", "[Career Development] Struggling with an MPH", "[News] The Social Determinants of Health? What About the Political Determinants of Health?", "[advice] Two questions", "[Advice] Engaging ideas for a class for people with type 2 diabetes in a low-income senior housing building?", "[Career Development] Looking for a Mentor who has worked in the Public Health field.", "[resource] Free certificates/courses", "Those with an MPH in Biostats, how hard was/is it to find good jobs? [advice]", "[News] Cervical cancer set to be eliminated from Australia in global first", "[Advice] Is A Degree In Public Health Really This Unpromising?", "[Advice] Any public health professional willing to do an interview for an MPH assignment?", "Advice [Career Development] Question about Doctoral programs", "[Career Development] I Need Opinions", "[news] Denying social services to legal immigrants is danger to public health.", "[Advice] Can you do internships after you graduate?", "[Advice] How do you run Logistic regression in SAS with an outcome variable that’s not binary but has several different categories?", "[Advice] Trying to get research (coordinator/asst) positions but no one seems to want to hire me. What am I doing wrong?", "[news] Vulnerability to Pandemic Flu Could Be Greater Today Than a Century Ago", "[news] Experimental TB vaccine shows promise in clinical trials - STAT", "[Advice] MSN with public health specialty located in Pensacola, FL requesting shadowing advice", "[Resource] SAS Help", "[Advice] How to take care of holiday in CoxPH Time varying", "[Advice] USC versus UCSF for an MPH with a biostats/Epidemiology focus??", "[Advice] Study treatment effects", "[Advice] Public health RNs or other providers: how does your organization track the care that you provide?", "[News] Ebola's risk of spreading beyond Congo growing, WHO calls risk 'very high'", "[Advice] Is graduating late considered a flag for most MPH schools?", "[Advice] DrPH, low residency", "[News] Niger cholera outbreak claims 67 lives", "[Advice] Career possibilities with Bachelor's?", "[Resource] Lessons in “Nudging” From the Developing World", "[Advice] Epidemiologists: what is it like working in a local- or state-health department?", "[Resource] The Public Health Informatics Institute is taking questions on public health informatics and other related topics on a call-in episode of our podcast. (X-posted from r/healthinformatics)", "[Advice] Field epidemiologists, what is your job like?", "[news] Number of babies born with syphilis has more than doubled since 2013", "[Advice] Correlation between Epi and mental health", "[Advice] Is it compulsory to apply via SOPHAS to all MPH programs or we could just apply to colleges of our choices directly at their websites?", "[news] Researching Chronic Disease in the Aftermath of a Hurricane | Department of Nutrition", "[news] How Journalists Cover Cyberbullying and Suicide | Public Health Post", "[ADVICE] Any advice/tips on how I can use my medical billing &amp; coding work experience towards MPH applications?", "[News] Genetic Modification Of Mosquitoes Could Provide New Weapon Against Malaria : Goats and Soda : NPR", "[News] Poliovirus that originated in Afghanistan detected in Rawalpindi", "[ADVICE] Beginning a clinical research coordinator position", "[Advice] Where to start - what's the Public Health Bible?", "[News] Congo confirms Ebola case at Ugandan border", "[Advice] Where is the data located exactly in the DHS Program’s data files?", "[Advice] What skills should I work on?", "[News] Brian Wansink, eating behavior researcher has 13 papers retracted.", "[news] Ten West Nile virus cases around St. Louis, but not if you ask the state", "[news] Congress' latest opioid bill won't solve the crisis", "[news] London violent crime 'a public health issue'", "[advice] REHS - trainee interview question", "[Advice] MPH in Environmental Health vs Epi", "[advice] career path help, advice needed (NYS)", "[Advice] A good crash course/intro to biostatistics?", "[ADVICE] EPId: MCH/perinatal/reproductive/EH give me your two cents!"], "Politics": ["Saturday Morning Political Cartoon Thread", "Weekend Discussion Thread: Midterm Polling and Predictions", "Georgia’s Kemp Purged 340,134 Voters, Falsely Asserting They Had Moved", "Texas independents break with tradition and go for Beto in a new poll", "LeBron James dons Beto O'Rourke hat to game in San Antonio", "Georgia voters purge may be largest in U.S. history", "Reports: Votes in Texas, Georgia are being changed at polls", "Number of Georgia Voters Purged by Brian Kemp Continues to Climb", "Rep. Kevin McCarthy Deletes Tweet Attacking 3 Wealthy Jews In The Democratic Party", "Campbell Soup VP who tweeted Soros conspiracy is out", "O'Rourke picks up third Texas newspaper endorsement over Cruz", "Trump Didn’t Pull the Trigger in Pittsburgh, but He Certainly Prepped the Shooter", "Mexicans shower the caravan with kindness — and tarps, tortillas and medicine", "Midterms 2018: Voting machines are changing Texas voters’ ballots, state officials admit", "A Week Of American Hate: Bombs Mailed, Black People Executed, Jews Slaughtered", "Obama calls on Americans 'to fight the rise of anti-Semitism' after synagogue shooting", "Bowers blamed Jews for helping 'invaders' in the migrant caravans", "The #MAGABomber said his lesbian boss would ‘be the first one I burn’", "President Trump Is the Greatest Threat to National Security", "Thousands of absentee ballot applications “missing” in largely black Georgia county", "Iowa newspaper breaks its tradition, endorses Steve King's Dem opponent", "LeBron James Dons Beto O'Rourke Hat Before Lakers Game In San Antonio", "Trump Is Now Bad for the Stock Market", "Donald Trump jokes about his hair being ruined by having to answer questions in the rain about Pittsburgh shooting", "The slaughter in Pittsburgh was not ‘unimaginable.’ It was inevitable.", "Alleged Synagogue Shooter Robert Bowers Endorsed GOP Talking Point That Jewish Groups Funded Migrant Caravan", "No, President Trump, the NYSE did not open the day after the Sept. 11 attacks", "Ann Coulter, Rush Limbaugh and others stick with conspiracy theories after mail-bomb suspect’s arrest", "Will Ferrell visits Georgia to recruit volunteers for Abrams' campaign", "Jim Carrey lays into Trump yet again at LA gala: Shamelessness is not 'a superpower'", "Yes, there is such a thing as right-wing terrorism", "The President* Is Totally Unaffected By Events in the Country He Governs", "GM breaks with Trump administration and calls for nationwide electric-car sales program", "F-Bombs and Real Bombs: Our problem isn’t “incivility.” It’s right-wing violence.", "Conspiracy theories about Soros aren’t just false. They’re anti-Semitic.", "Megyn Kelly Has Always Been A Racist", "Trump says outcome at Pittsburgh synagogue would have been different with armed guard: ‘They didn’t have any protection’", "Voting machine errors changed votes in Cruz-O’Rourke race, group says", "Obama rips Trump: 'It's wrong to spend all your time from a position of power vilifying people'", "Republicans gin up hatred to avoid talking about policy", "Is Donald Trump Responsible for Violence? Yes.", "Stop Trying to Understand What Trump Says and Look at What His Followers Do", "Here Is a List of Far-Right Attackers Trump Inspired. Cesar Sayoc Wasn’t the First — and Won’t Be the Last.", "Mail bomb suspect made numerous references on Facebook to Russian associates and echoed pro-Kremlin views", "Trump's indefensible response to the synagogue shooting draws outrage", "Alleged MAGA Bomber Cesar Sayoc Apparently Threatened a Lot of People on Twitter", "Ted Cruz’s Do-Nothing Record", "Trump jokes about canceling event due to bad hair day after declining to cancel it over shooting", "Staggering Voter Suppression In Georgia Could Keep Democrats Out of Power", "Trump Blasts Dems at Rally Hours After Mass Shooting", "Seth Meyers: ‘If you’re asking if Trump is lying or stupid, the answer is all of the above’", "Blaming Victims For Mail Bombs Carries Echoes Of Civil Rights Bombings", "The Pittsburgh synagogue shooting comes amid a yearslong rise in anti-Semitism", "A Fearful, Criminally Suspect President Cannot Give Solace to a Country in Crisis", "Obama Slams Trump and Republicans: 'Robbing You Blind'", "The Pittsburgh shooter allegedly had a following on a social network that’s trying to be the far-right’s alternative to Twitter — here’s everything we know about the site", "Republicans in U.S. House Vote for a Ban on Bans of Pesticides", "Pittsburgh Synagogue’s Rabbi Decried Weak Gun Control, Do-Nothing Politicians After Parkland", "Dear concerned Semi-Trumpers, please resist a little and vote for Democrats in midterms", "Republican House Majority Leader Slams Soros Day After Bomb Targets Philanthropist", "Seminole Tribe: Accused Bomber Cesar Sayoc is Not Tribal Citizen or Employee as Reported", "How Redistricting in Michigan Has Disenfranchised Voters and Helped the Far Right Capture a Centrist State", "Three suspects. Three crimes. A hate-filled week in America", "Many of bomb suspect's conspiracy theories tracked Trump's", "Critics say Trump has fostered the toxic environment for the political violence he denounces", "Barack Obama: Trump and other Republicans 'just making stuff up'", "The Conspiratorial Hate We See Online Is Increasingly Appearing In Real Life", "American anti-Semitism: It’s getting worse", "Candace Owens and Her Fellow False Flaggers Want America to Forget. We Won't", "Trump Tweeted About The World Series On The Same Day 11 People Were Killed At A Synagogue In Pittsburgh", "Will Pittsburgh Shooting Be A Wakeup Call For Jews Who Enable Trump?", "This Conscience-Free Bullshit Is Why Trumpism Will Outlive Trump", "Stochastic terror and the cycle of hate that pushes unstable Americans to violence", "Conservative Conspiracy Propaganda Cannot Help But Instigate Violence", "Barack Obama Delivers Fiery Anti-Trump Speeches at Rallies", "Pipe bomb suspect Cesar Sayoc is a registered Republican and a Trump fan with a criminal record", "Midterm elections: Manufacturing workers say Donald Trump is yet to deliver on promises", "Reporter’s attorney alleges that Gianforte is lying about assault and settlement", "If the Mail Bomber Had Worn an ISIS Hat", "What is happening to our country?", "Trump Rants Like Racist Grandpa in Speech to MAGA Negroes", "Bomb suspect was a ‘foot soldier’ for white supremacy, kept headless dolls in van", "Nevada GOP Gubernatorial Candidate’s Family Comes Out Against Him", "Obama rips President Trump, GOP in fiery speeches for Midwest Dems", "Critics Say The Trump Administration Hasn't Done Enough To Stop Right-Wing Extremism", "Iowa’s Steve King billed taxpayers for lavish spending, complaint by Democratic challenger says", "Cesar Sayoc Was Reported for Threatening Behavior, But Twitter Apparently ‘Didn’t Find it That Serious’", "Trump must answer questions on sex harassment claims \"strategy,\" judge rules", "The Pittsburgh Synagogue Shooting and the Escalating Crisis of Hate-Fuelled Violence in the Trump Era", "I Grew Up in a Place Where I Felt Safe from Anti-Semitism—It was the United States", "Many of Bomb Suspect's Conspiracy Theories Tracked Trump's", "Pittsburgh shooting extends wave of conspiracy-minded rightwing violence", "Conservative Rabbis Dismiss Trump's Claim Pittsburgh Shooting Was Preventable With More Security", "Synagogue shooting shows spread of anti-Semitism on the far right", "On a tragic day in America, President Donald Trump feels the need to tweet about the World Series", "'It's like playing whack-a-mole': A string of recent revelations paints a stark picture of Russia's ongoing campaign to meddle in the 2018 midterms", "Trump’s Goes Ahead With His Rally, Toned Down and Tone Deaf", "Shame on the false-flag crew: At least Geraldo Rivera had the decency to own up to his terrible behavior", "'Brutally murdered simply because of their faith': 11 killed by gunman in Pittsburgh synagogue", "Trump’s Incoherent Rally in Charlotte", "Pittsburgh Synagogue Shooting is a Moment of Reckoning for American Jews", "\"Bernie or Bust: Pioneers of Electoral Revolt\" Author interview", "YouTube shutting down speech it doesn’t like", "what polictics means to you ?", "Sending $1 to worthy causes for each pipe bomb discovered", "Label Antifa a hate group like the KKK", "People can’t stand a black man that votes republican", "I’m not tired of winning one bit", "Republicans Defend and Cover Up Trump’s Tax Fraud", "Karnataka govt formation: HD Kumaraswamy seeks to bring together anti-BJP forces at swearing-in ceremony", "Field Director looking for publicantions suggestion", "Qatari Tribes writes to Human Rights Commissioner on Violation of Human Rights", "5 Lies of Black Lives Matter, Colin Kaepernick, and Nike", "Global Poverty and National Security - The Borgen Project- HELP KEEP AMERICA SAFE AND SUPPORT THE FOREIGN AID BUDGET AND EMAIL THE WHITE HOUSE", "Question about voting", "To Call On Judiciary If In Doubt Over Result [Ekiti]", "why do so many peopel hate donald trumph?", "From the hands of an angry Canadian (Katie McG)", "2 DEI si aggirano nell´occidente cristiano", "Why did Giuliani meet with the EB-5 execs that got Kushner Co's into trouble? Isn't this a conflict of his current representation of Trump. • r/The_Mueller", "Israel and the Death Toll of Protesters", "What’s the “Communist Manifesto” or “Mein Kampf” of democracy (as in a book) 🤔", "How we have been lied to by Big Pharma", "Rahul Gandhi declares himself as the PM candidate, says \"I will be the PM\"", "\"What Arrogance\": PM Modi Targets Rahul Gandhi On Prime Minister Remark", "Assurances That Animal Fat Eating Robots Won't Eat Humans for Fuel", "Noam Chomsky: Donald Trump is a Distraction", "Full Reading of Stormy Daniels Avenetti Trump Cohen Findings Report 5-8-18", "Sam Seder &amp; Ben Dixon: Ineffectual Progressives", "Nina Turner in Black Lightning (Turner-Sanders 2020)", "Michelle Wolf &amp; Mike Allen, the Douchebag", "Steny Hoyer Caught Rigging Democratic Primaries on Tape", "U.S. Out of Syria Now! Imperialist Strikes and Anti-Russia Provocations • r/WorkersVanguard", "The Humanist Report Bodyslams Hannity", "Democrats Consider Adding Even More Superdelegates &amp; Worse", "Full reading of James Comey’s Leaked Emails", "Homeland Security to compile database of journalists, media influencers", "Pretty obvious 🤣", "‘It’s frustrating’: Women in Mo. bristle at Trump’s words on domestic violence, sexual abuse", "Michael Moore participated in anti-Trump rally allegedly organized by Russians", "Two timing Liberals Chuck S and Diann F", "Maxine Waters", "Dim Wit", "Maxine Waters Our Congress Rep", "Just as a reminder", "Wow", "Ha ha", "Meathead", "Will Trump voters turn out for an election with no Trump on the ballot? The answer could determine control of Congress", "It's been a full year since Donald Trump last held a news conference", "The parallel universe of Trump’s budget, explained", "Chuck Schumer on Illegal Immigrant st George Town Law School 2006. How iguana changes colors. Now illegal takes priority over legal US citizens to get votes. Liberals are hypocrites.", "Double Talker Chuck Schumer At George Town Law School 2006", "Why Can't the U.S. Senate Pass Any Bills?", "Just noticed my paycheck went up 30 pieces of silver.", "Trump calls Tillerson exit reports 'fake news' – but was it a misfired plot?", "The School System is Broken", "Green Beret Discovered SEALs’ Illicit Cash. Then He Was Killed.", "WikiLeaks - Spy Files Russia", "The Silencing of Dissent", "White House adviser says people should stop criticizing white supremacists so much", "An Extremist Ex-Navy SEAL Just Promised A \"Gruesome Massacre\" If Trump Is Removed From Office", "The Republicans Who Betrayed the Conservative Movement", "We're a long, long, long way from a real impeachment effort @CNNPolitics", "The crisis of neoliberalism", "Noam Chomsky: Neoliberalism Is Destroying Our Democracy", "Neoliberalism: the deep story that lies beneath Donald Trump's triumph - George Monbiot", "Financial disclosure shows trump owes lenders at least $315 million", "Mike Pence: We the people demand President Trump's golf scores.", "Correspondence from Socialist Canada — Week 10: Coffee Cup Patriotism", "Liberal Rages on Trump's Obamacare Plans (YouTube)", "Liberal Thoughts on the Cameo Night Club Shooting", "Why Trumpcare Failed (YouTube)", "The Art of the Failed Deal. You're Fired!", "The CBO score for the updated version of 'Trumpcare' is out, and it's even worse than the original", "Correspondence from Socialist Canada -- Week 7: It Pays to Play", "Don't Be Fooled: We Still Don't Have Donald Trump's Tax Returns", "Correspondence from Socialist Canada — Week 4: Canada's Trump vs. Canada's Obama", "Correspondence from Socialist Canada - Week 3: Inside the Other Side of Healthcare", "New Political Party to Take on Trump", "PLEASE SHARE", "Correspondence from Socialist Canada - Week Two: Legal Weed and Socialist Police", "Trial run for a total coup by Trump and his gang?", "This s**t is bananas......B-A-N-A-N-A-S!", "How George Soros got rich.", "Ronald Noble, RKN Global’s Founder, on the Stubbornness of Corruption", "Who would you vote for in 2020, Trump or Kayne?", "Compilation of Celebs Who Laughed at the Idea of Trump Winning (x-post /r/Leftwinger)", "I really liked this speech his - \"Julian Assange: The Truth About Freedom of Speech in the West!\"", "'Balloon Boy' endorses Trump in band's music video", "Cruella de Clinton - 'Let them eat fake'", "Goldman Sachs And EU Go Hand In Hand - Conspiracy Talk", "Byron York: Trump-Kasich feud could have disastrous consequences in November", "Rubio Senate rumors undercut GOP campaigns in Florida", "Barack Obama was sponsored by Russian opposition", "Banned from the Trump Site ( /r/The_Donald)", "A compilation of wrongdoings by Hillary Clinton", "Officials: Scant evidence that Clinton had malicious intent in handling of emails", "Donald Trump’s Greatest Self-Contradictions. The many, many, MANY sides of the likely Republican nominee, in his own words", "Bernie Sanders Says US 'Kill List' Legal, Backs Troops in Syria", "Ron Paul warns Republicans not to vote for Ted Cruz", "New gov CRS report website", "Opting Out: Conscience and Cooperation in a Pluralistic Society - David Oderberg", "Join the illiminati today and be financially free", "Retire from SubReddit", "Time Lapse Talk 18 Prairie Schooner Makers to Elon Musk: It won’t work if It’s not Practical. Elon My goal is to live on Mars. Not to be practical.", "U S High School Citizens Time Lapse Talk 17 Salad Melt ? One Day a Year… for the Salad. Yeah. John De Crevecouer Go for it.", "Robocalypse Now? Why we shouldn't panic about automation, algorithms and artificial intelligence - IEA Current Controversies No. 62", "Sensible Living … on Four Feet Doggie Cultural Appropriation", "Sensible Living … on Four Feet 12 Momma’s Day", "Time Lapse Talk 16 Chris Hill to Donald Trump Nice Work. Just Keep in Mind What Happened Last Time.", "Time Lapse Talk 15 Royal Aircraft Factory B E 9 : to Donald Trump Be the Apprentice Chief: Fire the One Trillion Obsolete F 35!", "Jump Ahead 13 Tackle those H1-B Visa Holders. Don’t let them leave here.", "Go commit die", "Jump Ahead 12 Congress, please!! Get the American Workers Ready : Plan ahead, so All Thrive in A I. Get the US Military involved. Pay for everything through a small import tax on all.", "Time Lapse Talk 14 President Andrew Jackson to Donald Trump National Debt Zero Andrew Jackson makes his point with Trump. Screaming at White House Inhabitants from his horse for over a hundred years.", "Time Lapse Talk 13 Camp Toccao to Trump U S Military Bases in US, as Launchpad for Industry and Military Strength", "Innovation for Times Beyond Trade that fills Shipping Lanes", "Facebook: Cloud of Infinite Books of Your Face", "SOCIALLY USELESS? The Crucial Contribution of Finance to Economic Life - IEA Discussion Paper No. 87", "Don't Be a Herbert Hoover", "Dictatus Homo Sapiens Infallibilis", "Time Lapse Talk 7 Eisenhower to Trump", "300,000 Immigrants who are important.... and are Americans", "State of the Union.... and the Faces", "Supervising the Tech Giants by Julian Jessop - IEA Current Controversies No. 56", "Back in the USSR: What life was like in the Soviet Union - by José Luis Ricón Fernández de la Puente for the ASI", "Instructions to our CEO for First Quarter 2018 : From 323 million Board Members", "Mission to Trump : Confucius Advice : Get terminology correct", "This White House Boss talks directly to us. Let's talk directly to him", "Three Sisters Trucking Company: Solving mysteries of our Times and Crimes of old", "History; Manifesto for Trump and Pence", "North Korea threatens to ‘shoot US bombers’, says Trump was first to declare a war", "ABOUT-TURN: From pleading innocence, two admit guilt of illegal arms importation", "Only lazy people are afraid of restructuring, says Atiku", "Question - How to find what Congress will be voiting on this week?", "Svboda , Ukraine", "Arrests at US police acquittal protests", "Irma death toll rises to 30 across 3 states", "\"This paper documents a marked increase in the [..] mortality of middle-aged white non-Hispanic men and women in the United States between 1999 and 2013. This change reversed decades of progress in mortality and was unique to the United States\"", "Neo-Islamism Post Arab Spring - Tarek Chamkhi", "I am the emporer - And I want Dumplings (Stafford Beer, 1989)", "How African American children are held more accountable for their mistakes [20 pages]", "Federal Britain: The case for decentralisation", "Harold Pollack, Eric Sevigny, &amp; Peter Reuter - \"Can Drug Courts Help to Reduce Prison and Jail Populations?\" [PDF, 23 pg total]", "Hannah Laqueur - \"Uses and Abuses of Drug Decriminalization in Portugal\" [36 pg, from Law &amp; Social Inquiry]", "State \"Competitors's Veto\" Laws and the Right to Earn a Living: Some Paths to Federal Reform", "4th Circuit Appeals Court rules agains warrantless procurement of location data from cell phone provider in Maryland case", "Time for Time Limits: Why we should end permanent welfare", "The Internet of Things and Wearable Technology: Addressing Privacy and Security Concerns without Derailing Innovation", "Drinking, Fast and Slow: Ten Years of the Licensing Act - New research debunks the myths associated with extended opening hours", "Papers presented at the World Bank's Annual Bank Conference on Africa (social science, economics)", "The Ties that Bind: Analysing the relationship between social cohesion, diversity, &amp; immigration - ASI", "Party Activists as Campaign Advertisers: The Ground Campaign as a Principal-Agent Problem", "Social Darwinism and Social Justice: Herbert Spencer on Our Duties to the Poor", "The potential impact of the World Trade Organization's general agreement on trade in services on health system reform and regulation in the United States: International Journal of Health Services - (2009) Nicholas Skala", "Debunking the Myth of Mode 4 and the U.S. H-1B Visa Program, March 2006 - Note: this is pre-TISA- see comments", "King v Burwell Oral Arguments (US Supreme Court)", "DoJ Civil Rights Division - Investigation of the Ferguson Police Department [105 pg. total]", "Center for Strategic and Budgetary Assessments -- The Emerging Era in Undersea Warfare", "Orin Kerr — The fourth amendment and the global internet", "Robert W. Komer (RAND) - Bureaucracy Does Its Thing: Institutional Constraints on US-GVN Performance in Vietnam (1972)", "The European Parliament Elections of 2014: Free e-book by the Italian Centre for Electoral Studies", "Testing Theories of American Politics: Elites, Interest Groups, and Average Citizens, Martin Gilens and Benjamin I. Page, Perspectives on Politics / Volume 12 / Issue 03 / September 2014, pp 564-581", "Institute for Economics &amp; Peace - 2014 Global Terrorism Index [94 pg. total]", "Were we really all in it together? The distributional effects of the UK Coalition government's tax-benefit policy changes (LSE/CASE working paper) [49 pg. total]", "Assessing Alternative Modifications to the Affordable Care Act [30 pg.]", "Foreign Policy in the Age of Retrenchment: Results of the 2014 Chicago Council Survey of American Public Opinion and US Foreign Policy [52 pg.]", "Urban Institute - The Moynihan Report Revisited [2013, 30 pg.] - for readers interested in racial issues", "The right to privacy in the digital age: Report of the Office of the United Nations High Commissioner for Human Rights", "RAND Report - Mileage-Based User Fees for Transportation Funding: A Primer for State and Local Decisionmakers [38 pg.]", "2014 Brown Center Report on American Education: How Well Are American Students Learning?", "US Attorney investigation into treatment of adolescent prisoners at Rikers Island finds \"rampant use of unnecessary and excessive force\" and a \"deep-seated culture of violence\". As a result \"adolescents have sustained a striking number of serious injuries\", including broken jaws, noses, etc", "Unconventional wisdom: economic analysis of US shale gas and implications for the EU (2014) [36 pg.]", "CBO: The 2014 Long-Term Budget Outlook [144 pg. total, summary page in comments]", "Samuel Bagenstos - Universalism and Civil Rights (with Notes on Voting Rights After Shelby) [Yale Law Journal, 39 pg.]", "Triangle Center on Terrorism and Homeland Security Report: Muslim-American Terrorism in 2013 (2014)", "The Gerrymanderers Are Coming!: Legislative Redistricting Won’t Affect Competition or Polarization Much, No Matter Who Does It (2012) [5 pg. summary]", "Preventing Crime: What Works, What Doesn't, What's Promising - Report to Congress from UMCP's Dept. of Criminology and Criminal Justice (February 1997) [528 pp., summary report in comments]", "Jack S. Levy - \"The Causes of War: A Review of Theories and Evidence\" (1989)", "David Pozen - \"The Leaky Leviathan: Why the Government Condemns and Condones Unlawful Disclosures of Information\" [124 pp.]", "FTC Report - Data Brokers: A Call for Transparency and Accountability [110 pg. total]", "Written Evidence (177 pages) submitted to the UK Parliament about the TTIP/TAFTA trade agreement: \"U.S. workers’ share of national income is at its lowest level since the 1940s and is plunging\"", "Report on the human rights situation in Ukraine (15 May 2014) by the Office of the U.N. High Commissioner for Human Rights", "The 2014 National Trade Estimate Report, targeting financial, privacy, health, and other public interest policies of each TPP nation as \"trade barriers\" that the U.S. government seeks to eliminate", "Piketty and Zucman: Wealth and inheritance in the long run [92 pgs]", "CBO - Updated Estimates of the Effects of the Insurance Coverage Provisions of the Affordable Care Act [26 pg. total]", "The potential impact of the World Trade Organization's General Agreement on Trade in Services (GATS) on health system reform and regulation in the United States by Nicholas Skala - (How US politicos may sneakily use WTO FTA to block single payer forever)", "Human Rights Watch - \"An Offer You Can't Refuse: How US Federal Prosecutors Force Drug Defendants to Plead Guilty\" [132 pg. in total]", "Issues spark a public into being - a paper about the philosophical underpinnings of whether complex issues can be tackled democratically", "Carl Schmitt 'Dictatorship' FINALLY An english translation Publication", "NIST - Framework for Improving Critical Infrastructure Cybersecurity [41 pg., just released]", "A One-Page Fact Sheet for the PCLOB (Privacy and Civil Liberties Oversight Board) Report on Bulk Data Collection", "State and Local Pension Costs: Pre-Crisis, Post-Crisis, and Post-Reform [2013, from the Center for Retirement Research, 12 pg. overview]", "Ali Lameda: \"A PERSONAL ACCOUNT OF A PRISONER OF CONSCIENCE IN THE DEMOCRATIC PEOPLE'S REPUBLIC OF KOREA\" Amnesty International (1976) (finally available online)", "Medical Debt Among People With Health Insurance", "2006 paper about Medical Debt \"Shaming\" and the behavior of medical debtors - deferring care could have major implications for Obamacare utilization by the chronically ill (see additional link in comments for context)", "Exploring the Multidimensional Facets of Authoritarianism: Authoritarian Aggression and Social Dominance Orientation", "WHO | Draft Legal Review of the General Agreement on Trade in Services (GATS) from a Health Policy Perspective (How one of our many trade agreements effectively bans public health care, a factor which may be poisoning our ability to have affordable healthcare in the US unknowingly)", "A Comprehensive Analysis of Poverty in India by Arvind Panagariya &amp; Megha Mukim [PDF]", "Encouraging Reading of Diverse Political Viewpoints with a Browser Widget", "/r/worldpolitics chat room", "This is /r/worldpolitics, not /r/worldnews, /r/news or /r/politics", "Department of Homeland Security.", "Synagogue mass shooter blamed Jews for helping 'invaders' in the migrant caravans", "'While the Rest of the World Burned,' Billionaires Made More Money in 2017 Than Any Other Year in History", "Far-Right Presidential Candidate Jair Bolsonaro Poised To Win Brazil Election", "Supreme Court Takes Case That Could End Internet Censorship, Expand First Amendment", "Facebook Censorship of Alternative Media \"Just the Beginning,\" Says Top Neocon Insider", "Inspector general: ICE failed in conditions at child detention centers", "What Happens When Telecom Companies Search Your Home for Piracy. \"When the police showed up after about 20 minutes, according to Lackman, he opened the door and was met by lawyers, a bailiff, and, rather ominously, a locksmith. Seeing that he wasn’t about to be mugged, the police left.\"", "Why is China choosing to partner with Israel and Saudi Arabia?", "Trump turns down India's invitation for Republic Day celebrations: Report", "Obama: \"It's wrong to spend all your time from a position of power vilifying people\"", "Friday: 6 Palestinians murdered by Israeli military fire", "The House of Saud exposes our ruling elite’s talk of “human rights” abroad as a crock of lies. Foreign regimes are arranged into a hierarchy of villains; but the order is not decided on the basis of how villainous they are, rather how hostile they are deemed to be to western interests.", "“Don’t Mourn for Khashoggi”: Inside the Feverish Cesspool of the Pro-Saudi Right", "Trump Is Tearing Up the INF Treaty Because Russia's Hypersonic Missile Advances Have Left the US Behind", "Why American Leaders Persist in Waging Losing Wars, by William J. Astore", "Withdrawing From the INF Treaty: Consequences and Costs", "#TrumpCult #MAGABOMBER #VanillaIsis #LockHimUp", "USA not invited: Common ground on Syria: What France, Germany, Turkey &amp; Russia agreed on in Istanbul = Go home. Stay home", "Trump Cult", "How war reporting has changed Politics, finance and technology have changed the role of on-the-ground reporters. A foreign correspondent for more than 40 years, Patrick Cockburn says the march of fake news should remind us of the vital need for eyewitness accounts", "Lmaooo facts", "Sleazy UK government 'has blood on its hands' over Yemen conflict but poll shows 42% of British public do not know war exists", "South African minister alleges blackmail after sex video leaked", "The Yemen War Death Toll is five times higher than we think, by Patrick Cockburn", "President Donald Trump criticizes Dodgers pitching moves during World Series Game 4", "Donald Trump Jr. Has Been Liking Twitter Conspiracy Theories About The Pipe Bombs", "Israel’s covert influence campaigns in the West", "KKK’s official newspaper supports Donald Trump for president", "SkyKing tribute: “Nah, I’m a white guy”", "It's Time to Drop the Jew Taboo", "The Snowden files: NSA's plans for a hundred percent coverage of every square inch of the planet", "what does this have to do with running the country?!!?!", "Universities All Over Brazil Suffer Police Raids And Electoral Justice Operations", "Sincere list of questions to my American brethren. Pardon my ignorance if some answers are obvious.", "DHS Watchdog Finds 'Significant' Health And Safety Risks For Immigrants At ICE Center", "Children's operations cancelled by NHS up 58 per cent since austerity began, new figures show. Data obtained by Labour Party probably an underestimate of cancellations, as majority of trusts refuse to provide full figures.", "Justifying the Khashoggi atrocity by Saudi Arabia: \"Just one guy who wasn't even an American!\"", "Raja Ram Mohan Roy", "Trump Claims Russia Seeking Economic Aid From United States", "The Number Of Mass Killings Has Exceeded The Number Of Calendar Days", "New Poll Shows Support for Israel Plummeting Among U.S. Liberals, Millennials and Women.", "Steve Bannon interviewed by Zanny Minton Beddoes | The Economist", "Poll: Most Americans oppose ban on 'assault weapons'", "Uptighty Whiteys", "The US may be aiding war crimes in Yemen.", "Saudi Arabia Kills Yemeni Civilians with Another US-Made Raytheon Bomb", "VIDEO: Setting The Stage For Tunisia’s 2019 Elections", "US foreign policy caused the Honduran migrant caravan", "#Pittsburgh shooter Robert Bower wrote on his `Gab` social page: \"Jews are the children of Satan.\"", "Let's talk about the caravans...", "Little Partisan Agreement on the Pressing Problems Facing the U.S.", "PayPal Bans Social Network Gab.com After Synagogue Attacker Revealed As User", "A solution to the Syria crisis cannot simply be military and must include a political process under the auspices of the United Nations that envisages free elections as a goal, German Chancellor Angela Merkel said on Saturday.", "Trump’s Drug Plan Has the Right Idea Americans shouldn’t have to pay vastly more for medicine than people in other countries do.", "Campaigners in Ireland celebrated the end of a “medieval” ban on blasphemy on Saturday, after voters overwhelmingly supported a referendum to remove the offence from the constitution.", "The only caravan that the United States should fear...", "After ICE detained this migrant in Texas, her C-section scar ripped open and she was denied surgery for 4 months", "A Yale Historian believes Donald Trump is behaving like Adolf Hitler in the 1930s", "Younger Americans are better than older Americans at telling factual news statements from opinions", "Dozens of drones shot down near Russian military base in Syria in past two months — Putin \"Russia reserves the right to support the Syrian government if terrorists carry out provocations from the Idlib zone,\" Putin said", "What’s Going to Happen to the Migrant Caravan?", "The legal, media and parliamentary campaign that caused the rise of Bolsonaro and fascism in Brazil", "Two Stories from the Propaganda War", "Mexico torn between stopping, aiding migrant caravan", "Why Public Debt Is A Problem - And Trade Deficits Aren't", "Ronnebeck’s son Grant was shot and killed in January 2015 by an illegal alien. He has established the Ronnebeck institute.", "At least 8 dead in shooting at Pittsburgh synagogue", "Filthy leftists deny the greatest Holocaust in world history: Holodomor", "Jews Celebrate Yes Vote in Irish Abortion Referendum - It made me incredibly proud\" said one Jewish woman whose daughter campaigned for the Yes vote, sentiments echoed by Rabbi Dr Charles Middleburgh of the Dublin Jewish Progressive Congregation the DJPC - Here we count abortion as a capital offense", "Michael Avenatti hit with 2nd criminal probe referral after client says he 'twisted' her words about Kavanaugh", "President Trump Rally in Murphysboro, IL 10/27/2018", "All immigrant-headed households — legal and illegal — receive an average of $6,241 in welfare, 41 percent more than the $4,431 received by a non-immigrant household on welfare, according to the analysis.", "Why Are We Still Teaching Reading the Wrong Way?", "Why Are We All Having So Little Sex?", "Facebook Purge of Alternative Media Is 'Just the Beginning,' Boasts DC Neocon Operative", "Cesar Sayoc held “CNN sucks” sign at a Trump rally in 2017, the television network shows", "Iran and America: Why All the Enmity?", "A white racist that hates Trump. A model Democrat in other words.", "Trump Condemns Pittsburgh Synagogue Killer – Suggests Armed Guards Could Have Prevented Shooting", "Iraq Starts Following US Sanctions On Iran", "How the world is grappling with China's rising power", "Turkey hosts Syria summit with Russian, French, German leaders", "MAGA Bomber’s Van.", "Most U.S. College Students Afraid to Disagree with Professors", "The ‘Package Bombs’ Summed Up by 13 Pictures", "Thousands of demonstrators in Rome demand that the Mayor resign over the city's crumbling infrastructure", "BLEXIT – We Free from the Democrat plantation", "Censored [With Seven More] at R/News on the Sinead O’Connor Conversion Story - Jews did 911, the Koran instructs the faithful to \"cast truth at falsehood,\" neither Sinead O'Connor nor any mainstream Moslem world wide has cast a syllable of truth which confirms the lot as False Moslems &amp; unbelievers", "According to racist white Democrats all these black folks are mentally ill white supremacists just like Kanye West. #WalkAway #Blexit", "American Exceptionalism", "No, Stop, No: MSNBC Host Goes Nuts When Confronted With Past Examples Of Violent Left Wing Rhetoric", "“They wanted me to, but we’ll pass”: Trump refuses to call Clintons or Obamas following bomb scare", "Who are the GLOBALIST ENEMIES of America?", "Texans say voting machines are flipping selections to the other party", "/r/Libertarian wiki", "Democrats vs Republicans vs Libertarians", "Communities with mass shootings have 4 things in common, study finds. These things include lack of access to mental health care, a lack of social opportunities, higher rates of income inequality, and gun control laws. Communities with the strictest gun laws have a 53% greater risk of mass shootings.", "The Political Spectrum You're Taught Vs. Reality", "But that doesn’t make me feel good! I don’t understand economics!!", "Bill Of Rights Final Dilemma", "Required by law to offer Chips and Salsa", "Meanwhile, at a Yemenis wedding.", "Statists in a Nutshell", "Georgia is cracking down on people legally saving their money that was already taxed when they earned it. Money, taxed when you earn it, taxed when you spend it, taxed when you want to use what you just bought, this seriously needs to stop!", "Libertarians", "Government Incompetence", "We agree with both parties at some point", "Political correctness", "Congratulations to Seabirds for winning the war against Seabirds.", "Conservatives be like", "Taxes are theft wish I had pic of family I'm supporting by paying them yadda yadda", "New Mexico's U.S. Senate candidates spar in final televised debate", "The FDA wants YOUR thoughts on reclassifying marijuana!", "Fintech looking to end ‘payday poverty cycle’ launches in Ireland", "How libertarians are viewed", "Justin Amash came to ask for my vote and I thought he was a solicitor", "Why we need third parties", "He took his comparative literature degree and moved to a jungle in India to escape his giant student loan debt", "Larry Sharpe on Glenn Beck Podcast 20118/10/27", "You’ve probably heard a thing or two about the anti-Semitic dickweed popping off in a synagogue. Unsurprisingly, leftists are using this unfortunate situation to attack the things they hate. Namely, Trumpy and boomstickery.", "Last time I checked, people go hungry because of socialism.", "Large Increases in the Minimum Wage Are Likely to Destroy Jobs - By Robert P. Murphy", "If taxation was not theft, where would you put the money?", "The first steps have been taken on the road to banning cash. (sorry if I'm late on this, I just found out)", "North and South Korea agree to scrap 22 guard posts at border next month", "What happens if they had told us it wasn't?", "Did Hungary Really Just Ban Gender Studies?", "Vandals deface mural of Democrat candidate for Senate", "Anyone willing to indulge a radfem for a moment?", "Watch: Candace Owens Announces BLEXIT: The Black Exit from the Democrat Party", "Words are not bullets. Social media posts have a body count of zero. The sole responsibility for today's horrific actions lies with one person. We will do everything in our power to work with law enforcement to see that justice is served.", "What could be done if you kept your social security.", "What parts of social justice are and are not compatible with Libertarianism?", "Army’s detailed Iraq war study remains unpublished years after completion", "Reminder that the Obama DHS released a report in 2009 warning of the rise of right wing domestic terrorism but withdrew it due to pressure from veterans groups and conservative columnists", "We Can Change", "Duverger's Law and the Two-Party System Explained", "How Third Parties Are Getting Screwed This Election Season", "Life in the UK in 2018", "Reuters Special Report: How Republicans are using immigration to scare voters to the polls", "Most of the land near the border is privately owned. Migrants are trespassing on this private property, littering on this private property, threatening the owners of this private property. Just incase you didn't already know that open borders libertarians are nothing but gaslighting leftist shits.", "/r/Politics is a joke.", "A quarter of college students could develop PTSD because of the 2016 election, a new study suggests", "Nazis Are Tracking Voluntary Eye Movements", "We really don't need to be providing social security to retired individuals because if that tax didn't exist nobody would have any problems investing enough money to do it themselves.", "US passes landmark decision in ‘right to repair’ movement", "\" Milo Chickened Out\" Ben Talks On The Possibility Of Debating Milo.", "Trump reassures gun owners after synagogue shooting this morning", "The more you know", "Gab is being forced offline. Twitter's biggest competitor btw", "[Discussion] What are your views on right to repair laws? Should we have a right to repair our private property, cutting into corporate profits?", "Pull yourself up by your tiny bootstraps, bucko", "Jordan Peterson_The Reality Of Malevolence And Evil.", "Republicans are cheaters. Rep Gov Cand is SoS.", "And they call us the anarchists", "Guns are here to stay so totalitarian leftism can’t take over unopposed. Guns will never go away with any laws in America.", "True Libertarians should oppose Trump in everything", "Where do you break from traditional Libertarian ideals?", "U.S. Labor Markets Aren’t Truly Free", "Are there any libertarians on your ballot this year that have a decent chance of winning?", "A Conversation w/ Sarah Haider", "Yup.", "Differences - (Right Wing) Libertarianism vs Classical Liberalism vs Social Liberalism vs Social Democracy", "Exactly this. Lets do better.", "Serious question: What possible reason could caravan migrants have for proudly waving their old country's flag?", "Statism: The Belief that..", "Where can I find Gary Johnson's NM debate on Oct 26?", "The evergreen State College Fiasco - Homeless Housing? p 2", "RIP John Brown", "5 Myths about Income Inequality Debunked", "The government is only maintaining some kind of order in society is because the consequences are massively disproportionate", "\"I know what an enemy really is, from hard personal experience in combat. The other party in America is not the enemy; they are the opposition. In our democracy we are lucky to have an opposition, in order to have honest debate. It’s creative. It’s healthy.\" - James Webb", "Here’s how to avoid problems with straight-ticket voting in Texas", "An excellent lesson from /r/stoicism", "Ayn Rand got got", "So close, yet so far", "Ow well", "Economists think antitrust policy should pay more attention to workers", "Hands down ,My favorite Trump video !...", "Trump bashes Civilian rescuers in Texas during Harvey.", "People masquerading as political opponents to make them look bad.", "Less than 5 minutes in California before...", "Rick Wilson on MSNBC says \"They're going to have to put a bullet in Donald Trump\".", "Why the press isn't taken seriously...", "Never forget how seriously the media takes political violence against conservatives.", "Friday Free Talk", "We're updating the r/Anarchism sidebar and want your suggestions on anarchist media and resources!", "3 right wing terrorist attacks in 1 week. 2 shot dead for being black in KY. Pipe bombs mailed to Trump-fabricated boogeymen. At least 11 killed at a synagogue. We need a total and complete shutdown of the right wing in America until we can figure out what the hell is going on!", "Honduran Caravan is a result of Racist US Colonial Policy.", "Why isn't life fair?", "Asking the real questions here", "Ann Coulter: Trump Should Order US Military To Invade Mexico | Prominent conservative on Fox News calls for invasion of Mexico over migrant caravan while referencing the Bush-era invasions of Iraq &amp; Afghanistan &amp; implying that threat of massacring immigrants at border does not go far enough for her.", "\"I have a higher standard of living in a Third World country than I would in America, because of my student loans.\"", "Some leftist tattoo designs I've been working on", "A white supremacist kills 2 African-Americans at a store. A right-wing extremist is caught mailing bombs. An anti-Semite kills multiple people in a synagogue. That’s just the past 3 days. They’re all domestic terrorists. Terrorists don’t get radicalized by the tooth fairy. #TrumpsAmerica", "Another far right terror attack: White Man shoots multiple worshipers dead at US synagogue", "Fashies apropriated one of my interests and it sucks.", "German Anarchist discusses her decision to go to Rojava and join the Women's Defence Forces", "Found this at my local fast food joint.", "All Cops Are Bad | Thought Slime", "Maybe We Should Take Socialism Seriously", "Synagogue shooter shared pro-Nazi content &amp; Trump-inspired QAnon hysteria, called for extermination of Jewish people to ‘make America great again’ &amp; held disdain for refugee assistance group for “[bringing] invaders [referring to immigrants/refugees] in that kill our people” before going on to kill.", "Palestinian badass Ahed Tamimi: \"this is a natural reaction to the presence of the occupation, to the presence of soldiers on my land. Everybody should be slapping soldiers.”", "Macron: Calls to halt arms sales to Saudi Arabia are \"demagoguery\"", "Defend Rojava Revolution: both Assad and Erdogan threaten Genocide", "So...any comrades going to disrupt the massacre at the border?", "Anyone here NOT a member of the IWW?", "A fellow comrade needs help", "Must watch", "Pittsburgh Synagogue Shooting, 8 Dead — White Male Suspect Says \"All these jews need to die\"", "IWW members at Mighty Good Coffee in Ann Arbor, MI formally recognized as a union by the bosses! (Facebook warning)", "Military Sleep Rotations, Exhaustion, Functional Numerical Strength, and Timing of Attacks", "Fuck Trump", "Understanding the wealth and power of corporations like Apple", "#EndeGelaende - Hambach Coal Track and RWE Digger Blocked ⋆ Paper Revolution", "Wild Boar Turns Tables on French Hunters, Wounding Two ⋆ Paper Revolution", "MTA will crack down on homeless people in subways", "On Dual-Carding (Or how revolutionaries should approach mainstream unions) - Organizing Work", "Facebook &amp; Twitter deleting Cesar Sayoc's pages.", "\"But what about Chicago?\" ask the law and order fascists who demand ever more funding for police, leaving no money for actually effective programs.", "Thought you guys might appreciate this", "Quick Question Regarding Frantz Fanon", "Did Charles Fouier had any anti civ views and if so, what were views on Civilization?", "Don’t pretend to be an anarchist if you vote democrat or otherwise engage in bourgeois democracy.", "Turkey: “On the detentions against the HDP members ahead of local elections”", "The Murderous Military Uses Call of Duty for Target Practice", "\"Doublethink is notable due to a lack of cognitive dissonance — the person is completely unaware of any conflict or contradiction. For someone to mention any contradiction within the context of the Party line was akin to blasphemy, and could subject that person to instant social disapproval.\"", "Pumpkin stencils?", "\"Witchcraft, Gender, &amp; Marxism\" | Philosophy Tube", "Anthony T. Fiscella. Varieties of Islamic Anarchism: A Brief Introduction", "If everyone in the world wanted to eat healthy they simply would not be able to, shows a new study. 'We simply can't all adopt a healthy diet under the current global agriculture system,' scientists claim.", "Low-Tax States Are Often High-Tax for the Poor", "The MAGA bomber was robo-foreclosed on by a bank bought by Steve Mnuchin@ddayen", "Tax is theft without consent", "Marx's Concept of the Alternative to Capitalism - Peter Hudis", "MOVE Member Mike Africa Sr. Released from Prison After 40 Years", "Civilized Societies Don’t Call It Censorship, but Copyright", "Exiting the Vampire Castle", "The van of the recent mail-bomber", "Fulfillment - an anarchist short story", "#Manheim #HambacherForest – MⒶZ 46 Occupation Statement", "World's billionaires became 20% richer in 2017, report reveals", "A World Without Money: Communism", "Bomb Suspect's Van Covered With Pro-Trump Messages | Van of suspect (in the case of over a dozen bombs sent to prominent Dems) featured images of crosshairs over progressive filmmaker Michael Moore &amp; Green Party candidate Jill Stein. He was reportedly a member of a 'Kill All Socialists' FB group.", "Preexisting relations of support have been most effective in sustaining communities during a disaster. Survivors had organizational links, a culture of mutual aid, and expectations of solidarity. Tenants knew that they had each other’s backs because of their past relationships with one another.", "Anthropology and the Economy of Communism (Demand-sharing)", "Anarchism 101: Evolution vs Revolution", "Is the bourgeoisie now invincible?", "The Gentrification of Seattle", "Federal Law School in Niterói, Brazil.", "On Kings - David Graeber, Marshall Sahlins", "The Coming War on China: Absolutely gut-wrenching documentary on America's past, ongoing, and future atrocities in the Pacific", "from the dsa website: “Democratic socialists have long rejected the belief that the whole economy should be centrally planned...market mechanisms are needed to determine the demand for many consumer goods.” thoughts?", "Are Prisons Obsolete? | 22:57", "How to change the course of human history (at least, the part that's already happened) - David Graeber and David Wengrow", "US Border Patrol agent shoots a teenager in the back for throwing rocks and people celebrate in the comments", "Starting a Class War in Cities: Skylines (Non-Compete video)", "So I was at a bookstore in Boston when all of a sudden.", "#EndeGelaende – 1,200 People Kettled at #Dueren Station – “Inadmissible Deprivation of Liberty” ⋆ Paper Revolution", "55 Years Ago, Someone Blamed a Bombing on a Racist Politician", "Owen Jones meets Slavoj Žižek | 'Hillary Clinton is the problem, not Donald Trump'", "#Minnesota Police Train at Military Base as #Line3 Pipeline Protests Escalate ⋆ Paper Revolution", "Basel, Switzerland - Wild Demonstration and the Arrests ⋆ Paper Revolution", "#StopDeportations #Bristol #UK - Around 100 People Block Road in Solidarity with Deportation Victim ⋆ Paper Revolution", "Sometimes violent opposition to racists has been commonplace in America", "Trump Administration Is Destroying Department of Interior Records", "The Magna Carta Manifesto: Liberties and Commons for All - Peter Linebaugh", "The Fascist Threat Our Political Establishment Won't Acknowledge", "How do I find anarchist friends without seeming like a cop?", "Anarchist poem (#2)", "Suspicious packages spotlight vast postal surveillance system", "Boss makes a dollar", "Heartless Romantics: Fascism and Romanticism", "Climate Chaos: Eat less Meat and Gain time to Save the Planet", "Why right wingers who make the \"freedom of speech\" argument are full of shit.", "Pipe Bombs From The Right – #AntiFa Mans The Wall ⋆ Paper Revolution", "Racist Terrorism In USA Continues: White Man Who Killed 2 Black People at Kroger in KY Tried to Enter Black Church Before Attack", "I'm afraid to admit that I'm an anarchist", "\"Kill and Shoot Illegals on Sight \" - Know the true intentions of Right wing Fascists folks . This is how the Right wing thinks of other human beings from different countries.", "Trump considering plan to ban entry of migrants at southern border, deny asylum", "I have a friend who lives in Brazil...", "The average American works more than a medieval peasant", "Interview: YPG spokesman Nuri Mahmoud on ISIS prisoners", "whats with the hate for Bookchin?"], "Food": ["[MOD POST - PSA **UPDATE**] pLEASE SEE THE FOLLOWING RULE CHANGES FOR POSTING LINKS IN THIS SUB.", "Just a friendly Reminder: We mods do Reverse Image Searches on your posts. If we catch your image (cropped or otherwise) on another site that you can't verify is your personal blog, we will ban you. Cheers.", "[homemade] cheese board", "[Homemade] Oreos", "[I ate] Ribeye with pumpkin fritters, sweet potato paprika fries and onion rings.", "[Homemade] Chocolate truffles with orange-cointreau ganache filling.", "[I ate] Japanese fluffy pancakes", "[Homemade]Mushroom Gnocchi", "[Homemade] Orange-Ginger cake with chocolate icing", "English Breakfast [Homemade]", "[Homemade] Pumpkin cookies with cream cheese icing", "[Homemade] Cheese Taquitos with Pico de Gallo.", "[Homemade] Green pepper and ham stuffed crust pizza in the shape of Patrick Star.", "[I ate] A burger with Brie, caramelized onions, candied bacon and apple slaw.", "[Homemade] Dinner rolls", "[I ate] Texas brisket", "[Homemade] Rolls stuffed with ham and cheese", "[I ate] Dole Whip pineapple split", "[Homemade] apple cinnamon rolls", "[Homemade] Lemon drizzle cake.", "[Homemade] Oven Roast Herb Chicken with Golden potatoes, caramelized sweet onion and sliced carrots", "[Homemade] Beef Stew", "[homemade] meats and cheeses, jellies and nuts", "[Homemade] Pork Katsu Curry", "[homemade] Beef Bulgogi", "[I ate] Bangsilog, a traditional Filipino breakfast", "[I Ate] This Massive Slice of Pepperoni Pizza", "[I Ate]steam Shrimp and pork dumping", "[Homemade] Japanese beef curry", "[homemade] Pasta Aglio e Olio", "[Homemade] Eggrolls", "[I ATE] Blood Orange Torte", "[I ate] bubble waffle with ice cream", "Minced Meat People Pie [homemade]", "[I ate] Cannolis", "[Homemade] Pot Roast", "[Homemade] Breakfast shakshuka", "[Homemade] Steak &amp; lobster", "[Homemade] Fried spicy sisig (Filipino)", "[Homemade] Dragon Chicken", "[homemade] Pizza on pizza steel", "[Homemade] Flammekueche with raclette cheese", "[Homemade] Chocolate chip cookies", "[i ate] Pork Bagnet (fried crispy pork belly)", "[Homemade] Krispy skin spicy salmon atop sauteed asparagus and cherry tomatoes, with a chardonnay/browned butter glaze.", "[homemade] pepperoni pizza", "[Homemade] reverse sear cowboy ribeye", "Ichiran Ramen, tonkotsu broth [I ate]", "Pho dac biet [i ate]", "[Homemade] pasta with cream sauce", "[I ate] Hakka Noodles with Chilly Chicken Gravy", "[Homemade] Bavarian Pork Roast ready for the oven", "[homemade] banana parfait with miso salted caramel and peanut", "[I ate] Pork Cutlet Omelet Curry", "[I ATE] Chicken Fried Steak", "[Homemade] Sour cherry and chocolate cheesecake.", "[I ate] Chicken Pakoda with Salad", "[homemade] NY Strips w Tomato and buratta salad", "[Homemade] Tater Tot Casserole with Chicken", "[homemade] Pizza night!", "[I ate] A mixed shawarma with Lebanese bread", "[Homemade] Chicken-vegetable soup.", "[Homemade] The Smookie; toasted marshmallows, hershey's chocolate, and homemade sugar cookies!", "[Homemade] Bowties and Chicken in a Creamy Cheddar White Wine Cream Sauce.", "[I ate] Dry-Rub Elk Chops and Mashed Potatoes", "[Homemade] Grilled tenderloin with chimichurri", "[homemade] i made kingfish sashimi with poached asparagus caviar and wasabi pea soil", "[Homemade] Fish Noodle Soup", "[Homemade] Rajma-Chawal (red kidney beans stew and cumin rice)", "[Homemade] Paella", "[Homemade] Ribs", "[Homemade] Chicken teriyaki and foraged oyster mushrooms served with steamed veggies and sweet potato noodles or rice.", "[Homemade] Ham, Cheese and Mustard Gougeres, filled with sour cream and spring onion", "[Homemade] Brown Sugar &amp; Spice Shortbread Cookies", "[Homemade] Grilled Salmon", "[homemade] fish hotpot", "[Homemade] Scallop Crudo with Tarragon-Citrus Vinaigrette", "[Homemade] Popcorn Chicken Lasagna", "[Homemade] coffee ice-cream", "[Homemade] Spinach/Mushroom/Capsicum/Pepperoni Pizza", "[Homemade] Fried Turkey Hot Rods", "[I ate]Maple bacon and strawberry streusel donuts", "[I ate] Mutton Biriyani", "[I Ate] Enchilada Platter", "[Homemade] Bucatini Carbonara", "[Homemade] cinnamon apple pie", "[Homemade] Sweet and Salty Pork with Greens and Mushrooms", "[Homemade] Chocolate raspberry cake!", "Afghani rice with roast chicken-[homemade]", "[Homemade] Black bean soup with cider vinegar cabbage and sour cream", "[I ate] Curry Mee", "[I Ate] Chicken Katsu Loco Moco", "[HOMEMADE] 2 loafs of white bread", "[Homemade] Argentine Pastafrola", "[Homemade] Sourdough pizza with fresh mozzarella, sea salt and pepperoni", "[I ate] A cotton candy taco", "[Homemade] Mongolian Beef Bowl", "[I ate] Barbacoa tacos", "[Homemade] S’mores snack cake", "[Homemade] White Beans cooked with pastrami in a clay pot", "[I ate] Lamb ribs with figs reduction", "[homemade] bacon deviled eggs", "[MOD POST] New rule, ONE non-OC post per 24 hour period per user.", "[MOD POST - RULE CHANGE] Hello. We have removed the resolution requirement in post titles.", "Dessert Grazing Table", "Three courses of homemade ravioli tonight... Four Cheese (ricotta, parm, asiago, and smoked prov) in a Tomato Sauce, Lemon &amp; Mint in a Brown Butter Sauce, and Sweet Potato in a Cream Sauce.", "Breakfast is served.", "Chicken Nachos", "[Homemade] Smoked Bbq Chuck Roast Sandwich with Havarti.", "Tai white fish with crispy shiitake I made today at work!", "My Mother’s cheese and cold cut board.", "I ate steak in London", "Bubble waffle cone (cookies &amp; cream ice cream, rainbow mochi, fruity pebbles, chocolate pocky, waffle, ube sauce)", "7 layer dip", "Midnight Nachos!", "I went to get Korean food with my best friend today. ❤️❤️❤️", "slow roasted pork belly", "Roast Chicken, potatoes, and carrots. (pretty proud of this one, its my first time making a dish like this)", "Whomp Platter from Char Bar in Kansas City with brisket, pork, chicken, sausage, turkey, ham, burnt ends, and ribs", "Cheesecake", "Dijon, brown sugar and honey smoked ham. [homemade]", "Smashburger and tater tots. The simple pleasures.", "Baby shower grazing table", "Pork Don, Kyoto", "[OC] I hope it belongs here - Boiled Egg", "Cheeseburger with an egg, bacon and hashbrowns with oven baked fries", "El Xolito hot dog from Barrio Dogg in San Diego", "Homemade magic bar pie with toasted coconut mixed in sweetened condensed milk, butterscotch, chocolate, shaved white chocolate flakes and toasted hazelnuts", "Sushi combo", "homemade soul food: collard greens, black eyed peas, fried chicken, and cornbread. 🔥🔥🔥", "Chicken parm.", "(Professional) Grilled Artichokes with crisp pancetta and sauce gribiche.", "Home made steak naan bread pizza", "Key lime pie for two", "Chocolate Fudge icecream on Waffle", "'Tis the season, so I made some pumpkin soup!", "My college cafeteria's cheeseburger and fries with a Mexican Coca-Cola.", "[Homemade] Burger and onion rings", "That’s a big Chicken Sandwich for a kid’s meal. The chicken is wider than my son’s face.", "Lobster, crab, and shrimp rolls! Luke's lobster \"trio\"! (Luke's Lobster, SF) [OC]", "White pizza with feta jalapeño sausage red and white onion on a handmade dough and sauce 48x52", "[Homemade] White beans cooked with pastrami in a clay pot", "Kona Coffee Waffle from the Yokohama Red Brick Warehouse.", "Skirt steak gyudon (beef bowl) in Osaka", "Beef Terrine Platter (2046x1563)", "Fruits Heaven", "Grilled Cheese Lunch With The Superior Drink", "[Homemade] Steak Tartines with Roasted Red Peppers, Horseradish Mayo, and Pepper Jack Cheese [OC]", "Bacon wrapped chicken bites 🥓 🍗", "Kbbq with an egg!", "Steak &amp; lobster", "BBQ for a wedding? 🤨 or 🔥", "[Homemade] Last nights antipasto platter and bruschetta!", "Claypot rice topped with taiwanese sausage, mushroom, marinated chicken and bokchoy", "Pre-Gravlax - Salt/sugar cured salmon with dill, white pepper, beet, and horseradish ready to sit and 'cook'", "[Homemade] Brownie goodie bars. Can’t get over how good these are", "Baked chicken breast with smashed, fried, and herbed potatoes.", "Seared Kobe Beef \"Sushi\" with garlic soy dipping sauce [4032x3024]", "Fried Soft shell Crab - Charlie's Seafood New Orleans (Harahan): Oh yeah: Here is the 2018 New Orleans po-boy festival menu", "I ate Loaded Crab Fries", "Easy mapo tofu + ground pork for a chilly afternoon lunch 😊 (and leftovers later hehe!)", "Homemade Steak Naan Pizza by Mom", "\"Lil' Devil\" Mapo Tofu", "World Series Meatball Subs. Just the right balance of bread, meat, cheese, and sauce.", "Time for ramen. [OC]", "Blackened tilapia over orzo with mushrooms and salsa verde", "[Homemade] teriyaki salmon sandwich with green onion curls and sriracha mayo", "The Tripple B 8oz steak from Stackers.", "My first take on a sourdough pizza", "[Homemade] Lamb Meatballs with honey, mint, dill tzatziki sauce, and pomegranate seeds.", "Callo de hacha and raw shrimps", "My favorite pizza. \"Bristolian\" from Papa Joe's in Bristol, Rhode Island. Calamari with banana peppers and vinegar.", "Bread with Toppings", "[I made] spaghetti carbonara", "Potatoes with pepper, teriyaki sauce, Cajun and cilantro", "Chinese Style Steamed Egg", "Gyro omelettes", "Belgian waffle with goat cheese, chopped walnuts, honey, and fresh house made maple syrup.- Syrup Trap in Vancouver WA", "Pernil with yuca and onions. Dominican food in Brooklyn", "[OC] Spaghetti Alfredo with shrimps and a Tempranillo/Syrah", "Butter Finger cheesecake with Oreo crust and base, covered in chocolate ganache and swirls of peanut butter whipped cream", "Homemade chicken schnitzel burger with grilled cheese, beetroot, tomato, pickles, spinach, tomato and cucumber. Egg dominating the other ingredients.", "Tuna Sushi Burrito from Hai Street Kitchen in KOP Mall", "Brazilian pecanha and various sides.", "My savory veggie crepe", "Homemade pizza bombs!", "[I made] Minced meat stuffed eggplant with garlic confit.", "Apple cake. Homemade.", "Shakshuka from Nue in Seattle", "[OC] Bacon wrapped jalapeno poppers", "[we served] fried green 'blt' at a concert tonight. Pre-smash, intact yolk.", "[OC] T-bone and farm fresh eggs.", "[OC] Spaghetti with Marinara", "Melty pork ramen", "Eggplant parm sandwich!", "My homemade Chili with Chunks of beef and sausage. The rest is top secret...", "[OC] (Mostly) Homemade Crispy Chicken Caesar", "Katsusando: Wagyu tenderloin lightly breaded, fried, and served in a warm buttered sandwich [OC]", "[OC] Hong Kong Milk Tea + Charcoal Dole Whip Soft Serve 🤪", "[Homemade] Sweet yeast rolls to go along with soup", "Freshly roasted beef, cheddar, mushrooms, onions, &amp; horseradish sauce on a pretzel bun - Porter’s Pub, Easton PA", "Oktoberfest inspired feast - sausage, pretzel, sauerkraut, perogis, roasted garlic potatoes with mustard, smoked cheese and gherkins.", "Welcome to /r/Nutrition - Here are the subbreddit rules, suggestions, and helpful links for mid-2018", "The /r/Nutrition Personal Nutrition Discussion Post (October 22, 2018) - All personal circumstance questions and evals pretaining to what you eat or might eat must use this post", "In your opinion, what is the least biased, most comprehensive source for learning about nutrition?", "Why do processed/presliced chicken/hams etc seem to have less calories/protein/fat than the values given for skinless chicken breast?", "Why do you eat healthy?", "Best nutrition instagrams?", "Health effects of caffeine on a non-responder?", "Zevia Hydration", "Naturally Occuring Trans Fat?", "Is it possible to overheat canned beans and if so, will they lose nutrient value?", "How bad is burnt bread for you?", "Which is worse, saturated fat or cholesterol?", "How to measure leafy greens?", "Cholesterol Question", "Is Arsenic in mineral complex drinks healthy?", "Marinated chicken calories?", "Correctly calculating cooked food nutritional info", "What kind of dietary fat raises or decreases IGF1?", "Can some explain how this white rice has 17g fiber per 100g??", "What are the latest offerings on wheat and soy-free plant protein products?", "Where to get zinc?", "What is the volume of your intestines?", "How do these tortillas only contain 50 calories?", "Science Friday: News in Nutrition (October 26, 2018) For discussion on the latest news and research in nutrition science", "How much fluid/water can you theoretically store by eating (an unlimited amount of) carbs?", "Which fruits it is ok to swallow the seeds?", "Will consuming antioxidants in natural form from healthy foods reduce inflammation and general damage from alcohol consumption later the same day? Recommendations on foods, if so?", "Does tuna has mercury on it ?", "The influence of food processing on metabolic response", "Keto - Changes in the gut microbiota are required for the anti-seizure", "What is the most efficient way to take L-Lysine to block L-Arginine absorption?", "if you drank a lot of booze all day and ate a healthy bean salad at the end of the day would you still get health benefits from it?", "Why does the difference in carbohydrates vs. protein/fat matter if you're still in a caloric deficit?", "Is there a difference between eating isolated sugar with fiber, than eating foods which contains both sugar and fiber?", "Get rid of excess salt from the body", "If I thoroughly rinse canned black beans will it get rid of most of the sodium?", "Is drinking soy milk bad for men?", "Effect of LCHF [keto] diet on LDL cholesterol and gene expression in normal-weight, young adults: A randomized controlled study [Retterstol et al., 2018]", "Calories in turkey steak per gram?", "Who do we trust about nutrition knowledge?", "Question about serving sizes and canned beans", "What is the issue with grains? Really?", "Caffeine Chocolate", "What food defy the “eat Whole Foods” rule", "Is it true you need to let chopped raw Garlic cloves sit for 10-15 minutes before eating them, so the enzymatic reaction for formation of sulfides happens (Alliin -&gt; Allicin)? Doesn't it happen instantly, within seconds?", "Front/advertising labeling requirements?", "What are some foods rich in healthy fats and vitamins but low in carbs and protein?", "Why does proteins/fibers make you feel satiated ?", "How to get your daily potassium intake?", "Best foods to balance out Cholesterol?", "How much influence does gut health have on bereavement?", "What happens to fat soluble vitamins if you're very lean?", "Just a question", "magnesium vs calcium in absorption", "How come only some of the vitamin C gets destroyed when heated, and not all of it?", "Fish oil taste question? Oxidation?", "Greens Powder", "Recommended books or Research articles discussing affects of estrogenic foods", "Are carbs and protein good for a sedentary lifestyle? What diet plan can work for them?", "Food fortification", "So about salt?", "Any clear list on what actually stimulates bile production?", "Question about Celery in Soup", "Are pharmacies looking for nutritionists?", "Kefir vs Kombucha", "Is too much tea (specifically Lipton Cold Brew) dangerous?", "GMO Peer reviewed journals", "Should you introduce milk in a healthy diet?", "Question about Herbalife", "What are the effects of eating unhealthy food on top of getting adequate micro-nutrients?", "How do you find the best nutritionist?", "Chew or swallow garlic?", "Is there anything in gluten-free oats that is not in normal oats?", "Protein classification ideas", "Whey protein - MyProtein or BulkPowder ...?", "Any decent app for counting calories alongside all nutritional information", "What fills you up?", "Green tea: does it count toward hydration for the day?", "Can ramen noodles have this little calories ?", "Good and bad proteins?", "Looking for common sources of vitamins a/e?", "CLA 1250 - Has anyone tried?", "What foods should powerlifters/spinters avoid?", "Looking for cheap sources of omega 3, 6 and 9 fats", "Zero Bars by Biotech - views?", "This frozen pizza has 6g of trans fat", "Does Cumin lower testosterone?", "What are some staples , besides the popular , go include daily in a healthy diet?", "Is butter on potatoes more healthy, less healthy, or no different than eating potatoes without butter?", "Why is there not a r/frugalnutrition?", "Is it possible to 'work off' saturated fat?", "How to best make sure daily intake requirements met?", "Nutritional value of raw cannabis?", "Best time of the day to take vitamin D supplements ?", "Keto – how long do you manage to stay on it?", "best meal/time of day to take magnesium supplement", "Why is pizza bad for you?", "Why is breakfast the most important meal of the day?", "Are the nutritional benefits of natto worth forcing myself to gag it down?", "Limits/benefits of acidic or alkaline food and drink?", "How much sugar a day is optimal how much is too much and whats too little and why? Thanks!", "Adderall &amp; Nutrient Depletion", "[Rules] Just Desserts, or: How I Learned to Stop Worrying and Love the Submissions Filter", "Use a piece of bread to butter your corn on the cob", "What’s something simple and yummy I can do with chicken livers?", "Craving (Korean Dish) Tteokbokki but don’t have rice cakes?", "An easy way to cook chicken quarters?", "Food Hack: Muffin Tin Oatmeal", "Using psychology to influence the taste and smell of food - research on how many of our senses affect taste to change the experience of dining.", "19 Food Hacks Everyone Should Know!", "For males, serving size for spaghetti pasta is the same as your erect girth.", "Guide to hot dog styles", "Making s’mores with fudge striped cookies is probably the best food hack Reddit has taught me", "A simple way to remember to save that precious pasta water before it's too late...just put your measuring cup in the strainer you'll be using for the finished pasta! Hopefully you'll see it before you pour...", "Cutting mango", "Can I use light/low calorie cream cheese instead of full fat cream cheese? Does it affect the taste?", "Dipping pizza in ranch dressing, is this a popular thing or no?", "Kitchen Hack for your limes to last longer", "Right Food To Maintain Your Diabetic Issues", "Food hack: you can use the center tray of an Oreo box for you favorite dip like Nacho Cheese or Salsa [pictured]", "What do your food labels mean?", "Student Blog with Food Budgeting Hacks", "Cooking bacon", "Got pesto? Fry and egg throw it on toast! Tasty breakfast addition!", "Repurpose leftover mac &amp; cheese with canned pasta sauce.", "We wanted spicy eggs for a protein kick. Just discovered chorizo", "How to get Anti Aging Antioxidants out of an Avocado!", "Use half an onion to put meat on a skewer (instead of poking your fingers)", "I think this counts...reheated French fries by refrying them in canola oil..tasted even a bit better, crispy on the outside fluffy on the inside", "Question: Is it safe to cook with ground beef that's been frozen and refrigerated but in an unsealed container?", "Did you guys know you can whip coconut cream? These waffles I made are dairy, gluten and cane-sugar free. (Made the chocolate sauce from palm sugar.)", "How do you eat your beans on toast?", "What are some good uses for ground chicken?", "Pie Advice", "What’s the easiest way to chop parsley and similar herbs", "Random grocery shopping and I have no clue what do with what I bought", "I brought home 20+ lbs of fresh sweet red peppers. What should I do with them?", "This is how to prevent a tiramisu form collapsing", "So, I totally stole this idea from Vietnamese recipes, when making chicken stock, aside from the regular mirapoix, i add fish sauce. Better than boullion. No one in the house knows i do this and chicken noodle soup is always super tasty. You’re welcome!", "Hot Dog Pro Tip: Double the Pleasure, Double the Fun", "Don’t have cherry pitter? Use this hack to pit your cherries the easy way 🍒", "Food hack for foreign travel: only eat stuff that makes sense.", "Small apartment hack: steam your tortillas on top of your countertop grill while meat is cooking", "Use Torani syrup in your graham cracker crust.", "Large flour tortillas make perfect bases for homemade pizza in 12 minutes", "Drain your coconut before you cut it, way easier and greatly reduces your chance of cutting yourself.", "So I have four boxes of instant brown rice", "A way to tell if an egg is still fresh", "Best way to re-heat leftover fried chicken", "I discovered that adding vinegar to a bowl of ramen noodles makes a surprisingly good substitute for Hot and Sour soup!", "What’s a food that’s ubiquitously liked as pizza, but is inclusive to vegetarian/GF eaters??", "How to make ramen better?", "Pops made a Lazy-Susan for his pizza oven - helps get an even bake and with taking it in/out of the oven", "Moist roast chicken", "Get a Costco churro and ask for chocolate sauce on the side.", "Cold butter hates this! This one trick for speedy grilled cheese will amaze you!", "How do I make a fake bread dessert?", "How do I make candied banana?", "Cooking some breakfast sausage with potatoes. Using the grease from the meat for the potatoes. I consider this a food hack. What do you all think?", "[Presentation] This tomato skin rose", "Make fluffier stove-top popcorn by replacing the lid with a tea towel", "How to store Cream of Chicken Soup?", "5 kitchen tools must have – Handy Kitchen Tools (Cheap but Very Useful)", "[OC] how to cut a watermelon", "How to Make Homemade Salsa The Easy Way", "9 inspiring tips To Strengthen Your Heart Health", "Saw themed", "Rehydrating bread", "Ordering Pho? Ask for “Fatty Broth” for a side of the rich oil/fat/flavor from the bones.", "TOP EASIEST BIRTHDAY CAKES IN THE THE WORLD | BEST BIRTHDAY CAKE DECORATION IN THE WORLD 2018", "HOW TO MAKE BREAD CRUMBS | Easycookingwithekta Food Hack", "Chicken and Dumplings", "Halloumi", "2 Ways to Cut a Red GRAPEFRUIT", "How to Make Rice Krispie Treat S'mores in Less Than 3 Minutes", "Probably more fitting here", "How to cut an Avocado without getting Dirty", "Wear those to chop onions if you have goggles like that lying around.", "Fastest way to make zucchini noodles !", "MEGA bite technology, Enjoy the bite!", "Great new veg/fruit to grow at HOME - Pepper Watermelon Hybrid", "How to Make South African Oatmeal Crunch", "Butter vs Spreadable Butter", "Maggi Curry Instant Noodles", "Slow Cooker Lentil &amp; Smoked Sausage Soup", "When cutting hot peppers, for the love of everything good in your life, wash your hands BEFORE you pee.", "10 Best Cheesecake in Japan !!", "Hack for making kebabs", "Guide to different types of coffee", "How to properly brown minced beef?", "[Question] I have pasta, no sauce..how to make one?", "Golden Sweet Cornbread", "Fellow Foodie Friends of Reddit, what is the best way to reheat fried potatoes so they're not crappy?", "Just figured out how to get 2 bags of food for the amount of 1", "Which beer is best for beer-can chicken?", "I got all of these lettuce, cucumbers and tomatoes for free. What's the best way to use them without getting sick of it?", "Shells n Cheese + Sriracha = Queso Macaroni", "Cut the hassle of shucking by cutting off the bottom of the ear!", "Just the tip", "Today I learned that you can use coffee filters to tie up your herbs and spices while they cook in a soup. Just shove all your spices into the coffee filter and tie into a pouch with butcher string. Then tie the string to the side of your pot for easy removal at the end of your cooking! Neat!", "Pepper Mango Hybrid - Taste is GREAT", "My avocados are dying.", "A Twist to Asian Sea Bream", "HealthyFood Self-Promotion Safe Zone October, 2018 - Tell us the latest news about your Healthy Food related site/blog/video/works in this post", "HealthyFood Monthly Raw Recipes Roundup October, 2018", "What are some foods that are commonly thought of as ‘healthy’ but really aren’t all that good for you?", "Favorite Healthy Dessert", "Avocado oil?", "Organic Bison, Halibut, Broccoli, Mixed Veggies, Jasmine Rice, and half an onion", "Eating dessert everyday", "What is your opinion on eating lean red meat daily combined with an active lifestyle and limited refined sugar?", "Breaking the fast! PS that’s cauli-mash in the right. Followed this up with a bowl of grains and 2 bone-in chicken thighs.", "A healthy alternative to chips.", "Quinoa/Couscous/Almonds/Avocado/Flax/Green Lentils/Spinach (*lightly* sautéed)/Basil/Tomato/Carrots/Onion/Mushrooms/Spices", "Changing my unhealthy eating lifestyle!", "Preparation chicken soup with fresh and dried mashroums, leek, onion, carrots, celery and parsley", "If I gave you a list of food, could you suggest a meal or recipe?", "Vegan rice noodles with homemade coconut cream and homemade hot sauce.", "Grilled chicken, fig goat cheese, cherry tomato, apple, and blueberry salad w/honey mustard vinaigrette (703 cal)", "Suggestions for quick healthy foods for someone with no time to cook or meal prep.", "Guys it’s 12:30am and I just ordered general tsaos chicken and fried rice on an impulse bc I’m hungry. Now the food is on the way and I regret ordering it. I spent $20 on food I don’t need and that will only take away from the progress I’ve been making.", "Neck pain despite neck pillow?", "Strawberry coconut greek yogurt, cashews, &amp; apple slices (350 cals) 😛 nice little afternoon meal", "Kale, chickpea and Parmesan stew. From Jack Bishop’s “A Year in a Vegetarian Kitchen.”", "Cauliflower cheese grill, topped w/ poached egg &amp; sesame seeds w/ roasted veg on the side", "Packing quick &amp; easy breakfast for work ;)", "Need help with easy healthy portable breakfasts for winter", "Is the risk for diabetes that high with white rice? Family history has high risk of diabetes.", "Vegetable Stir-Fry", "What's the \"best\" balanced diet?", "Acne diet!!", "This week's yogurt batch (instant pot, strained 3 hours)", "I need help, I’m out of control", "Chocolate?", "How many calories should you eat in a day?", "A horrible quality photo a food I forgot to take a photo of before I started eating it. Salmon burger patty with mixed spinach, broccoli, and carrots on the side. Yum!", "I need major help.. I have a terrible diet that I want to change, but I realized I don't even remotely know where to begin.", "Lunches for the week! Baked potato and sweet potato, beets, tomatoes, cucumbers, roasted garlic, pine nuts, mixed beans and carrots!", "Pesto kohlrabi noodles", "Salad of broccoli, tomatoes, picklrd cauliflower, bell mushrooms, red and green bell peppers, sliced almonds, and baby carrots topped with nutritional yeast", "Coconut Porridge with Chopped Spinach and Banana", "Moroccan spiced baked chicken breast, lightly charred asparagus and sambal.", "HealthyFood Item of the Week. Post recipes or information related to - Romaine Lettuce", "Grilled corn chowder", "Red lentil daal - makes 6 servings", "Lunch today! Clementines, strawberries, deli sliced salami, yogurt with no added sugars.", "Pretty Ugly: chicken apple sausage, roast Brussels sprouts, home fermented red cabbage and beet sauerkraut, homemade mustard.", "Low or no sugar baking", "Study of Rural New York State Homes Finds Pesticides in Every Sample Tested", "How to eat healthy?", "Cauliflower n’ cheese w/ chicken hotdogs", "Would you consider this ice cream \"healthy\"?", "I need help figuring out measurements for grapes.", "Green Vegetables with Shaved Beef Striploin", "Any of you guys like the KFC grilled chicken?", "StarKist admits fixing tuna prices, faces $100 million collusion fine", "NYC health department calls on food and beverage makers to cut sugar", "Fire up some chicken with Turkish spices and coconut oil. Poured in a whole jar of kimchi, and a few handfuls of kale and vegetable stock. Let simmer for a while and it was delicious!", "Ginger vs Turmeric vs Ginseng", "Beer Can Chicken (aka- also Dr. Pepper Chicken)", "EPA Abuses Emergency Pesticide Exemptions, Greenlights Unsafe Pesticide Use", "Is this healthy? Chick filla.", "Teriyaki Beef Skewers on a rice and spinach bed (Under 500 Calories)", "What's a good fruit/veg to introduce myself to?", "Apple chicken salad over baby arugula with homemade vinaigrette 😋", "Quick question... are green supplements any good and if so can you guys reccomend some good products?", "Organic, Gluten-Free, Sugar-Free, Grain-Free Cookies", "4 oz of 99% fat free ground turkey + 1 oz red lentil rotini pasta = 220 calorie meal with 33.5 grams of protein. Flavored with ~ 1/4 cup of traditional Prego sauce which only adds ~30 more calories!", "Lunch meat from the Deli vs. pre-packaged lunch meat", "Great 7 day meal plan?", "I am looking for some new recipes", "Looking for a healthier BBQ sauce!", "HealthyFood Vegetarian or Vegan Recipes You Enjoy - October, 2018", "Which are better for me: salted almonds or unsalted cashews?", "Help! Share your recipes with me", "Healthy Snack Ideas for Picky Husband", "Smoothie recipes.", "One of my favorite fall meals: Acorn squash stuffed with ground turkey, mushrooms, carrots, apple, and panko. Roasted brussels and potatoes on the side.", "Vegan Ginger cinnamon rolls with apple filling", "Miso Mushroom Pho", "HealthyFood Item of the Week. Post recipes or information related to - Raspberries", "Messy... but whole wheat toast, hummus, tomato, smoked salmon, egg, and seaweed! My favorite breakfast!", "Meal prep: Balsamic Moderna chicken, seared zucchini, spinach and ricotta tortellini, fresh greens salad with cilantro lime dressing. Plum and soft Swiss for breakfast", "My breakfast today", "Low calorie topping to pancake", "Whole wheat english muffin with scallion, tomatoes, and hummus; fresh cherries; raw nuts and dried fruit.", "Less harmful alternative to soda", "Doing Diabetes Awareness presentations at various institutions are always a good time, especially when they serve us some awesome snacks! 😁👍 #healthysnacks", "Steamed broccoli with baked kale end rice topped off with a homemade teriyaki pork belly", "Does blending salad mixes (raw spinach, kale, rocket etc) in water alter the nutrition?", "Vegan Maitaki Mushrooms layered over Baby Sweet Peppers, Resting on Sauteed Spinach cooked in Full Spectrum Hemp Avocado Oil", "Chickpeas with veggies.", "Poached eggs, roasted asparagus, various other veggies and quinoa", "Major stomach pain from avocado and quinoa.", "Ginger chicken with mushrooms and purple cauliflower.", "Is my snack healthy?", "Healthy foods for losing weight?", "What is the best overall diet for weight loss + health, wellness and nutrition. Aiming either way to do low carb and sugar. Paleo, Keri, Whole 30, South Beach, Atkins etc....", "Looking for vegan recipe developer!", "Roasted veggies and garbanzo beans over quinoa", "I love sprinkling nutritional yeast on a lot of what I eat. It adds more protein and vitamins while also adding more flavor 😍", "Veggie quesadilla. The wrap is 80 calories. I eat this for dinner every day", "Starchy Carbs make me full, protein and fat don't...", "Quick lunch ideas", "HealthyFood Ketogenic Recipes You Enjoy - October, 2018", "Your Daily Fasting Thread", "(break) Fast Food Friday - Your weekly delicious breakfast meals thread", "Fasting makes me feel better about my (lack of) natural disaster prep.", "Fasting and bingeing", "Dont enjoy much anymore, low dopamine?", "Study finds that \"intermittent fasting prevented memory loss\" in rat model for Alzheimer's disease", "Becoming irritable on fast days", "You guys rock!", "Anyone else in here an avid Tea drinker?", "Fasting until a goal weight?", "3 eating disorders over my life and intermittent fasting is truly what makes me happy!", "Can I workout with DOMS (muscle soreness)?", "400 hour fast completed at goal weight", "Gained back the weight", "Need a buddy for the last day :)", "Only lost a pound", "Fasting until Thursday morning anyone want to join?!", "[Question] first time hitting 20hrs I ate this and won’t feel hungry?", "Does Kimchi break a fast?", "An idea we're all familiar with", "Apparently I'm obese 21.5 BMI but 33% body fat", "Water Fasting", "Just finished my first 4 days of my autophagy water fast. Apparently this is when the magic starts happening. :)", "Looking for a fasting buddy", "No better time than now!", "What are your thoughts with supplements on an extended fast?", "Just got blood work back", "It's insane how I can eat junk without gaining any weight with 16:8", "Extended Fasts effect testosterone negatively? Should IF be utilized instead?", "Fasting suppliments", "Curious about mood lift from fasting", "My First Ever Prolonged Fast! 91h30mins", "Broke up with bf, depressed, need fasting buddy", "I saw this vid explaining diff kinds of fasting. It convinced me to do 24hr fast. Your thoughts?", "Fasting is causing me bad body image issues...", "Strong stomach aches when breaking the fast", "Refeeding syndrome has me worried", "Poem on fasting by 13th century Sufi Master", "Rate my 3-day water fasting stock", "Newbie to Fasting - any tips for my first 48 hour fast?", "Water Diet (14 Days)", "Notes on fixing food habits", "Is it true that fasting creates less loose skin?", "Curing depression with fasting?", "Finally got my electrolytes perfect on this fast", "Dreams so real", "At what point does mental clarity come back?", "After about 6 months of experimenting I created a fasting schedule that fits me perfectly. What are your thoughts on it?", "Doing IF,EF, OMAD but results not what I expected /S(TGIF)", "Need motivation!!", "5:2 question", "Supplements", "Anyone else have better success with ADF and short term fasts?", "couldn't hit 24...finally made it to 45!!", "About fasting for a day while doing calorie restriction", "Crude question, but do you know anyone who has fixed sagging skin by fasting?", "Can fasting be dangerous", "feeling drunk early on", "So I’ve been doing 30-42 hours of fasting with one meal, mainly something keto friendly and constant workouts. But yesterday I fell off the wagon for a date day. Breads, booze and all that jazz. Is that going to effect my progression tremendously? Will my body hold these calories longer?", "Hit new landmark after 65 hour fast!", "\"That's not going to taste or feel any better today than it will tomorrow!\"", "Track fasting hours per week?", "Advice for fasting at school?", "Started another 21-day water fast", "Whenever I fast, even for just 24-36 hours, it always leads to binge eating.", "IF for 7 months - thinnest I've been in 19 years!", "Me convincing myself not to eat while fasting", "Odd Circumstances Regarding Breaking A 10 Day Fast", "Optimal Time Frame For Me?", "Sleeping A Lot While Water Fasting", "Anyone wanna join me for a 7 day fast starting tomorrow (10/26)?", "Am I at risk for refeeding syndrome?", "What to eat after breaking your fast", "Supplements while fasting?", "Day 10 of water fast. My breath is absolutely disgusting", "Water fasting supplements", "Why do you lose so much water weight during a fast, when the only thing you are actually consuming is water?", "Fasting with Hypothyroidism", "Fasting depression", "Fasting after Prednisone weight gain?", "Need help breaking fast.", "Fasting around kids", "Weight gain while intermittent fasting", "Closer to Jesus", "ELI5: Why do we lose water weight?", "What's your refeed plan?", "How many days to recover after 5 day fast", "Daily deficit vs short fasts?", "How long are nutrients stored in the body?", "Tightness in chest/ lungs while on 3rd day of water fast", "Wwhat kind of fasting works best long term?", "Post your electrolyte mix", "Another user asked to post before and after pics for motivation so here you go! 80.2kg to 61.4kg :)", "So.. how do you maintain your goal weight once reached?", "3.5 days in WF and I can’t stop thinking about food!", "Face gains - 2 years of keto and OMAD and extended fasts*", "What and how much to eat when I finish my 108 hour fast?", "29/M/5’10 (245#&gt;198#) 2 months of doing 3-5 day fasts +OMAD", "7th day of fasting complete!", "Fix Me Fridays (Oct 26, 2018)", "Ask /r/fitmeals, Week of Oct 22, 2018", "Recommendations for a blender?", "Storing Cooked Rice Overnight", "Is there anything wrong with blending frozen uncooked peas into a smoothie?", "Best method/recipe for hot instant oatmeal + protein powder?", "Protein shake help", "Help! I forgot my lunch!", "Critique of my Meal Plan", "Fellow redditors, I need some advice on how to get 2500 calories a day with just 2 meals", "New to fitness - need guidance", "What’s a good complex carb for smoothies?", "Chicken breasts and broccoli can be delicious.", "Construction worker that often has no access to microwaves etc. looking for minimal prep lunches and snacks to take to work 6 days a week?", "Pumpkin Spice Protein Shake - Basic Bitch Level: Expert", "Fix Me Fridays (Oct 19, 2018)", "My chicken breast only has 15g protein per 100g?", "grab n go breakfast?", "Low calorie snacks when on a diet", "GREEN SMOOTHIES NOURISH MY BODY AND MIND!", "Ask /r/fitmeals, Week of Oct 15, 2018", "Protein powder makes me nauseous, help!", "How much sugar is too much sugar?", "New Recipe: Delicious Protein Pumpkin Pancakes, Easy At Home", "Fix Me Fridays (Oct 12, 2018)", "Looking for a vegetarian dish with a decent amount of protein and that can be meal prepped for up to five days [Recipes]", "Are there any decent free apps that can create a meal plan", "Ask /r/fitmeals, Week of Oct 08, 2018", "This is quite the breakfast power house", "Food for Thought", "What is your go-to \"no prep\" meal?", "Fix Me Fridays (Oct 05, 2018)", "What is your go to healthy meal?", "What will happen if I replace the flour in this recipe with vital wheat gluten?", "Kinetic Waffle's 1g Carb Tendies: MK1 (Fried chicken FOR KETO!)", "Ask /r/fitmeals, Week of Oct 01, 2018", "Recently I discovered that scrambled eggs with some store bought salsa is super cheap, fast, and easy. What other scrambled-eggs-plus-one-ingredient recipes do you guys use?", "Meal Prep from my trainer: Turkey Tacos Per taco: 241 calories, 9 grams fat, 18 grams protein, 13.5 grams carbs", "Treats", "I broke my leg bouldering- I'm essentially bedridden for another 3 weeks. What should I eat to retain muscle and general health?", "Looking for kid friendly meals that are EXTREMELY low in saturated fat and cholesterol. No trans fat, obv", "Is my high protein plan any good?", "Is it okay to have ONLY 2 hard boiled eggs for breakfast every morning (with coffee)?", "What kind of snacks do you keep at your desk? If any?", "Fix Me Fridays (Sep 28, 2018)", "Tweaking overnight oats", "Can someone also critique my meal plan while on a cut?", "Can someone critique my meal plan?", "25M ectomorph asking for inspiration and ideas", "Breakfast Banana Pancakes", "1300 calorie meal plan help?", "Can you help me create a high protein pumpkin cornbread recipe?", "Ask /r/fitmeals, Week of Sep 24, 2018", "Need Help With Meals", "Whats your favorite high-carb meal ?", "Made a tool for comparing the satiety and protein content between foods", "Looking for non-salad low carb meals", "How many calories there are in one whole walnut ?", "Fix Me Fridays (Sep 21, 2018)", "Maximum ratio of pea protein to flour in recipes?", "What are your all-time favorite blender smoothies?", "Healthy spinach salad dressing?", "Heart Healthy Recipes!", "Ask /r/fitmeals, Week of Sep 17, 2018", "Fix Me Fridays (Sep 14, 2018)", "Absolutely perfect protein fluff", "Oatmeal and PreWorkout Mealprep for 10 days", "Meal prep is my weakness", "What's an easy vegetable to add to salsa chicken?", "Which live Canadian oysters are meatiest, and befit steaming?", "Ask /r/fitmeals, Week of Sep 10, 2018", "Fix Me Fridays (Sep 07, 2018)", "Natural chocolate sweets/snacks?", "Help making overnight oats actually taste good", "Freezing fresh spinach?", "Crashing after post-workout shake", "Avoiding snacks", "High protein tuna wrap", "Smoothie/shake ideas (available ingredients listed)", "Ask /r/fitmeals, Week of Sep 03, 2018", "Fix Me Fridays (Aug 31, 2018)", "Cooking by myself", "I just made oatmeal with a scrambled egg in it. Life changing.", "What are some healthy Middle Eastern/Middle Eastern inspired recipes?", "What is your favourite vegetable and how do you like to eat it?", "Meal plan for the month", "What are the best recipes with mocha coffee flavoured protein powder?", "Ask /r/fitmeals, Week of Aug 27, 2018", "I just got an Instant Pot. Any easy and delicious meals to bring to work?", "Can you help me tweak my choices", "Friday night and I'm all fired up to eat some crickets.", "Fix Me Fridays (Aug 24, 2018)", "does my breakfast smoothie have too much fruit?", "Milk replacements with a similar macro nutrient profile?", "How do you eat Sauerkraut??", "Has anyone added whey to homemade nut butter", "Any recommendations for healthy spicy meals?", "Protein powder that isn't gross?", "What is your weirdest food creation that was fueled by your fitness?", "Brown Toasts with Peanut Butter before going to the Gym?", "Ask /r/fitmeals, Week of Aug 20, 2018", "Less olive oil?", "Dad bought a lobster around 11am EST, put it in tap water about an hour later. I think it died a bit ago. What should my dad do?", "What's the secret for the best spaghetti and meatballs?", "Uses for sauerkraut?", "What is a good aromatic substitute for celery?", "How do you debug broccoli?", "\"Tofu Legends: Tujia Grandma's Tofu Life\" - a mini-documentary about an extraordinary Chinese peasant woman who grows soybeans and cooks tofu from scratch (13 minutes about tofu, 13 minutes about other food)", "Toaster oven recipes ?!?!", "What is the best thing you have ever cooked?", "Favorite mushroom dishes &amp; recipes?", "How to potentially salvage a bad restaurant Kung Pao sauce?", "Reddit, what are your favourite hot chocolate recipes/methods/tips?", "What are some of your booziest recipes?", "I've been tasked with bringing chicken for the grill for a BBQ gathering tonight. Any recommendations to impress?", "Alton Brown's Reboot of Good Eats", "Best way to make home made vegetable stock without it being bitter.", "An attempt at butterscotch pie", "I moved to an area of town with several Mediterranean markets, what should I look for when I go in?", "Two questions regarding pulled pork via pork shoulder", "Cast Iron- Rust and discoloration?", "I just bought a 10lb slab of brisket. Now what to do?", "Lunches for husband", "Is there a website that teaches culinary arts for free?", "What are some good pasta machines?", "Canned tomatillos any good?", "Recommendations for flavoring ricotta?", "Sherry: Cooking Wine or Drinking Wine for French Onion Soup?", "Calling All Miso Lovers", "Question about cooking chicken breast", "What are your must-do curry tips?", "Guy savoy's simple french recipes for the home cook.", "Frittata, milk/cream yes or no?", "How to butcher an entire cow", "clueless girl salmon question", "What’s the worst thing you’ve ever cooked?", "What's ur favorite mashed potatoes recipe? VERY IMPORTANT. MAKING WITHIN 2 HOURS", "What would you include in an Israeli cooking class?", "Can you put Shishito Peppers in hot pot?", "One Koji To Rule Them All?", "Any pretty easy dessert suggestions for a restaurant?", "I'm hungry for chili but I want something more interesting or offbeat. Anybody got a suggested recipe?", "What to do with fresh Thai chilis?", "How do I cook rice without it sticking to the pan?", "Has anyone here ever accidentally poisoned themselves/other?", "Shepard's Pie", "Easy Tom Yum soup?", "Help finding a dumpling recipe", "How to get enamel off of electric coil?", "Baked peanut butter deserts?", "Freezing sweet potato?", "Whole bunch of peppers", "Alcohol alternatives in homemade ice cream", "What could i use duck fat for?", "how do you cook with soy sauce?", "black dots on apples?", "Criminally underrated food - razor clams", "Rice cooker replacement upgrade?", "looking for a pizza like dip for bread. any ideas on recipes? something tomato saucey and somewhat cheesy", "How do you prepare canned green beans?", "What is your favorite pork chop recipe?", "[Recipe Request] Creamless \"Carbonara\"?", "The best sweet potato hash browns", "What makes the perfect burger?", "Woman who created green bean casserole dies at 92", "Aspiring Chef looking for deals!", "I just took 3 hours to cut a bunch of chicken I bought off of Costco with the same knife. Am I screwed?", "For all you SEAFOOD LOVERS - Yummy Prawn/Shrimp Masala Recipe!!", "How realistic is it to become a private chef right out of culinary school?", "Porchetta with no skin on the belly?", "Help me decide what to put in tonight’s curry!", "Favourite recipe using organ meats?", "Are there any good recipes involving carving pumpkins?", "Looking for help/tips on choosing a cooktop", "Roast Tenderloin Recipe", "Is western mustard powder the same as oriental mustard powder?", "Anyone have a recipe for the chicken you get in tacos from Southern California taquerias?", "Rinsing / cleaning dried chili peppers before making a chili paste?", "Are cookies really THAT fickle that if you don't cream the butter and sugar enough, it'll turn into sawdust?", "Roasted broccoli is turning out soggy", "MYSTERY DISH - My mom used to make this casserole dish called \"Enzeti\" that was a favorite of mine growing up. She passed away when I was 17 and I never learned its origins. Can Reddit help?", "what do with potatoes in under an hour?!", "What is a substitute for potatoes that tastes just like potatoes?", "Does anyone have any good resources/tips for basic cooking techniques that can be applied to a broad range of dishes?", "What home cooked, fast food does your family typically have ready in your kitchen?", "Reheating pasta", "Recipe substitute question! Pumpkin Coconut Sheet Cake", "Reverse Searing a second time to get a higher internal temp?", "What to do with 10lbs of smoked ham", "Tips", "So, how long can a brought lunch really sit out? What if it's frozen?", "Q: Do you pan sear your pork carnitas burrito?", "How to make white queso thick and creamy like from a restaurant?", "Fingerfood / Snack for birthday at office", "Sandwich condiments/toppers", "What’s the Spam of your country?", "Eating spicy food in America.", "Must walnuts (or any other nuts) be soaked and rinsed before consuming?", "I adore sandwiches, but I'm trying to cut carbs. What's a girl to do?!", "How long does fresh blood keep?", "So what's the difference between Ricotta Cheese and Paneer?", "I was inspired to make merengue cookies after binging The Great British Bake Off"]}